/* automatically generated by rust-bindgen 0.58.1 */

#[repr(C)]
#[derive(Copy, Clone, Debug, Default, Eq, Hash, Ord, PartialEq, PartialOrd)]
pub struct __BindgenBitfieldUnit<Storage> {
    storage: Storage,
}
impl<Storage> __BindgenBitfieldUnit<Storage> {
    #[inline]
    pub const fn new(storage: Storage) -> Self {
        Self { storage }
    }
}
impl<Storage> __BindgenBitfieldUnit<Storage>
where
    Storage: AsRef<[u8]> + AsMut<[u8]>,
{
    #[inline]
    pub fn get_bit(&self, index: usize) -> bool {
        debug_assert!(index / 8 < self.storage.as_ref().len());
        let byte_index = index / 8;
        let byte = self.storage.as_ref()[byte_index];
        let bit_index = if cfg!(target_endian = "big") {
            7 - (index % 8)
        } else {
            index % 8
        };
        let mask = 1 << bit_index;
        byte & mask == mask
    }
    #[inline]
    pub fn set_bit(&mut self, index: usize, val: bool) {
        debug_assert!(index / 8 < self.storage.as_ref().len());
        let byte_index = index / 8;
        let byte = &mut self.storage.as_mut()[byte_index];
        let bit_index = if cfg!(target_endian = "big") {
            7 - (index % 8)
        } else {
            index % 8
        };
        let mask = 1 << bit_index;
        if val {
            *byte |= mask;
        } else {
            *byte &= !mask;
        }
    }
    #[inline]
    pub fn get(&self, bit_offset: usize, bit_width: u8) -> u64 {
        debug_assert!(bit_width <= 64);

pub const VA_CHROMA_SITING_HORIZONTAL_LEFT: u32 = 4;
pub const VA_CHROMA_SITING_HORIZONTAL_CENTER: u32 = 8;
pub const VA_SOURCE_RANGE_UNKNOWN: u32 = 0;
pub const VA_SOURCE_RANGE_REDUCED: u32 = 1;
pub const VA_SOURCE_RANGE_FULL: u32 = 2;
pub const VA_TONE_MAPPING_HDR_TO_HDR: u32 = 1;
pub const VA_TONE_MAPPING_HDR_TO_SDR: u32 = 2;
pub const VA_TONE_MAPPING_HDR_TO_EDR: u32 = 4;
pub const VA_TONE_MAPPING_SDR_TO_HDR: u32 = 8;
pub const VA_DEINTERLACING_BOTTOM_FIELD_FIRST: u32 = 1;
pub const VA_DEINTERLACING_BOTTOM_FIELD: u32 = 2;
pub const VA_DEINTERLACING_ONE_FIELD: u32 = 4;
pub const VA_DEINTERLACING_FMD_ENABLE: u32 = 8;
pub const VA_DEINTERLACING_SCD_ENABLE: u32 = 16;
pub const VA_PROC_HVS_DENOISE_DEFAULT: u32 = 0;
pub const VA_PROC_HVS_DENOISE_AUTO_BDRATE: u32 = 1;
pub const VA_PROC_HVS_DENOISE_AUTO_SUBJECTIVE: u32 = 2;
pub const VA_PROC_HVS_DENOISE_MANUAL: u32 = 3;
pub const VA_3DLUT_CHANNEL_UNKNOWN: u32 = 0;
pub const VA_3DLUT_CHANNEL_RGB_RGB: u32 = 1;
pub const VA_3DLUT_CHANNEL_YUV_RGB: u32 = 2;
pub const VA_3DLUT_CHANNEL_VUY_RGB: u32 = 4;
pub const _STDIO_H: u32 = 1;
pub const __GNUC_VA_LIST: u32 = 1;
pub const _____fpos_t_defined: u32 = 1;
pub const ____mbstate_t_defined: u32 = 1;
pub const _____fpos64_t_defined: u32 = 1;
pub const ____FILE_defined: u32 = 1;
pub const __FILE_defined: u32 = 1;
pub const __struct_FILE_defined: u32 = 1;
pub const _IO_EOF_SEEN: u32 = 16;
pub const _IO_ERR_SEEN: u32 = 32;
pub const _IO_USER_LOCK: u32 = 32768;
pub const _IOFBF: u32 = 0;
pub const _IOLBF: u32 = 1;
pub const _IONBF: u32 = 2;
pub const BUFSIZ: u32 = 8192;
pub const EOF: i32 = -1;
pub const SEEK_SET: u32 = 0;
pub const SEEK_CUR: u32 = 1;
pub const SEEK_END: u32 = 2;
pub const P_tmpdir: &'static [u8; 5usize] = b"/tmp\0";
pub const _BITS_STDIO_LIM_H: u32 = 1;
pub const L_tmpnam: u32 = 20;
pub const TMP_MAX: u32 = 238328;
pub const FILENAME_MAX: u32 = 4096;
pub const L_ctermid: u32 = 9;
pub const FOPEN_MAX: u32 = 16;
pub const __HAVE_FLOAT128: u32 = 0;
pub const __HAVE_DISTINCT_FLOAT128: u32 = 0;
pub const __HAVE_FLOAT64X: u32 = 1;
pub const __HAVE_FLOAT64X_LONG_DOUBLE: u32 = 1;
pub const __HAVE_FLOAT16: u32 = 0;
pub const __HAVE_FLOAT32: u32 = 1;
pub const __HAVE_FLOAT64: u32 = 1;
pub const __HAVE_FLOAT32X: u32 = 1;
pub const __HAVE_FLOAT128X: u32 = 0;
pub const __HAVE_DISTINCT_FLOAT16: u32 = 0;
pub const __HAVE_DISTINCT_FLOAT32: u32 = 0;
pub const __HAVE_DISTINCT_FLOAT64: u32 = 0;
pub const __HAVE_DISTINCT_FLOAT32X: u32 = 0;
pub const __HAVE_DISTINCT_FLOAT64X: u32 = 0;
pub const __HAVE_DISTINCT_FLOAT128X: u32 = 0;
pub const __HAVE_FLOATN_NOT_TYPEDEF: u32 = 0;
pub type size_t = ::std::os::raw::c_ulong;
pub type wchar_t = ::std::os::raw::c_int;
#[repr(C)]
#[repr(align(16))]
#[derive(Debug, Copy, Clone)]
pub struct max_align_t {
    pub __clang_max_align_nonce1: ::std::os::raw::c_longlong,
    pub __bindgen_padding_0: u64,
    pub __clang_max_align_nonce2: u128,
}
#[test]
fn bindgen_test_layout_max_align_t() {
    assert_eq!(
        ::std::mem::size_of::<max_align_t>(),
        32usize,
        concat!("Size of: ", stringify!(max_align_t))
    );
    assert_eq!(
        ::std::mem::align_of::<max_align_t>(),
        16usize,
        concat!("Alignment of ", stringify!(max_align_t))
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<max_align_t>())).__clang_max_align_nonce1 as *const _ as usize
        },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(max_align_t),
            "::",
            stringify!(__clang_max_align_nonce1)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<max_align_t>())).__clang_max_align_nonce2 as *const _ as usize
        },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(max_align_t),
            "::",
            stringify!(__clang_max_align_nonce2)
        )
    );
}
pub type __u_char = ::std::os::raw::c_uchar;
pub type __u_short = ::std::os::raw::c_ushort;
pub type __u_int = ::std::os::raw::c_uint;
pub type __u_long = ::std::os::raw::c_ulong;
pub type __int8_t = ::std::os::raw::c_schar;
pub type __uint8_t = ::std::os::raw::c_uchar;
pub type __int16_t = ::std::os::raw::c_short;
pub type __uint16_t = ::std::os::raw::c_ushort;
pub type __int32_t = ::std::os::raw::c_int;
pub type __uint32_t = ::std::os::raw::c_uint;
pub type __int64_t = ::std::os::raw::c_long;
pub type __uint64_t = ::std::os::raw::c_ulong;
pub type __int_least8_t = __int8_t;
pub type __uint_least8_t = __uint8_t;
pub type __int_least16_t = __int16_t;
pub type __uint_least16_t = __uint16_t;
pub type __int_least32_t = __int32_t;
pub type __uint_least32_t = __uint32_t;
pub type __int_least64_t = __int64_t;
pub type __uint_least64_t = __uint64_t;
pub type __quad_t = ::std::os::raw::c_long;
pub type __u_quad_t = ::std::os::raw::c_ulong;
pub type __intmax_t = ::std::os::raw::c_long;
pub type __uintmax_t = ::std::os::raw::c_ulong;
pub type __dev_t = ::std::os::raw::c_ulong;
pub type __uid_t = ::std::os::raw::c_uint;
pub type __gid_t = ::std::os::raw::c_uint;
pub type __ino_t = ::std::os::raw::c_ulong;
pub type __ino64_t = ::std::os::raw::c_ulong;
pub type __mode_t = ::std::os::raw::c_uint;
pub type __nlink_t = ::std::os::raw::c_ulong;
pub type __off_t = ::std::os::raw::c_long;
pub type __off64_t = ::std::os::raw::c_long;
pub type __pid_t = ::std::os::raw::c_int;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct __fsid_t {
    pub __val: [::std::os::raw::c_int; 2usize],
}
#[test]
fn bindgen_test_layout___fsid_t() {
    assert_eq!(
        ::std::mem::size_of::<__fsid_t>(),
        8usize,
        concat!("Size of: ", stringify!(__fsid_t))
    );
    assert_eq!(
        ::std::mem::align_of::<__fsid_t>(),
        4usize,
        concat!("Alignment of ", stringify!(__fsid_t))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<__fsid_t>())).__val as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(__fsid_t),
            "::",
            stringify!(__val)
        )
    );
}
pub type __clock_t = ::std::os::raw::c_long;
pub type __rlim_t = ::std::os::raw::c_ulong;
pub type __rlim64_t = ::std::os::raw::c_ulong;
pub type __id_t = ::std::os::raw::c_uint;
pub type __time_t = ::std::os::raw::c_long;
pub type __useconds_t = ::std::os::raw::c_uint;
pub type __suseconds_t = ::std::os::raw::c_long;
pub type __suseconds64_t = ::std::os::raw::c_long;
pub type __daddr_t = ::std::os::raw::c_int;
pub type __key_t = ::std::os::raw::c_int;
pub type __clockid_t = ::std::os::raw::c_int;
pub type __timer_t = *mut ::std::os::raw::c_void;
pub type __blksize_t = ::std::os::raw::c_long;
pub type __blkcnt_t = ::std::os::raw::c_long;
pub type __blkcnt64_t = ::std::os::raw::c_long;
pub type __fsblkcnt_t = ::std::os::raw::c_ulong;
pub type __fsblkcnt64_t = ::std::os::raw::c_ulong;
pub type __fsfilcnt_t = ::std::os::raw::c_ulong;
pub type __fsfilcnt64_t = ::std::os::raw::c_ulong;
pub type __fsword_t = ::std::os::raw::c_long;
pub type __ssize_t = ::std::os::raw::c_long;
pub type __syscall_slong_t = ::std::os::raw::c_long;
pub type __syscall_ulong_t = ::std::os::raw::c_ulong;
pub type __loff_t = __off64_t;
pub type __caddr_t = *mut ::std::os::raw::c_char;
pub type __intptr_t = ::std::os::raw::c_long;
pub type __socklen_t = ::std::os::raw::c_uint;
pub type __sig_atomic_t = ::std::os::raw::c_int;
pub type int_least8_t = __int_least8_t;
pub type int_least16_t = __int_least16_t;
pub type int_least32_t = __int_least32_t;
pub type int_least64_t = __int_least64_t;
pub type uint_least8_t = __uint_least8_t;
pub type uint_least16_t = __uint_least16_t;
pub type uint_least32_t = __uint_least32_t;
pub type uint_least64_t = __uint_least64_t;
pub type int_fast8_t = ::std::os::raw::c_schar;
pub type int_fast16_t = ::std::os::raw::c_long;
pub type int_fast32_t = ::std::os::raw::c_long;
pub type int_fast64_t = ::std::os::raw::c_long;
pub type uint_fast8_t = ::std::os::raw::c_uchar;
pub type uint_fast16_t = ::std::os::raw::c_ulong;
pub type uint_fast32_t = ::std::os::raw::c_ulong;
pub type uint_fast64_t = ::std::os::raw::c_ulong;
pub type intmax_t = __intmax_t;
pub type uintmax_t = __uintmax_t;
pub type VADisplay = *mut ::std::os::raw::c_void;
pub type VAStatus = ::std::os::raw::c_int;
extern "C" {
    pub fn vaErrorStr(error_status: VAStatus) -> *const ::std::os::raw::c_char;
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct _VARectangle {
    pub x: i16,
    pub y: i16,
    pub width: u16,
    pub height: u16,
}
#[test]
fn bindgen_test_layout__VARectangle() {
    assert_eq!(
        ::std::mem::size_of::<_VARectangle>(),
        8usize,
        concat!("Size of: ", stringify!(_VARectangle))
    );
    assert_eq!(
        ::std::mem::align_of::<_VARectangle>(),
        2usize,
        concat!("Alignment of ", stringify!(_VARectangle))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<_VARectangle>())).x as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(_VARectangle),
            "::",
            stringify!(x)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<_VARectangle>())).y as *const _ as usize },
        2usize,
        concat!(
            "Offset of field: ",
            stringify!(_VARectangle),
            "::",
            stringify!(y)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<_VARectangle>())).width as *const _ as usize },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(_VARectangle),
            "::",
            stringify!(width)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<_VARectangle>())).height as *const _ as usize },
        6usize,
        concat!(
            "Offset of field: ",
            stringify!(_VARectangle),
            "::",
            stringify!(height)
        )
    );
}
pub type VARectangle = _VARectangle;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct _VAMotionVector {
    pub mv0: [i16; 2usize],
    pub mv1: [i16; 2usize],
}
#[test]
fn bindgen_test_layout__VAMotionVector() {
    assert_eq!(
        ::std::mem::size_of::<_VAMotionVector>(),
        8usize,
        concat!("Size of: ", stringify!(_VAMotionVector))
    );
    assert_eq!(
        ::std::mem::align_of::<_VAMotionVector>(),
        2usize,
        concat!("Alignment of ", stringify!(_VAMotionVector))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<_VAMotionVector>())).mv0 as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(_VAMotionVector),
            "::",
            stringify!(mv0)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<_VAMotionVector>())).mv1 as *const _ as usize },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(_VAMotionVector),
            "::",
            stringify!(mv1)
        )
    );
}
pub type VAMotionVector = _VAMotionVector;
pub type VAMessageCallback = ::std::option::Option<
    unsafe extern "C" fn(
        user_context: *mut ::std::os::raw::c_void,
        message: *const ::std::os::raw::c_char,
    ),
>;
extern "C" {
    pub fn vaSetErrorCallback(
        dpy: VADisplay,
        callback: VAMessageCallback,
        user_context: *mut ::std::os::raw::c_void,
    ) -> VAMessageCallback;
}
extern "C" {
    pub fn vaSetInfoCallback(
        dpy: VADisplay,
        callback: VAMessageCallback,
        user_context: *mut ::std::os::raw::c_void,
    ) -> VAMessageCallback;
}
pub type VANativeDisplay = *mut ::std::os::raw::c_void;
extern "C" {
    pub fn vaDisplayIsValid(dpy: VADisplay) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn vaSetDriverName(dpy: VADisplay, driver_name: *mut ::std::os::raw::c_char) -> VAStatus;
}
extern "C" {
    pub fn vaInitialize(
        dpy: VADisplay,
        major_version: *mut ::std::os::raw::c_int,
        minor_version: *mut ::std::os::raw::c_int,
    ) -> VAStatus;
}
extern "C" {
    pub fn vaTerminate(dpy: VADisplay) -> VAStatus;
}
extern "C" {
    pub fn vaQueryVendorString(dpy: VADisplay) -> *const ::std::os::raw::c_char;
}
pub type VAPrivFunc = ::std::option::Option<unsafe extern "C" fn() -> ::std::os::raw::c_int>;
extern "C" {
    pub fn vaGetLibFunc(dpy: VADisplay, func: *const ::std::os::raw::c_char) -> VAPrivFunc;
}
pub const VAProfile_VAProfileNone: VAProfile = -1;
pub const VAProfile_VAProfileMPEG2Simple: VAProfile = 0;
pub const VAProfile_VAProfileMPEG2Main: VAProfile = 1;
pub const VAProfile_VAProfileMPEG4Simple: VAProfile = 2;
pub const VAProfile_VAProfileMPEG4AdvancedSimple: VAProfile = 3;
pub const VAProfile_VAProfileMPEG4Main: VAProfile = 4;
pub const VAProfile_VAProfileH264Baseline: VAProfile = 5;
pub const VAProfile_VAProfileH264Main: VAProfile = 6;
pub const VAProfile_VAProfileH264High: VAProfile = 7;
pub const VAProfile_VAProfileVC1Simple: VAProfile = 8;
pub const VAProfile_VAProfileVC1Main: VAProfile = 9;
pub const VAProfile_VAProfileVC1Advanced: VAProfile = 10;
pub const VAProfile_VAProfileH263Baseline: VAProfile = 11;
pub const VAProfile_VAProfileJPEGBaseline: VAProfile = 12;
pub const VAProfile_VAProfileH264ConstrainedBaseline: VAProfile = 13;
pub const VAProfile_VAProfileVP8Version0_3: VAProfile = 14;
pub const VAProfile_VAProfileH264MultiviewHigh: VAProfile = 15;
pub const VAProfile_VAProfileH264StereoHigh: VAProfile = 16;
pub const VAProfile_VAProfileHEVCMain: VAProfile = 17;
pub const VAProfile_VAProfileHEVCMain10: VAProfile = 18;
pub const VAProfile_VAProfileVP9Profile0: VAProfile = 19;
pub const VAProfile_VAProfileVP9Profile1: VAProfile = 20;
pub const VAProfile_VAProfileVP9Profile2: VAProfile = 21;
pub const VAProfile_VAProfileVP9Profile3: VAProfile = 22;
pub const VAProfile_VAProfileHEVCMain12: VAProfile = 23;
pub const VAProfile_VAProfileHEVCMain422_10: VAProfile = 24;
pub const VAProfile_VAProfileHEVCMain422_12: VAProfile = 25;
pub const VAProfile_VAProfileHEVCMain444: VAProfile = 26;
pub const VAProfile_VAProfileHEVCMain444_10: VAProfile = 27;
pub const VAProfile_VAProfileHEVCMain444_12: VAProfile = 28;
pub const VAProfile_VAProfileHEVCSccMain: VAProfile = 29;
pub const VAProfile_VAProfileHEVCSccMain10: VAProfile = 30;
pub const VAProfile_VAProfileHEVCSccMain444: VAProfile = 31;
pub const VAProfile_VAProfileAV1Profile0: VAProfile = 32;
pub const VAProfile_VAProfileAV1Profile1: VAProfile = 33;
pub const VAProfile_VAProfileHEVCSccMain444_10: VAProfile = 34;
pub const VAProfile_VAProfileProtected: VAProfile = 35;
pub type VAProfile = ::std::os::raw::c_int;
pub const VAEntrypoint_VAEntrypointVLD: VAEntrypoint = 1;
pub const VAEntrypoint_VAEntrypointIZZ: VAEntrypoint = 2;
pub const VAEntrypoint_VAEntrypointIDCT: VAEntrypoint = 3;
pub const VAEntrypoint_VAEntrypointMoComp: VAEntrypoint = 4;
pub const VAEntrypoint_VAEntrypointDeblocking: VAEntrypoint = 5;
pub const VAEntrypoint_VAEntrypointEncSlice: VAEntrypoint = 6;
pub const VAEntrypoint_VAEntrypointEncPicture: VAEntrypoint = 7;
pub const VAEntrypoint_VAEntrypointEncSliceLP: VAEntrypoint = 8;
pub const VAEntrypoint_VAEntrypointVideoProc: VAEntrypoint = 10;
pub const VAEntrypoint_VAEntrypointFEI: VAEntrypoint = 11;
pub const VAEntrypoint_VAEntrypointStats: VAEntrypoint = 12;
pub const VAEntrypoint_VAEntrypointProtectedTEEComm: VAEntrypoint = 13;
pub const VAEntrypoint_VAEntrypointProtectedContent: VAEntrypoint = 14;
pub type VAEntrypoint = ::std::os::raw::c_uint;
pub const VAConfigAttribType_VAConfigAttribRTFormat: VAConfigAttribType = 0;
pub const VAConfigAttribType_VAConfigAttribSpatialResidual: VAConfigAttribType = 1;
pub const VAConfigAttribType_VAConfigAttribSpatialClipping: VAConfigAttribType = 2;
pub const VAConfigAttribType_VAConfigAttribIntraResidual: VAConfigAttribType = 3;
pub const VAConfigAttribType_VAConfigAttribEncryption: VAConfigAttribType = 4;
pub const VAConfigAttribType_VAConfigAttribRateControl: VAConfigAttribType = 5;
pub const VAConfigAttribType_VAConfigAttribDecSliceMode: VAConfigAttribType = 6;
pub const VAConfigAttribType_VAConfigAttribDecJPEG: VAConfigAttribType = 7;
pub const VAConfigAttribType_VAConfigAttribDecProcessing: VAConfigAttribType = 8;
pub const VAConfigAttribType_VAConfigAttribEncPackedHeaders: VAConfigAttribType = 10;
pub const VAConfigAttribType_VAConfigAttribEncInterlaced: VAConfigAttribType = 11;
pub const VAConfigAttribType_VAConfigAttribEncMaxRefFrames: VAConfigAttribType = 13;
pub const VAConfigAttribType_VAConfigAttribEncMaxSlices: VAConfigAttribType = 14;
pub const VAConfigAttribType_VAConfigAttribEncSliceStructure: VAConfigAttribType = 15;
pub const VAConfigAttribType_VAConfigAttribEncMacroblockInfo: VAConfigAttribType = 16;
pub const VAConfigAttribType_VAConfigAttribMaxPictureWidth: VAConfigAttribType = 18;
pub const VAConfigAttribType_VAConfigAttribMaxPictureHeight: VAConfigAttribType = 19;
pub const VAConfigAttribType_VAConfigAttribEncJPEG: VAConfigAttribType = 20;
pub const VAConfigAttribType_VAConfigAttribEncQualityRange: VAConfigAttribType = 21;
pub const VAConfigAttribType_VAConfigAttribEncQuantization: VAConfigAttribType = 22;
pub const VAConfigAttribType_VAConfigAttribEncIntraRefresh: VAConfigAttribType = 23;
pub const VAConfigAttribType_VAConfigAttribEncSkipFrame: VAConfigAttribType = 24;
pub const VAConfigAttribType_VAConfigAttribEncROI: VAConfigAttribType = 25;
pub const VAConfigAttribType_VAConfigAttribEncRateControlExt: VAConfigAttribType = 26;
pub const VAConfigAttribType_VAConfigAttribProcessingRate: VAConfigAttribType = 27;
pub const VAConfigAttribType_VAConfigAttribEncDirtyRect: VAConfigAttribType = 28;
pub const VAConfigAttribType_VAConfigAttribEncParallelRateControl: VAConfigAttribType = 29;
pub const VAConfigAttribType_VAConfigAttribEncDynamicScaling: VAConfigAttribType = 30;
pub const VAConfigAttribType_VAConfigAttribFrameSizeToleranceSupport: VAConfigAttribType = 31;
pub const VAConfigAttribType_VAConfigAttribFEIFunctionType: VAConfigAttribType = 32;
pub const VAConfigAttribType_VAConfigAttribFEIMVPredictors: VAConfigAttribType = 33;
pub const VAConfigAttribType_VAConfigAttribStats: VAConfigAttribType = 34;
pub const VAConfigAttribType_VAConfigAttribEncTileSupport: VAConfigAttribType = 35;
pub const VAConfigAttribType_VAConfigAttribCustomRoundingControl: VAConfigAttribType = 36;
pub const VAConfigAttribType_VAConfigAttribQPBlockSize: VAConfigAttribType = 37;
pub const VAConfigAttribType_VAConfigAttribMaxFrameSize: VAConfigAttribType = 38;
pub const VAConfigAttribType_VAConfigAttribPredictionDirection: VAConfigAttribType = 39;
pub const VAConfigAttribType_VAConfigAttribMultipleFrame: VAConfigAttribType = 40;
pub const VAConfigAttribType_VAConfigAttribContextPriority: VAConfigAttribType = 41;
pub const VAConfigAttribType_VAConfigAttribDecAV1Features: VAConfigAttribType = 42;
pub const VAConfigAttribType_VAConfigAttribTEEType: VAConfigAttribType = 43;
pub const VAConfigAttribType_VAConfigAttribTEETypeClient: VAConfigAttribType = 44;
pub const VAConfigAttribType_VAConfigAttribProtectedContentCipherAlgorithm: VAConfigAttribType = 45;
pub const VAConfigAttribType_VAConfigAttribProtectedContentCipherBlockSize: VAConfigAttribType = 46;
pub const VAConfigAttribType_VAConfigAttribProtectedContentCipherMode: VAConfigAttribType = 47;
pub const VAConfigAttribType_VAConfigAttribProtectedContentCipherSampleType: VAConfigAttribType =
    48;
pub const VAConfigAttribType_VAConfigAttribProtectedContentUsage: VAConfigAttribType = 49;
pub const VAConfigAttribType_VAConfigAttribEncHEVCFeatures: VAConfigAttribType = 50;
pub const VAConfigAttribType_VAConfigAttribEncHEVCBlockSizes: VAConfigAttribType = 51;
pub const VAConfigAttribType_VAConfigAttribTypeMax: VAConfigAttribType = 52;
pub type VAConfigAttribType = ::std::os::raw::c_uint;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct _VAConfigAttrib {
    pub type_: VAConfigAttribType,
    pub value: u32,
}
#[test]
fn bindgen_test_layout__VAConfigAttrib() {
    assert_eq!(
        ::std::mem::size_of::<_VAConfigAttrib>(),
        8usize,
        concat!("Size of: ", stringify!(_VAConfigAttrib))
    );
    assert_eq!(
        ::std::mem::align_of::<_VAConfigAttrib>(),
        4usize,
        concat!("Alignment of ", stringify!(_VAConfigAttrib))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<_VAConfigAttrib>())).type_ as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(_VAConfigAttrib),
            "::",
            stringify!(type_)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<_VAConfigAttrib>())).value as *const _ as usize },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(_VAConfigAttrib),
            "::",
            stringify!(value)
        )
    );
}
pub type VAConfigAttrib = _VAConfigAttrib;
#[repr(C)]
#[derive(Copy, Clone)]
pub union _VAConfigAttribValDecJPEG {
    pub bits: _VAConfigAttribValDecJPEG__bindgen_ty_1,
    pub value: u32,
}
#[repr(C)]
#[repr(align(4))]
#[derive(Debug, Copy, Clone)]
pub struct _VAConfigAttribValDecJPEG__bindgen_ty_1 {
    pub _bitfield_align_1: [u32; 0],
    pub _bitfield_1: __BindgenBitfieldUnit<[u8; 4usize]>,
}
#[test]
fn bindgen_test_layout__VAConfigAttribValDecJPEG__bindgen_ty_1() {
    assert_eq!(
        ::std::mem::size_of::<_VAConfigAttribValDecJPEG__bindgen_ty_1>(),
        4usize,
        concat!(
            "Size of: ",
            stringify!(_VAConfigAttribValDecJPEG__bindgen_ty_1)
        )
    );
    assert_eq!(
        ::std::mem::align_of::<_VAConfigAttribValDecJPEG__bindgen_ty_1>(),
        4usize,
        concat!(
            "Alignment of ",
            stringify!(_VAConfigAttribValDecJPEG__bindgen_ty_1)
        )
    );
}
impl _VAConfigAttribValDecJPEG__bindgen_ty_1 {
    #[inline]
    pub fn rotation(&self) -> u32 {
        unsafe { ::std::mem::transmute(self._bitfield_1.get(0usize, 4u8) as u32) }
    }
    #[inline]
    pub fn set_rotation(&mut self, val: u32) {
        unsafe {
            let val: u32 = ::std::mem::transmute(val);
            self._bitfield_1.set(0usize, 4u8, val as u64)
        }
    }
    #[inline]
    pub fn reserved(&self) -> u32 {
        unsafe { ::std::mem::transmute(self._bitfield_1.get(4usize, 28u8) as u32) }
    }
    #[inline]
    pub fn set_reserved(&mut self, val: u32) {
        unsafe {
            let val: u32 = ::std::mem::transmute(val);
            self._bitfield_1.set(4usize, 28u8, val as u64)
        }
    }
    #[inline]
    pub fn new_bitfield_1(rotation: u32, reserved: u32) -> __BindgenBitfieldUnit<[u8; 4usize]> {
        let mut __bindgen_bitfield_unit: __BindgenBitfieldUnit<[u8; 4usize]> = Default::default();
        __bindgen_bitfield_unit.set(0usize, 4u8, {
            let rotation: u32 = unsafe { ::std::mem::transmute(rotation) };
            rotation as u64
        });
        __bindgen_bitfield_unit.set(4usize, 28u8, {
            let reserved: u32 = unsafe { ::std::mem::transmute(reserved) };
            reserved as u64
        });
        __bindgen_bitfield_unit
    }
}
#[test]
fn bindgen_test_layout__VAConfigAttribValDecJPEG() {
    assert_eq!(
        ::std::mem::size_of::<_VAConfigAttribValDecJPEG>(),
        4usize,
        concat!("Size of: ", stringify!(_VAConfigAttribValDecJPEG))
    );
    assert_eq!(
        ::std::mem::align_of::<_VAConfigAttribValDecJPEG>(),
        4usize,
        concat!("Alignment of ", stringify!(_VAConfigAttribValDecJPEG))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<_VAConfigAttribValDecJPEG>())).bits as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(_VAConfigAttribValDecJPEG),
            "::",
            stringify!(bits)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<_VAConfigAttribValDecJPEG>())).value as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(_VAConfigAttribValDecJPEG),
            "::",
            stringify!(value)
        )
    );
}
pub type VAConfigAttribValDecJPEG = _VAConfigAttribValDecJPEG;
#[repr(C)]
#[derive(Copy, Clone)]
pub union _VAConfigAttribValMaxFrameSize {
    pub bits: _VAConfigAttribValMaxFrameSize__bindgen_ty_1,
    pub value: u32,
}
#[repr(C)]
#[repr(align(4))]
#[derive(Debug, Copy, Clone)]
pub struct _VAConfigAttribValMaxFrameSize__bindgen_ty_1 {
    pub _bitfield_align_1: [u32; 0],
    pub _bitfield_1: __BindgenBitfieldUnit<[u8; 4usize]>,
}
#[test]
fn bindgen_test_layout__VAConfigAttribValMaxFrameSize__bindgen_ty_1() {
    assert_eq!(
        ::std::mem::size_of::<_VAConfigAttribValMaxFrameSize__bindgen_ty_1>(),
        4usize,
        concat!(
            "Size of: ",
            stringify!(_VAConfigAttribValMaxFrameSize__bindgen_ty_1)
        )
    );
    assert_eq!(
        ::std::mem::align_of::<_VAConfigAttribValMaxFrameSize__bindgen_ty_1>(),
        4usize,
        concat!(
            "Alignment of ",
            stringify!(_VAConfigAttribValMaxFrameSize__bindgen_ty_1)
        )
    );
}
impl _VAConfigAttribValMaxFrameSize__bindgen_ty_1 {
    #[inline]
    pub fn max_frame_size(&self) -> u32 {
        unsafe { ::std::mem::transmute(self._bitfield_1.get(0usize, 1u8) as u32) }
    }
    #[inline]
    pub fn set_max_frame_size(&mut self, val: u32) {
        unsafe {
            let val: u32 = ::std::mem::transmute(val);
            self._bitfield_1.set(0usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub fn multiple_pass(&self) -> u32 {
        unsafe { ::std::mem::transmute(self._bitfield_1.get(1usize, 1u8) as u32) }
    }
    #[inline]
    pub fn set_multiple_pass(&mut self, val: u32) {
        unsafe {
            let val: u32 = ::std::mem::transmute(val);
            self._bitfield_1.set(1usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub fn reserved(&self) -> u32 {
        unsafe { ::std::mem::transmute(self._bitfield_1.get(2usize, 30u8) as u32) }
    }
    #[inline]
    pub fn set_reserved(&mut self, val: u32) {
        unsafe {
            let val: u32 = ::std::mem::transmute(val);
            self._bitfield_1.set(2usize, 30u8, val as u64)
        }
    }
    #[inline]
    pub fn new_bitfield_1(
        max_frame_size: u32,
        multiple_pass: u32,
        reserved: u32,
    ) -> __BindgenBitfieldUnit<[u8; 4usize]> {
        let mut __bindgen_bitfield_unit: __BindgenBitfieldUnit<[u8; 4usize]> = Default::default();
        __bindgen_bitfield_unit.set(0usize, 1u8, {
            let max_frame_size: u32 = unsafe { ::std::mem::transmute(max_frame_size) };
            max_frame_size as u64
        });
        __bindgen_bitfield_unit.set(1usize, 1u8, {
            let multiple_pass: u32 = unsafe { ::std::mem::transmute(multiple_pass) };
            multiple_pass as u64
        });
        __bindgen_bitfield_unit.set(2usize, 30u8, {
            let reserved: u32 = unsafe { ::std::mem::transmute(reserved) };
            reserved as u64
        });
        __bindgen_bitfield_unit
    }
}
#[test]
fn bindgen_test_layout__VAConfigAttribValMaxFrameSize() {
    assert_eq!(
        ::std::mem::size_of::<_VAConfigAttribValMaxFrameSize>(),
        4usize,
        concat!("Size of: ", stringify!(_VAConfigAttribValMaxFrameSize))
    );
    assert_eq!(
        ::std::mem::align_of::<_VAConfigAttribValMaxFrameSize>(),
        4usize,
        concat!("Alignment of ", stringify!(_VAConfigAttribValMaxFrameSize))
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<_VAConfigAttribValMaxFrameSize>())).bits as *const _ as usize
        },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(_VAConfigAttribValMaxFrameSize),
            "::",
            stringify!(bits)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<_VAConfigAttribValMaxFrameSize>())).value as *const _ as usize
        },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(_VAConfigAttribValMaxFrameSize),
            "::",
            stringify!(value)
        )
    );
}
pub type VAConfigAttribValMaxFrameSize = _VAConfigAttribValMaxFrameSize;
#[repr(C)]
#[derive(Copy, Clone)]
pub union _VAConfigAttribValEncJPEG {
    pub bits: _VAConfigAttribValEncJPEG__bindgen_ty_1,
    pub value: u32,
}
#[repr(C)]
#[repr(align(4))]
#[derive(Debug, Copy, Clone)]
pub struct _VAConfigAttribValEncJPEG__bindgen_ty_1 {
    pub _bitfield_align_1: [u8; 0],
    pub _bitfield_1: __BindgenBitfieldUnit<[u8; 3usize]>,
    pub __bindgen_padding_0: u8,
}
#[test]
fn bindgen_test_layout__VAConfigAttribValEncJPEG__bindgen_ty_1() {
    assert_eq!(
        ::std::mem::size_of::<_VAConfigAttribValEncJPEG__bindgen_ty_1>(),
        4usize,
        concat!(
            "Size of: ",
            stringify!(_VAConfigAttribValEncJPEG__bindgen_ty_1)
        )
    );
    assert_eq!(
        ::std::mem::align_of::<_VAConfigAttribValEncJPEG__bindgen_ty_1>(),
        4usize,
        concat!(
            "Alignment of ",
            stringify!(_VAConfigAttribValEncJPEG__bindgen_ty_1)
        )
    );
}
impl _VAConfigAttribValEncJPEG__bindgen_ty_1 {
    #[inline]
    pub fn arithmatic_coding_mode(&self) -> u32 {
        unsafe { ::std::mem::transmute(self._bitfield_1.get(0usize, 1u8) as u32) }
    }
    #[inline]
    pub fn set_arithmatic_coding_mode(&mut self, val: u32) {
        unsafe {
            let val: u32 = ::std::mem::transmute(val);
            self._bitfield_1.set(0usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub fn progressive_dct_mode(&self) -> u32 {
        unsafe { ::std::mem::transmute(self._bitfield_1.get(1usize, 1u8) as u32) }
    }
    #[inline]
    pub fn set_progressive_dct_mode(&mut self, val: u32) {
        unsafe {
            let val: u32 = ::std::mem::transmute(val);
            self._bitfield_1.set(1usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub fn non_interleaved_mode(&self) -> u32 {
        unsafe { ::std::mem::transmute(self._bitfield_1.get(2usize, 1u8) as u32) }
    }
    #[inline]
    pub fn set_non_interleaved_mode(&mut self, val: u32) {
        unsafe {
            let val: u32 = ::std::mem::transmute(val);
            self._bitfield_1.set(2usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub fn differential_mode(&self) -> u32 {
        unsafe { ::std::mem::transmute(self._bitfield_1.get(3usize, 1u8) as u32) }
    }
    #[inline]
    pub fn set_differential_mode(&mut self, val: u32) {
        unsafe {
            let val: u32 = ::std::mem::transmute(val);
            self._bitfield_1.set(3usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub fn max_num_components(&self) -> u32 {
        unsafe { ::std::mem::transmute(self._bitfield_1.get(4usize, 3u8) as u32) }
    }
    #[inline]
    pub fn set_max_num_components(&mut self, val: u32) {
        unsafe {
            let val: u32 = ::std::mem::transmute(val);
            self._bitfield_1.set(4usize, 3u8, val as u64)
        }
    }
    #[inline]
    pub fn max_num_scans(&self) -> u32 {
        unsafe { ::std::mem::transmute(self._bitfield_1.get(7usize, 4u8) as u32) }
    }
    #[inline]
    pub fn set_max_num_scans(&mut self, val: u32) {
        unsafe {
            let val: u32 = ::std::mem::transmute(val);
            self._bitfield_1.set(7usize, 4u8, val as u64)
        }
    }
    #[inline]
    pub fn max_num_huffman_tables(&self) -> u32 {
        unsafe { ::std::mem::transmute(self._bitfield_1.get(11usize, 3u8) as u32) }
    }
    #[inline]
    pub fn set_max_num_huffman_tables(&mut self, val: u32) {
        unsafe {
            let val: u32 = ::std::mem::transmute(val);
            self._bitfield_1.set(11usize, 3u8, val as u64)
        }
    }
    #[inline]
    pub fn max_num_quantization_tables(&self) -> u32 {
        unsafe { ::std::mem::transmute(self._bitfield_1.get(14usize, 3u8) as u32) }
    }
    #[inline]
    pub fn set_max_num_quantization_tables(&mut self, val: u32) {
        unsafe {
            let val: u32 = ::std::mem::transmute(val);
            self._bitfield_1.set(14usize, 3u8, val as u64)
        }
    }
    #[inline]
    pub fn new_bitfield_1(
        arithmatic_coding_mode: u32,
        progressive_dct_mode: u32,
        non_interleaved_mode: u32,
        differential_mode: u32,
        max_num_components: u32,
        max_num_scans: u32,
        max_num_huffman_tables: u32,
        max_num_quantization_tables: u32,
    ) -> __BindgenBitfieldUnit<[u8; 3usize]> {
        let mut __bindgen_bitfield_unit: __BindgenBitfieldUnit<[u8; 3usize]> = Default::default();
        __bindgen_bitfield_unit.set(0usize, 1u8, {
            let arithmatic_coding_mode: u32 =
                unsafe { ::std::mem::transmute(arithmatic_coding_mode) };
            arithmatic_coding_mode as u64
        });
        __bindgen_bitfield_unit.set(1usize, 1u8, {
            let progressive_dct_mode: u32 = unsafe { ::std::mem::transmute(progressive_dct_mode) };
            progressive_dct_mode as u64
        });
        __bindgen_bitfield_unit.set(2usize, 1u8, {
            let non_interleaved_mode: u32 = unsafe { ::std::mem::transmute(non_interleaved_mode) };
            non_interleaved_mode as u64
        });
        __bindgen_bitfield_unit.set(3usize, 1u8, {
            let differential_mode: u32 = unsafe { ::std::mem::transmute(differential_mode) };
            differential_mode as u64
        });
        __bindgen_bitfield_unit.set(4usize, 3u8, {
            let max_num_components: u32 = unsafe { ::std::mem::transmute(max_num_components) };
            max_num_components as u64
        });
        __bindgen_bitfield_unit.set(7usize, 4u8, {
            let max_num_scans: u32 = unsafe { ::std::mem::transmute(max_num_scans) };
            max_num_scans as u64
        });
        __bindgen_bitfield_unit.set(11usize, 3u8, {
            let max_num_huffman_tables: u32 =
                unsafe { ::std::mem::transmute(max_num_huffman_tables) };
            max_num_huffman_tables as u64
        });
        __bindgen_bitfield_unit.set(14usize, 3u8, {
            let max_num_quantization_tables: u32 =
                unsafe { ::std::mem::transmute(max_num_quantization_tables) };
            max_num_quantization_tables as u64
        });
        __bindgen_bitfield_unit
    }
}
#[test]
fn bindgen_test_layout__VAConfigAttribValEncJPEG() {
    assert_eq!(
        ::std::mem::size_of::<_VAConfigAttribValEncJPEG>(),
        4usize,
        concat!("Size of: ", stringify!(_VAConfigAttribValEncJPEG))
    );
    assert_eq!(
        ::std::mem::align_of::<_VAConfigAttribValEncJPEG>(),
        4usize,
        concat!("Alignment of ", stringify!(_VAConfigAttribValEncJPEG))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<_VAConfigAttribValEncJPEG>())).bits as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(_VAConfigAttribValEncJPEG),
            "::",
            stringify!(bits)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<_VAConfigAttribValEncJPEG>())).value as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(_VAConfigAttribValEncJPEG),
            "::",
            stringify!(value)
        )
    );
}
pub type VAConfigAttribValEncJPEG = _VAConfigAttribValEncJPEG;
#[repr(C)]
#[derive(Copy, Clone)]
pub union _VAConfigAttribValEncROI {
    pub bits: _VAConfigAttribValEncROI__bindgen_ty_1,
    pub value: u32,
}
#[repr(C)]
#[repr(align(4))]
#[derive(Debug, Copy, Clone)]
pub struct _VAConfigAttribValEncROI__bindgen_ty_1 {
    pub _bitfield_align_1: [u32; 0],
    pub _bitfield_1: __BindgenBitfieldUnit<[u8; 4usize]>,
}
#[test]
fn bindgen_test_layout__VAConfigAttribValEncROI__bindgen_ty_1() {
    assert_eq!(
        ::std::mem::size_of::<_VAConfigAttribValEncROI__bindgen_ty_1>(),
        4usize,
        concat!(
            "Size of: ",
            stringify!(_VAConfigAttribValEncROI__bindgen_ty_1)
        )
    );
    assert_eq!(
        ::std::mem::align_of::<_VAConfigAttribValEncROI__bindgen_ty_1>(),
        4usize,
        concat!(
            "Alignment of ",
            stringify!(_VAConfigAttribValEncROI__bindgen_ty_1)
        )
    );
}
impl _VAConfigAttribValEncROI__bindgen_ty_1 {
    #[inline]
    pub fn num_roi_regions(&self) -> u32 {
        unsafe { ::std::mem::transmute(self._bitfield_1.get(0usize, 8u8) as u32) }
    }
    #[inline]
    pub fn set_num_roi_regions(&mut self, val: u32) {
        unsafe {
            let val: u32 = ::std::mem::transmute(val);
            self._bitfield_1.set(0usize, 8u8, val as u64)
        }
    }
    #[inline]
    pub fn roi_rc_priority_support(&self) -> u32 {
        unsafe { ::std::mem::transmute(self._bitfield_1.get(8usize, 1u8) as u32) }
    }
    #[inline]
    pub fn set_roi_rc_priority_support(&mut self, val: u32) {
        unsafe {
            let val: u32 = ::std::mem::transmute(val);
            self._bitfield_1.set(8usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub fn roi_rc_qp_delta_support(&self) -> u32 {
        unsafe { ::std::mem::transmute(self._bitfield_1.get(9usize, 1u8) as u32) }
    }
    #[inline]
    pub fn set_roi_rc_qp_delta_support(&mut self, val: u32) {
        unsafe {
            let val: u32 = ::std::mem::transmute(val);
            self._bitfield_1.set(9usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub fn reserved(&self) -> u32 {
        unsafe { ::std::mem::transmute(self._bitfield_1.get(10usize, 22u8) as u32) }
    }
    #[inline]
    pub fn set_reserved(&mut self, val: u32) {
        unsafe {
            let val: u32 = ::std::mem::transmute(val);
            self._bitfield_1.set(10usize, 22u8, val as u64)
        }
    }
    #[inline]
    pub fn new_bitfield_1(
        num_roi_regions: u32,
        roi_rc_priority_support: u32,
        roi_rc_qp_delta_support: u32,
        reserved: u32,
    ) -> __BindgenBitfieldUnit<[u8; 4usize]> {
        let mut __bindgen_bitfield_unit: __BindgenBitfieldUnit<[u8; 4usize]> = Default::default();
        __bindgen_bitfield_unit.set(0usize, 8u8, {
            let num_roi_regions: u32 = unsafe { ::std::mem::transmute(num_roi_regions) };
            num_roi_regions as u64
        });
        __bindgen_bitfield_unit.set(8usize, 1u8, {
            let roi_rc_priority_support: u32 =
                unsafe { ::std::mem::transmute(roi_rc_priority_support) };
            roi_rc_priority_support as u64
        });
        __bindgen_bitfield_unit.set(9usize, 1u8, {
            let roi_rc_qp_delta_support: u32 =
                unsafe { ::std::mem::transmute(roi_rc_qp_delta_support) };
            roi_rc_qp_delta_support as u64
        });
        __bindgen_bitfield_unit.set(10usize, 22u8, {
            let reserved: u32 = unsafe { ::std::mem::transmute(reserved) };
            reserved as u64
        });
        __bindgen_bitfield_unit
    }
}
#[test]
fn bindgen_test_layout__VAConfigAttribValEncROI() {
    assert_eq!(
        ::std::mem::size_of::<_VAConfigAttribValEncROI>(),
        4usize,
        concat!("Size of: ", stringify!(_VAConfigAttribValEncROI))
    );
    assert_eq!(
        ::std::mem::align_of::<_VAConfigAttribValEncROI>(),
        4usize,
        concat!("Alignment of ", stringify!(_VAConfigAttribValEncROI))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<_VAConfigAttribValEncROI>())).bits as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(_VAConfigAttribValEncROI),
            "::",
            stringify!(bits)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<_VAConfigAttribValEncROI>())).value as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(_VAConfigAttribValEncROI),
            "::",
            stringify!(value)
        )
    );
}
pub type VAConfigAttribValEncROI = _VAConfigAttribValEncROI;
#[repr(C)]
#[derive(Copy, Clone)]
pub union _VAConfigAttribValEncRateControlExt {
    pub bits: _VAConfigAttribValEncRateControlExt__bindgen_ty_1,
    pub value: u32,
}
#[repr(C)]
#[repr(align(4))]
#[derive(Debug, Copy, Clone)]
pub struct _VAConfigAttribValEncRateControlExt__bindgen_ty_1 {
    pub _bitfield_align_1: [u32; 0],
    pub _bitfield_1: __BindgenBitfieldUnit<[u8; 4usize]>,
}
#[test]
fn bindgen_test_layout__VAConfigAttribValEncRateControlExt__bindgen_ty_1() {
    assert_eq!(
        ::std::mem::size_of::<_VAConfigAttribValEncRateControlExt__bindgen_ty_1>(),
        4usize,
        concat!(
            "Size of: ",
            stringify!(_VAConfigAttribValEncRateControlExt__bindgen_ty_1)
        )
    );
    assert_eq!(
        ::std::mem::align_of::<_VAConfigAttribValEncRateControlExt__bindgen_ty_1>(),
        4usize,
        concat!(
            "Alignment of ",
            stringify!(_VAConfigAttribValEncRateControlExt__bindgen_ty_1)
        )
    );
}
impl _VAConfigAttribValEncRateControlExt__bindgen_ty_1 {
    #[inline]
    pub fn max_num_temporal_layers_minus1(&self) -> u32 {
        unsafe { ::std::mem::transmute(self._bitfield_1.get(0usize, 8u8) as u32) }
    }
    #[inline]
    pub fn set_max_num_temporal_layers_minus1(&mut self, val: u32) {
        unsafe {
            let val: u32 = ::std::mem::transmute(val);
            self._bitfield_1.set(0usize, 8u8, val as u64)
        }
    }
    #[inline]
    pub fn temporal_layer_bitrate_control_flag(&self) -> u32 {
        unsafe { ::std::mem::transmute(self._bitfield_1.get(8usize, 1u8) as u32) }
    }
    #[inline]
    pub fn set_temporal_layer_bitrate_control_flag(&mut self, val: u32) {
        unsafe {
            let val: u32 = ::std::mem::transmute(val);
            self._bitfield_1.set(8usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub fn reserved(&self) -> u32 {
        unsafe { ::std::mem::transmute(self._bitfield_1.get(9usize, 23u8) as u32) }
    }
    #[inline]
    pub fn set_reserved(&mut self, val: u32) {
        unsafe {
            let val: u32 = ::std::mem::transmute(val);
            self._bitfield_1.set(9usize, 23u8, val as u64)
        }
    }
    #[inline]
    pub fn new_bitfield_1(
        max_num_temporal_layers_minus1: u32,
        temporal_layer_bitrate_control_flag: u32,
        reserved: u32,
    ) -> __BindgenBitfieldUnit<[u8; 4usize]> {
        let mut __bindgen_bitfield_unit: __BindgenBitfieldUnit<[u8; 4usize]> = Default::default();
        __bindgen_bitfield_unit.set(0usize, 8u8, {
            let max_num_temporal_layers_minus1: u32 =
                unsafe { ::std::mem::transmute(max_num_temporal_layers_minus1) };
            max_num_temporal_layers_minus1 as u64
        });
        __bindgen_bitfield_unit.set(8usize, 1u8, {
            let temporal_layer_bitrate_control_flag: u32 =
                unsafe { ::std::mem::transmute(temporal_layer_bitrate_control_flag) };
            temporal_layer_bitrate_control_flag as u64
        });
        __bindgen_bitfield_unit.set(9usize, 23u8, {
            let reserved: u32 = unsafe { ::std::mem::transmute(reserved) };
            reserved as u64
        });
        __bindgen_bitfield_unit
    }
}
#[test]
fn bindgen_test_layout__VAConfigAttribValEncRateControlExt() {
    assert_eq!(
        ::std::mem::size_of::<_VAConfigAttribValEncRateControlExt>(),
        4usize,
        concat!("Size of: ", stringify!(_VAConfigAttribValEncRateControlExt))
    );
    assert_eq!(
        ::std::mem::align_of::<_VAConfigAttribValEncRateControlExt>(),
        4usize,
        concat!(
            "Alignment of ",
            stringify!(_VAConfigAttribValEncRateControlExt)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<_VAConfigAttribValEncRateControlExt>())).bits as *const _
                as usize
        },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(_VAConfigAttribValEncRateControlExt),
            "::",
            stringify!(bits)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<_VAConfigAttribValEncRateControlExt>())).value as *const _
                as usize
        },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(_VAConfigAttribValEncRateControlExt),
            "::",
            stringify!(value)
        )
    );
}
pub type VAConfigAttribValEncRateControlExt = _VAConfigAttribValEncRateControlExt;
#[repr(C)]
#[derive(Copy, Clone)]
pub union _VAConfigAttribValMultipleFrame {
    pub bits: _VAConfigAttribValMultipleFrame__bindgen_ty_1,
    pub value: u32,
}
#[repr(C)]
#[repr(align(4))]
#[derive(Debug, Copy, Clone)]
pub struct _VAConfigAttribValMultipleFrame__bindgen_ty_1 {
    pub _bitfield_align_1: [u32; 0],
    pub _bitfield_1: __BindgenBitfieldUnit<[u8; 4usize]>,
}
#[test]
fn bindgen_test_layout__VAConfigAttribValMultipleFrame__bindgen_ty_1() {
    assert_eq!(
        ::std::mem::size_of::<_VAConfigAttribValMultipleFrame__bindgen_ty_1>(),
        4usize,
        concat!(
            "Size of: ",
            stringify!(_VAConfigAttribValMultipleFrame__bindgen_ty_1)
        )
    );
    assert_eq!(
        ::std::mem::align_of::<_VAConfigAttribValMultipleFrame__bindgen_ty_1>(),
        4usize,
        concat!(
            "Alignment of ",
            stringify!(_VAConfigAttribValMultipleFrame__bindgen_ty_1)
        )
    );
}
impl _VAConfigAttribValMultipleFrame__bindgen_ty_1 {
    #[inline]
    pub fn max_num_concurrent_frames(&self) -> u32 {
        unsafe { ::std::mem::transmute(self._bitfield_1.get(0usize, 8u8) as u32) }
    }
    #[inline]
    pub fn set_max_num_concurrent_frames(&mut self, val: u32) {
        unsafe {
            let val: u32 = ::std::mem::transmute(val);
            self._bitfield_1.set(0usize, 8u8, val as u64)
        }
    }
    #[inline]
    pub fn mixed_quality_level(&self) -> u32 {
        unsafe { ::std::mem::transmute(self._bitfield_1.get(8usize, 1u8) as u32) }
    }
    #[inline]
    pub fn set_mixed_quality_level(&mut self, val: u32) {
        unsafe {
            let val: u32 = ::std::mem::transmute(val);
            self._bitfield_1.set(8usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub fn reserved(&self) -> u32 {
        unsafe { ::std::mem::transmute(self._bitfield_1.get(9usize, 23u8) as u32) }
    }
    #[inline]
    pub fn set_reserved(&mut self, val: u32) {
        unsafe {
            let val: u32 = ::std::mem::transmute(val);
            self._bitfield_1.set(9usize, 23u8, val as u64)
        }
    }
    #[inline]
    pub fn new_bitfield_1(
        max_num_concurrent_frames: u32,
        mixed_quality_level: u32,
        reserved: u32,
    ) -> __BindgenBitfieldUnit<[u8; 4usize]> {
        let mut __bindgen_bitfield_unit: __BindgenBitfieldUnit<[u8; 4usize]> = Default::default();
        __bindgen_bitfield_unit.set(0usize, 8u8, {
            let max_num_concurrent_frames: u32 =
                unsafe { ::std::mem::transmute(max_num_concurrent_frames) };
            max_num_concurrent_frames as u64
        });
        __bindgen_bitfield_unit.set(8usize, 1u8, {
            let mixed_quality_level: u32 = unsafe { ::std::mem::transmute(mixed_quality_level) };
            mixed_quality_level as u64
        });
        __bindgen_bitfield_unit.set(9usize, 23u8, {
            let reserved: u32 = unsafe { ::std::mem::transmute(reserved) };
            reserved as u64
        });
        __bindgen_bitfield_unit
    }
}
#[test]
fn bindgen_test_layout__VAConfigAttribValMultipleFrame() {
    assert_eq!(
        ::std::mem::size_of::<_VAConfigAttribValMultipleFrame>(),
        4usize,
        concat!("Size of: ", stringify!(_VAConfigAttribValMultipleFrame))
    );
    assert_eq!(
        ::std::mem::align_of::<_VAConfigAttribValMultipleFrame>(),
        4usize,
        concat!("Alignment of ", stringify!(_VAConfigAttribValMultipleFrame))
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<_VAConfigAttribValMultipleFrame>())).bits as *const _ as usize
        },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(_VAConfigAttribValMultipleFrame),
            "::",
            stringify!(bits)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<_VAConfigAttribValMultipleFrame>())).value as *const _ as usize
        },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(_VAConfigAttribValMultipleFrame),
            "::",
            stringify!(value)
        )
    );
}
pub type VAConfigAttribValMultipleFrame = _VAConfigAttribValMultipleFrame;
#[repr(C)]
#[derive(Copy, Clone)]
pub union _VAConfigAttribValContextPriority {
    pub bits: _VAConfigAttribValContextPriority__bindgen_ty_1,
    pub value: u32,
}
#[repr(C)]
#[repr(align(4))]
#[derive(Debug, Copy, Clone)]
pub struct _VAConfigAttribValContextPriority__bindgen_ty_1 {
    pub _bitfield_align_1: [u16; 0],
    pub _bitfield_1: __BindgenBitfieldUnit<[u8; 4usize]>,
}
#[test]
fn bindgen_test_layout__VAConfigAttribValContextPriority__bindgen_ty_1() {
    assert_eq!(
        ::std::mem::size_of::<_VAConfigAttribValContextPriority__bindgen_ty_1>(),
        4usize,
        concat!(
            "Size of: ",
            stringify!(_VAConfigAttribValContextPriority__bindgen_ty_1)
        )
    );
    assert_eq!(
        ::std::mem::align_of::<_VAConfigAttribValContextPriority__bindgen_ty_1>(),
        4usize,
        concat!(
            "Alignment of ",
            stringify!(_VAConfigAttribValContextPriority__bindgen_ty_1)
        )
    );
}
impl _VAConfigAttribValContextPriority__bindgen_ty_1 {
    #[inline]
    pub fn priority(&self) -> u32 {
        unsafe { ::std::mem::transmute(self._bitfield_1.get(0usize, 16u8) as u32) }
    }
    #[inline]
    pub fn set_priority(&mut self, val: u32) {
        unsafe {
            let val: u32 = ::std::mem::transmute(val);
            self._bitfield_1.set(0usize, 16u8, val as u64)
        }
    }
    #[inline]
    pub fn reserved(&self) -> u32 {
        unsafe { ::std::mem::transmute(self._bitfield_1.get(16usize, 16u8) as u32) }
    }
    #[inline]
    pub fn set_reserved(&mut self, val: u32) {
        unsafe {
            let val: u32 = ::std::mem::transmute(val);
            self._bitfield_1.set(16usize, 16u8, val as u64)
        }
    }
    #[inline]
    pub fn new_bitfield_1(priority: u32, reserved: u32) -> __BindgenBitfieldUnit<[u8; 4usize]> {
        let mut __bindgen_bitfield_unit: __BindgenBitfieldUnit<[u8; 4usize]> = Default::default();
        __bindgen_bitfield_unit.set(0usize, 16u8, {
            let priority: u32 = unsafe { ::std::mem::transmute(priority) };
            priority as u64
        });
        __bindgen_bitfield_unit.set(16usize, 16u8, {
            let reserved: u32 = unsafe { ::std::mem::transmute(reserved) };
            reserved as u64
        });
        __bindgen_bitfield_unit
    }
}
#[test]
fn bindgen_test_layout__VAConfigAttribValContextPriority() {
    assert_eq!(
        ::std::mem::size_of::<_VAConfigAttribValContextPriority>(),
        4usize,
        concat!("Size of: ", stringify!(_VAConfigAttribValContextPriority))
    );
    assert_eq!(
        ::std::mem::align_of::<_VAConfigAttribValContextPriority>(),
        4usize,
        concat!(
            "Alignment of ",
            stringify!(_VAConfigAttribValContextPriority)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<_VAConfigAttribValContextPriority>())).bits as *const _ as usize
        },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(_VAConfigAttribValContextPriority),
            "::",
            stringify!(bits)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<_VAConfigAttribValContextPriority>())).value as *const _ as usize
        },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(_VAConfigAttribValContextPriority),
            "::",
            stringify!(value)
        )
    );
}
pub type VAConfigAttribValContextPriority = _VAConfigAttribValContextPriority;
extern "C" {
    pub fn vaMaxNumProfiles(dpy: VADisplay) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn vaMaxNumEntrypoints(dpy: VADisplay) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn vaMaxNumConfigAttributes(dpy: VADisplay) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn vaQueryConfigProfiles(
        dpy: VADisplay,
        profile_list: *mut VAProfile,
        num_profiles: *mut ::std::os::raw::c_int,
    ) -> VAStatus;
}
extern "C" {
    pub fn vaQueryConfigEntrypoints(
        dpy: VADisplay,
        profile: VAProfile,
        entrypoint_list: *mut VAEntrypoint,
        num_entrypoints: *mut ::std::os::raw::c_int,
    ) -> VAStatus;
}
extern "C" {
    pub fn vaGetConfigAttributes(
        dpy: VADisplay,
        profile: VAProfile,
        entrypoint: VAEntrypoint,
        attrib_list: *mut VAConfigAttrib,
        num_attribs: ::std::os::raw::c_int,
    ) -> VAStatus;
}
pub type VAGenericID = ::std::os::raw::c_uint;
pub type VAConfigID = VAGenericID;
extern "C" {
    pub fn vaCreateConfig(
        dpy: VADisplay,
        profile: VAProfile,
        entrypoint: VAEntrypoint,
        attrib_list: *mut VAConfigAttrib,
        num_attribs: ::std::os::raw::c_int,
        config_id: *mut VAConfigID,
    ) -> VAStatus;
}
extern "C" {
    pub fn vaDestroyConfig(dpy: VADisplay, config_id: VAConfigID) -> VAStatus;
}
extern "C" {
    pub fn vaQueryConfigAttributes(
        dpy: VADisplay,
        config_id: VAConfigID,
        profile: *mut VAProfile,
        entrypoint: *mut VAEntrypoint,
        attrib_list: *mut VAConfigAttrib,
        num_attribs: *mut ::std::os::raw::c_int,
    ) -> VAStatus;
}
pub type VAContextID = VAGenericID;
pub type VASurfaceID = VAGenericID;
pub const VAGenericValueType_VAGenericValueTypeInteger: VAGenericValueType = 1;
pub const VAGenericValueType_VAGenericValueTypeFloat: VAGenericValueType = 2;
pub const VAGenericValueType_VAGenericValueTypePointer: VAGenericValueType = 3;
pub const VAGenericValueType_VAGenericValueTypeFunc: VAGenericValueType = 4;
pub type VAGenericValueType = ::std::os::raw::c_uint;
pub type VAGenericFunc = ::std::option::Option<unsafe extern "C" fn()>;
#[repr(C)]
#[derive(Copy, Clone)]
pub struct _VAGenericValue {
    pub type_: VAGenericValueType,
    pub value: _VAGenericValue__bindgen_ty_1,
}
#[repr(C)]
#[derive(Copy, Clone)]
pub union _VAGenericValue__bindgen_ty_1 {
    pub i: i32,
    pub f: f32,
    pub p: *mut ::std::os::raw::c_void,
    pub fn_: VAGenericFunc,
}
#[test]
fn bindgen_test_layout__VAGenericValue__bindgen_ty_1() {
    assert_eq!(
        ::std::mem::size_of::<_VAGenericValue__bindgen_ty_1>(),
        8usize,
        concat!("Size of: ", stringify!(_VAGenericValue__bindgen_ty_1))
    );
    assert_eq!(
        ::std::mem::align_of::<_VAGenericValue__bindgen_ty_1>(),
        8usize,
        concat!("Alignment of ", stringify!(_VAGenericValue__bindgen_ty_1))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<_VAGenericValue__bindgen_ty_1>())).i as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(_VAGenericValue__bindgen_ty_1),
            "::",
            stringify!(i)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<_VAGenericValue__bindgen_ty_1>())).f as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(_VAGenericValue__bindgen_ty_1),
            "::",
            stringify!(f)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<_VAGenericValue__bindgen_ty_1>())).p as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(_VAGenericValue__bindgen_ty_1),
            "::",
            stringify!(p)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<_VAGenericValue__bindgen_ty_1>())).fn_ as *const _ as usize
        },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(_VAGenericValue__bindgen_ty_1),
            "::",
            stringify!(fn_)
        )
    );
}
#[test]
fn bindgen_test_layout__VAGenericValue() {
    assert_eq!(
        ::std::mem::size_of::<_VAGenericValue>(),
        16usize,
        concat!("Size of: ", stringify!(_VAGenericValue))
    );
    assert_eq!(
        ::std::mem::align_of::<_VAGenericValue>(),
        8usize,
        concat!("Alignment of ", stringify!(_VAGenericValue))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<_VAGenericValue>())).type_ as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(_VAGenericValue),
            "::",
            stringify!(type_)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<_VAGenericValue>())).value as *const _ as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(_VAGenericValue),
            "::",
            stringify!(value)
        )
    );
}
pub type VAGenericValue = _VAGenericValue;
pub const VASurfaceAttribType_VASurfaceAttribNone: VASurfaceAttribType = 0;
pub const VASurfaceAttribType_VASurfaceAttribPixelFormat: VASurfaceAttribType = 1;
pub const VASurfaceAttribType_VASurfaceAttribMinWidth: VASurfaceAttribType = 2;
pub const VASurfaceAttribType_VASurfaceAttribMaxWidth: VASurfaceAttribType = 3;
pub const VASurfaceAttribType_VASurfaceAttribMinHeight: VASurfaceAttribType = 4;
pub const VASurfaceAttribType_VASurfaceAttribMaxHeight: VASurfaceAttribType = 5;
pub const VASurfaceAttribType_VASurfaceAttribMemoryType: VASurfaceAttribType = 6;
pub const VASurfaceAttribType_VASurfaceAttribExternalBufferDescriptor: VASurfaceAttribType = 7;
pub const VASurfaceAttribType_VASurfaceAttribUsageHint: VASurfaceAttribType = 8;
pub const VASurfaceAttribType_VASurfaceAttribDRMFormatModifiers: VASurfaceAttribType = 9;
pub const VASurfaceAttribType_VASurfaceAttribCount: VASurfaceAttribType = 10;
pub type VASurfaceAttribType = ::std::os::raw::c_uint;
#[repr(C)]
#[derive(Copy, Clone)]
pub struct _VASurfaceAttrib {
    pub type_: VASurfaceAttribType,
    pub flags: u32,
    pub value: VAGenericValue,
}
#[test]
fn bindgen_test_layout__VASurfaceAttrib() {
    assert_eq!(
        ::std::mem::size_of::<_VASurfaceAttrib>(),
        24usize,
        concat!("Size of: ", stringify!(_VASurfaceAttrib))
    );
    assert_eq!(
        ::std::mem::align_of::<_VASurfaceAttrib>(),
        8usize,
        concat!("Alignment of ", stringify!(_VASurfaceAttrib))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<_VASurfaceAttrib>())).type_ as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(_VASurfaceAttrib),
            "::",
            stringify!(type_)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<_VASurfaceAttrib>())).flags as *const _ as usize },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(_VASurfaceAttrib),
            "::",
            stringify!(flags)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<_VASurfaceAttrib>())).value as *const _ as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(_VASurfaceAttrib),
            "::",
            stringify!(value)
        )
    );
}
pub type VASurfaceAttrib = _VASurfaceAttrib;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct _VASurfaceAttribExternalBuffers {
    pub pixel_format: u32,
    pub width: u32,
    pub height: u32,
    pub data_size: u32,
    pub num_planes: u32,
    pub pitches: [u32; 4usize],
    pub offsets: [u32; 4usize],
    pub buffers: *mut usize,
    pub num_buffers: u32,
    pub flags: u32,
    pub private_data: *mut ::std::os::raw::c_void,
}
#[test]
fn bindgen_test_layout__VASurfaceAttribExternalBuffers() {
    assert_eq!(
        ::std::mem::size_of::<_VASurfaceAttribExternalBuffers>(),
        80usize,
        concat!("Size of: ", stringify!(_VASurfaceAttribExternalBuffers))
    );
    assert_eq!(
        ::std::mem::align_of::<_VASurfaceAttribExternalBuffers>(),
        8usize,
        concat!("Alignment of ", stringify!(_VASurfaceAttribExternalBuffers))
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<_VASurfaceAttribExternalBuffers>())).pixel_format as *const _
                as usize
        },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(_VASurfaceAttribExternalBuffers),
            "::",
            stringify!(pixel_format)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<_VASurfaceAttribExternalBuffers>())).width as *const _ as usize
        },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(_VASurfaceAttribExternalBuffers),
            "::",
            stringify!(width)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<_VASurfaceAttribExternalBuffers>())).height as *const _ as usize
        },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(_VASurfaceAttribExternalBuffers),
            "::",
            stringify!(height)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<_VASurfaceAttribExternalBuffers>())).data_size as *const _
                as usize
        },
        12usize,
        concat!(
            "Offset of field: ",
            stringify!(_VASurfaceAttribExternalBuffers),
            "::",
            stringify!(data_size)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<_VASurfaceAttribExternalBuffers>())).num_planes as *const _
                as usize
        },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(_VASurfaceAttribExternalBuffers),
            "::",
            stringify!(num_planes)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<_VASurfaceAttribExternalBuffers>())).pitches as *const _ as usize
        },
        20usize,
        concat!(
            "Offset of field: ",
            stringify!(_VASurfaceAttribExternalBuffers),
            "::",
            stringify!(pitches)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<_VASurfaceAttribExternalBuffers>())).offsets as *const _ as usize
        },
        36usize,
        concat!(
            "Offset of field: ",
            stringify!(_VASurfaceAttribExternalBuffers),
            "::",
            stringify!(offsets)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<_VASurfaceAttribExternalBuffers>())).buffers as *const _ as usize
        },
        56usize,
        concat!(
            "Offset of field: ",
            stringify!(_VASurfaceAttribExternalBuffers),
            "::",
            stringify!(buffers)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<_VASurfaceAttribExternalBuffers>())).num_buffers as *const _
                as usize
        },
        64usize,
        concat!(
            "Offset of field: ",
            stringify!(_VASurfaceAttribExternalBuffers),
            "::",
            stringify!(num_buffers)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<_VASurfaceAttribExternalBuffers>())).flags as *const _ as usize
        },
        68usize,
        concat!(
            "Offset of field: ",
            stringify!(_VASurfaceAttribExternalBuffers),
            "::",
            stringify!(flags)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<_VASurfaceAttribExternalBuffers>())).private_data as *const _
                as usize
        },
        72usize,
        concat!(
            "Offset of field: ",
            stringify!(_VASurfaceAttribExternalBuffers),
            "::",
            stringify!(private_data)
        )
    );
}
pub type VASurfaceAttribExternalBuffers = _VASurfaceAttribExternalBuffers;
extern "C" {
    pub fn vaQuerySurfaceAttributes(
        dpy: VADisplay,
        config: VAConfigID,
        attrib_list: *mut VASurfaceAttrib,
        num_attribs: *mut ::std::os::raw::c_uint,
    ) -> VAStatus;
}
extern "C" {
    pub fn vaCreateSurfaces(
        dpy: VADisplay,
        format: ::std::os::raw::c_uint,
        width: ::std::os::raw::c_uint,
        height: ::std::os::raw::c_uint,
        surfaces: *mut VASurfaceID,
        num_surfaces: ::std::os::raw::c_uint,
        attrib_list: *mut VASurfaceAttrib,
        num_attribs: ::std::os::raw::c_uint,
    ) -> VAStatus;
}
extern "C" {
    pub fn vaDestroySurfaces(
        dpy: VADisplay,
        surfaces: *mut VASurfaceID,
        num_surfaces: ::std::os::raw::c_int,
    ) -> VAStatus;
}
extern "C" {
    pub fn vaCreateContext(
        dpy: VADisplay,
        config_id: VAConfigID,
        picture_width: ::std::os::raw::c_int,
        picture_height: ::std::os::raw::c_int,
        flag: ::std::os::raw::c_int,
        render_targets: *mut VASurfaceID,
        num_render_targets: ::std::os::raw::c_int,
        context: *mut VAContextID,
    ) -> VAStatus;
}
extern "C" {
    pub fn vaDestroyContext(dpy: VADisplay, context: VAContextID) -> VAStatus;
}
pub type VAMFContextID = VAGenericID;
extern "C" {
    pub fn vaCreateMFContext(dpy: VADisplay, mf_context: *mut VAMFContextID) -> VAStatus;
}
extern "C" {
    pub fn vaMFAddContext(
        dpy: VADisplay,
        mf_context: VAMFContextID,
        context: VAContextID,
    ) -> VAStatus;
}
extern "C" {
    pub fn vaMFReleaseContext(
        dpy: VADisplay,
        mf_context: VAMFContextID,
        context: VAContextID,
    ) -> VAStatus;
}
pub type VABufferID = VAGenericID;
pub const VABufferType_VAPictureParameterBufferType: VABufferType = 0;
pub const VABufferType_VAIQMatrixBufferType: VABufferType = 1;
pub const VABufferType_VABitPlaneBufferType: VABufferType = 2;
pub const VABufferType_VASliceGroupMapBufferType: VABufferType = 3;
pub const VABufferType_VASliceParameterBufferType: VABufferType = 4;
pub const VABufferType_VASliceDataBufferType: VABufferType = 5;
pub const VABufferType_VAMacroblockParameterBufferType: VABufferType = 6;
pub const VABufferType_VAResidualDataBufferType: VABufferType = 7;
pub const VABufferType_VADeblockingParameterBufferType: VABufferType = 8;
pub const VABufferType_VAImageBufferType: VABufferType = 9;
pub const VABufferType_VAProtectedSliceDataBufferType: VABufferType = 10;
pub const VABufferType_VAQMatrixBufferType: VABufferType = 11;
pub const VABufferType_VAHuffmanTableBufferType: VABufferType = 12;
pub const VABufferType_VAProbabilityBufferType: VABufferType = 13;
pub const VABufferType_VAEncCodedBufferType: VABufferType = 21;
pub const VABufferType_VAEncSequenceParameterBufferType: VABufferType = 22;
pub const VABufferType_VAEncPictureParameterBufferType: VABufferType = 23;
pub const VABufferType_VAEncSliceParameterBufferType: VABufferType = 24;
pub const VABufferType_VAEncPackedHeaderParameterBufferType: VABufferType = 25;
pub const VABufferType_VAEncPackedHeaderDataBufferType: VABufferType = 26;
pub const VABufferType_VAEncMiscParameterBufferType: VABufferType = 27;
pub const VABufferType_VAEncMacroblockParameterBufferType: VABufferType = 28;
pub const VABufferType_VAEncMacroblockMapBufferType: VABufferType = 29;
pub const VABufferType_VAEncQPBufferType: VABufferType = 30;
pub const VABufferType_VAProcPipelineParameterBufferType: VABufferType = 41;
pub const VABufferType_VAProcFilterParameterBufferType: VABufferType = 42;
pub const VABufferType_VAEncFEIMVBufferType: VABufferType = 43;
pub const VABufferType_VAEncFEIMBCodeBufferType: VABufferType = 44;
pub const VABufferType_VAEncFEIDistortionBufferType: VABufferType = 45;
pub const VABufferType_VAEncFEIMBControlBufferType: VABufferType = 46;
pub const VABufferType_VAEncFEIMVPredictorBufferType: VABufferType = 47;
pub const VABufferType_VAStatsStatisticsParameterBufferType: VABufferType = 48;
pub const VABufferType_VAStatsStatisticsBufferType: VABufferType = 49;
pub const VABufferType_VAStatsStatisticsBottomFieldBufferType: VABufferType = 50;
pub const VABufferType_VAStatsMVBufferType: VABufferType = 51;
pub const VABufferType_VAStatsMVPredictorBufferType: VABufferType = 52;
pub const VABufferType_VAEncMacroblockDisableSkipMapBufferType: VABufferType = 53;
pub const VABufferType_VAEncFEICTBCmdBufferType: VABufferType = 54;
pub const VABufferType_VAEncFEICURecordBufferType: VABufferType = 55;
pub const VABufferType_VADecodeStreamoutBufferType: VABufferType = 56;
pub const VABufferType_VASubsetsParameterBufferType: VABufferType = 57;
pub const VABufferType_VAContextParameterUpdateBufferType: VABufferType = 58;
pub const VABufferType_VAProtectedSessionExecuteBufferType: VABufferType = 59;
pub const VABufferType_VAEncryptionParameterBufferType: VABufferType = 60;
pub const VABufferType_VABufferTypeMax: VABufferType = 61;
pub type VABufferType = ::std::os::raw::c_uint;
#[repr(C)]
#[derive(Copy, Clone)]
pub struct _VAContextParameterUpdateBuffer {
    pub flags: _VAContextParameterUpdateBuffer__bindgen_ty_1,
    pub context_priority: VAConfigAttribValContextPriority,
    pub reserved: [u32; 8usize],
}
#[repr(C)]
#[derive(Copy, Clone)]
pub union _VAContextParameterUpdateBuffer__bindgen_ty_1 {
    pub bits: _VAContextParameterUpdateBuffer__bindgen_ty_1__bindgen_ty_1,
    pub value: u32,
}
#[repr(C)]
#[repr(align(4))]
#[derive(Debug, Copy, Clone)]
pub struct _VAContextParameterUpdateBuffer__bindgen_ty_1__bindgen_ty_1 {
    pub _bitfield_align_1: [u32; 0],
    pub _bitfield_1: __BindgenBitfieldUnit<[u8; 4usize]>,
}
#[test]
fn bindgen_test_layout__VAContextParameterUpdateBuffer__bindgen_ty_1__bindgen_ty_1() {
    assert_eq!(
        ::std::mem::size_of::<_VAContextParameterUpdateBuffer__bindgen_ty_1__bindgen_ty_1>(),
        4usize,
        concat!(
            "Size of: ",
            stringify!(_VAContextParameterUpdateBuffer__bindgen_ty_1__bindgen_ty_1)
        )
    );
    assert_eq!(
        ::std::mem::align_of::<_VAContextParameterUpdateBuffer__bindgen_ty_1__bindgen_ty_1>(),
        4usize,
        concat!(
            "Alignment of ",
            stringify!(_VAContextParameterUpdateBuffer__bindgen_ty_1__bindgen_ty_1)
        )
    );
}
impl _VAContextParameterUpdateBuffer__bindgen_ty_1__bindgen_ty_1 {
    #[inline]
    pub fn context_priority_update(&self) -> u32 {
        unsafe { ::std::mem::transmute(self._bitfield_1.get(0usize, 1u8) as u32) }
    }
    #[inline]
    pub fn set_context_priority_update(&mut self, val: u32) {
        unsafe {
            let val: u32 = ::std::mem::transmute(val);
            self._bitfield_1.set(0usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub fn reserved(&self) -> u32 {
        unsafe { ::std::mem::transmute(self._bitfield_1.get(1usize, 31u8) as u32) }
    }
    #[inline]
    pub fn set_reserved(&mut self, val: u32) {
        unsafe {
            let val: u32 = ::std::mem::transmute(val);
            self._bitfield_1.set(1usize, 31u8, val as u64)
        }
    }
    #[inline]
    pub fn new_bitfield_1(
        context_priority_update: u32,
        reserved: u32,
    ) -> __BindgenBitfieldUnit<[u8; 4usize]> {
        let mut __bindgen_bitfield_unit: __BindgenBitfieldUnit<[u8; 4usize]> = Default::default();
        __bindgen_bitfield_unit.set(0usize, 1u8, {
            let context_priority_update: u32 =
                unsafe { ::std::mem::transmute(context_priority_update) };
            context_priority_update as u64
        });
        __bindgen_bitfield_unit.set(1usize, 31u8, {
            let reserved: u32 = unsafe { ::std::mem::transmute(reserved) };
            reserved as u64
        });
        __bindgen_bitfield_unit
    }
}
#[test]
fn bindgen_test_layout__VAContextParameterUpdateBuffer__bindgen_ty_1() {
    assert_eq!(
        ::std::mem::size_of::<_VAContextParameterUpdateBuffer__bindgen_ty_1>(),
        4usize,
        concat!(
            "Size of: ",
            stringify!(_VAContextParameterUpdateBuffer__bindgen_ty_1)
        )
    );
    assert_eq!(
        ::std::mem::align_of::<_VAContextParameterUpdateBuffer__bindgen_ty_1>(),
        4usize,
        concat!(
            "Alignment of ",
            stringify!(_VAContextParameterUpdateBuffer__bindgen_ty_1)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<_VAContextParameterUpdateBuffer__bindgen_ty_1>())).bits
                as *const _ as usize
        },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(_VAContextParameterUpdateBuffer__bindgen_ty_1),
            "::",
            stringify!(bits)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<_VAContextParameterUpdateBuffer__bindgen_ty_1>())).value
                as *const _ as usize
        },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(_VAContextParameterUpdateBuffer__bindgen_ty_1),
            "::",
            stringify!(value)
        )
    );
}
#[test]
fn bindgen_test_layout__VAContextParameterUpdateBuffer() {
    assert_eq!(
        ::std::mem::size_of::<_VAContextParameterUpdateBuffer>(),
        40usize,
        concat!("Size of: ", stringify!(_VAContextParameterUpdateBuffer))
    );
    assert_eq!(
        ::std::mem::align_of::<_VAContextParameterUpdateBuffer>(),
        4usize,
        concat!("Alignment of ", stringify!(_VAContextParameterUpdateBuffer))
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<_VAContextParameterUpdateBuffer>())).flags as *const _ as usize
        },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(_VAContextParameterUpdateBuffer),
            "::",
            stringify!(flags)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<_VAContextParameterUpdateBuffer>())).context_priority as *const _
                as usize
        },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(_VAContextParameterUpdateBuffer),
            "::",
            stringify!(context_priority)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<_VAContextParameterUpdateBuffer>())).reserved as *const _
                as usize
        },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(_VAContextParameterUpdateBuffer),
            "::",
            stringify!(reserved)
        )
    );
}
pub type VAContextParameterUpdateBuffer = _VAContextParameterUpdateBuffer;
#[repr(C)]
#[derive(Copy, Clone)]
pub struct _VAEncryptionSegmentInfo {
    pub segment_start_offset: u32,
    pub segment_length: u32,
    pub partial_aes_block_size: u32,
    pub init_byte_length: u32,
    pub aes_cbc_iv_or_ctr: [u8; 64usize],
    pub va_reserved: [u32; 8usize],
}
#[test]
fn bindgen_test_layout__VAEncryptionSegmentInfo() {
    assert_eq!(
        ::std::mem::size_of::<_VAEncryptionSegmentInfo>(),
        112usize,
        concat!("Size of: ", stringify!(_VAEncryptionSegmentInfo))
    );
    assert_eq!(
        ::std::mem::align_of::<_VAEncryptionSegmentInfo>(),
        4usize,
        concat!("Alignment of ", stringify!(_VAEncryptionSegmentInfo))
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<_VAEncryptionSegmentInfo>())).segment_start_offset as *const _
                as usize
        },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(_VAEncryptionSegmentInfo),
            "::",
            stringify!(segment_start_offset)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<_VAEncryptionSegmentInfo>())).segment_length as *const _ as usize
        },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(_VAEncryptionSegmentInfo),
            "::",
            stringify!(segment_length)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<_VAEncryptionSegmentInfo>())).partial_aes_block_size as *const _
                as usize
        },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(_VAEncryptionSegmentInfo),
            "::",
            stringify!(partial_aes_block_size)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<_VAEncryptionSegmentInfo>())).init_byte_length as *const _
                as usize
        },
        12usize,
        concat!(
            "Offset of field: ",
            stringify!(_VAEncryptionSegmentInfo),
            "::",
            stringify!(init_byte_length)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<_VAEncryptionSegmentInfo>())).aes_cbc_iv_or_ctr as *const _
                as usize
        },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(_VAEncryptionSegmentInfo),
            "::",
            stringify!(aes_cbc_iv_or_ctr)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<_VAEncryptionSegmentInfo>())).va_reserved as *const _ as usize
        },
        80usize,
        concat!(
            "Offset of field: ",
            stringify!(_VAEncryptionSegmentInfo),
            "::",
            stringify!(va_reserved)
        )
    );
}
pub type VAEncryptionSegmentInfo = _VAEncryptionSegmentInfo;
#[repr(C)]
#[derive(Copy, Clone)]
pub struct _VAEncryptionParameters {
    pub encryption_type: u32,
    pub num_segments: u32,
    pub segment_info: *mut VAEncryptionSegmentInfo,
    pub status_report_index: u32,
    pub size_of_length: u32,
    pub wrapped_decrypt_blob: [u8; 64usize],
    pub wrapped_encrypt_blob: [u8; 64usize],
    pub key_blob_size: u32,
    pub blocks_stripe_encrypted: u32,
    pub blocks_stripe_clear: u32,
    pub va_reserved: [u32; 8usize],
}
#[test]
fn bindgen_test_layout__VAEncryptionParameters() {
    assert_eq!(
        ::std::mem::size_of::<_VAEncryptionParameters>(),
        200usize,
        concat!("Size of: ", stringify!(_VAEncryptionParameters))
    );
    assert_eq!(
        ::std::mem::align_of::<_VAEncryptionParameters>(),
        8usize,
        concat!("Alignment of ", stringify!(_VAEncryptionParameters))
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<_VAEncryptionParameters>())).encryption_type as *const _ as usize
        },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(_VAEncryptionParameters),
            "::",
            stringify!(encryption_type)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<_VAEncryptionParameters>())).num_segments as *const _ as usize
        },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(_VAEncryptionParameters),
            "::",
            stringify!(num_segments)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<_VAEncryptionParameters>())).segment_info as *const _ as usize
        },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(_VAEncryptionParameters),
            "::",
            stringify!(segment_info)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<_VAEncryptionParameters>())).status_report_index as *const _
                as usize
        },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(_VAEncryptionParameters),
            "::",
            stringify!(status_report_index)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<_VAEncryptionParameters>())).size_of_length as *const _ as usize
        },
        20usize,
        concat!(
            "Offset of field: ",
            stringify!(_VAEncryptionParameters),
            "::",
            stringify!(size_of_length)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<_VAEncryptionParameters>())).wrapped_decrypt_blob as *const _
                as usize
        },
        24usize,
        concat!(
            "Offset of field: ",
            stringify!(_VAEncryptionParameters),
            "::",
            stringify!(wrapped_decrypt_blob)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<_VAEncryptionParameters>())).wrapped_encrypt_blob as *const _
                as usize
        },
        88usize,
        concat!(
            "Offset of field: ",
            stringify!(_VAEncryptionParameters),
            "::",
            stringify!(wrapped_encrypt_blob)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<_VAEncryptionParameters>())).key_blob_size as *const _ as usize
        },
        152usize,
        concat!(
            "Offset of field: ",
            stringify!(_VAEncryptionParameters),
            "::",
            stringify!(key_blob_size)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<_VAEncryptionParameters>())).blocks_stripe_encrypted as *const _
                as usize
        },
        156usize,
        concat!(
            "Offset of field: ",
            stringify!(_VAEncryptionParameters),
            "::",
            stringify!(blocks_stripe_encrypted)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<_VAEncryptionParameters>())).blocks_stripe_clear as *const _
                as usize
        },
        160usize,
        concat!(
            "Offset of field: ",
            stringify!(_VAEncryptionParameters),
            "::",
            stringify!(blocks_stripe_clear)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<_VAEncryptionParameters>())).va_reserved as *const _ as usize
        },
        164usize,
        concat!(
            "Offset of field: ",
            stringify!(_VAEncryptionParameters),
            "::",
            stringify!(va_reserved)
        )
    );
}
pub type VAEncryptionParameters = _VAEncryptionParameters;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct _VAProcessingRateParameterEnc {
    pub level_idc: u8,
    pub reserved: [u8; 3usize],
    pub quality_level: u32,
    pub intra_period: u32,
    pub ip_period: u32,
}
#[test]
fn bindgen_test_layout__VAProcessingRateParameterEnc() {
    assert_eq!(
        ::std::mem::size_of::<_VAProcessingRateParameterEnc>(),
        16usize,
        concat!("Size of: ", stringify!(_VAProcessingRateParameterEnc))
    );
    assert_eq!(
        ::std::mem::align_of::<_VAProcessingRateParameterEnc>(),
        4usize,
        concat!("Alignment of ", stringify!(_VAProcessingRateParameterEnc))
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<_VAProcessingRateParameterEnc>())).level_idc as *const _ as usize
        },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(_VAProcessingRateParameterEnc),
            "::",
            stringify!(level_idc)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<_VAProcessingRateParameterEnc>())).reserved as *const _ as usize
        },
        1usize,
        concat!(
            "Offset of field: ",
            stringify!(_VAProcessingRateParameterEnc),
            "::",
            stringify!(reserved)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<_VAProcessingRateParameterEnc>())).quality_level as *const _
                as usize
        },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(_VAProcessingRateParameterEnc),
            "::",
            stringify!(quality_level)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<_VAProcessingRateParameterEnc>())).intra_period as *const _
                as usize
        },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(_VAProcessingRateParameterEnc),
            "::",
            stringify!(intra_period)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<_VAProcessingRateParameterEnc>())).ip_period as *const _ as usize
        },
        12usize,
        concat!(
            "Offset of field: ",
            stringify!(_VAProcessingRateParameterEnc),
            "::",
            stringify!(ip_period)
        )
    );
}
pub type VAProcessingRateParameterEnc = _VAProcessingRateParameterEnc;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct _VAProcessingRateParameterDec {
    pub level_idc: u8,
    pub reserved0: [u8; 3usize],
    pub reserved: u32,
}
#[test]
fn bindgen_test_layout__VAProcessingRateParameterDec() {
    assert_eq!(
        ::std::mem::size_of::<_VAProcessingRateParameterDec>(),
        8usize,
        concat!("Size of: ", stringify!(_VAProcessingRateParameterDec))
    );
    assert_eq!(
        ::std::mem::align_of::<_VAProcessingRateParameterDec>(),
        4usize,
        concat!("Alignment of ", stringify!(_VAProcessingRateParameterDec))
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<_VAProcessingRateParameterDec>())).level_idc as *const _ as usize
        },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(_VAProcessingRateParameterDec),
            "::",
            stringify!(level_idc)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<_VAProcessingRateParameterDec>())).reserved0 as *const _ as usize
        },
        1usize,
        concat!(
            "Offset of field: ",
            stringify!(_VAProcessingRateParameterDec),
            "::",
            stringify!(reserved0)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<_VAProcessingRateParameterDec>())).reserved as *const _ as usize
        },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(_VAProcessingRateParameterDec),
            "::",
            stringify!(reserved)
        )
    );
}
pub type VAProcessingRateParameterDec = _VAProcessingRateParameterDec;
#[repr(C)]
#[derive(Copy, Clone)]
pub struct _VAProcessingRateParameter {
    pub __bindgen_anon_1: _VAProcessingRateParameter__bindgen_ty_1,
}
#[repr(C)]
#[derive(Copy, Clone)]
pub union _VAProcessingRateParameter__bindgen_ty_1 {
    pub proc_buf_enc: VAProcessingRateParameterEnc,
    pub proc_buf_dec: VAProcessingRateParameterDec,
}
#[test]
fn bindgen_test_layout__VAProcessingRateParameter__bindgen_ty_1() {
    assert_eq!(
        ::std::mem::size_of::<_VAProcessingRateParameter__bindgen_ty_1>(),
        16usize,
        concat!(
            "Size of: ",
            stringify!(_VAProcessingRateParameter__bindgen_ty_1)
        )
    );
    assert_eq!(
        ::std::mem::align_of::<_VAProcessingRateParameter__bindgen_ty_1>(),
        4usize,
        concat!(
            "Alignment of ",
            stringify!(_VAProcessingRateParameter__bindgen_ty_1)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<_VAProcessingRateParameter__bindgen_ty_1>())).proc_buf_enc
                as *const _ as usize
        },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(_VAProcessingRateParameter__bindgen_ty_1),
            "::",
            stringify!(proc_buf_enc)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<_VAProcessingRateParameter__bindgen_ty_1>())).proc_buf_dec
                as *const _ as usize
        },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(_VAProcessingRateParameter__bindgen_ty_1),
            "::",
            stringify!(proc_buf_dec)
        )
    );
}
#[test]
fn bindgen_test_layout__VAProcessingRateParameter() {
    assert_eq!(
        ::std::mem::size_of::<_VAProcessingRateParameter>(),
        16usize,
        concat!("Size of: ", stringify!(_VAProcessingRateParameter))
    );
    assert_eq!(
        ::std::mem::align_of::<_VAProcessingRateParameter>(),
        4usize,
        concat!("Alignment of ", stringify!(_VAProcessingRateParameter))
    );
}
pub type VAProcessingRateParameter = _VAProcessingRateParameter;
extern "C" {
    pub fn vaQueryProcessingRate(
        dpy: VADisplay,
        config: VAConfigID,
        proc_buf: *mut VAProcessingRateParameter,
        processing_rate: *mut ::std::os::raw::c_uint,
    ) -> VAStatus;
}
pub const VAEncMiscParameterType_VAEncMiscParameterTypeFrameRate: VAEncMiscParameterType = 0;
pub const VAEncMiscParameterType_VAEncMiscParameterTypeRateControl: VAEncMiscParameterType = 1;
pub const VAEncMiscParameterType_VAEncMiscParameterTypeMaxSliceSize: VAEncMiscParameterType = 2;
pub const VAEncMiscParameterType_VAEncMiscParameterTypeAIR: VAEncMiscParameterType = 3;
pub const VAEncMiscParameterType_VAEncMiscParameterTypeMaxFrameSize: VAEncMiscParameterType = 4;
pub const VAEncMiscParameterType_VAEncMiscParameterTypeHRD: VAEncMiscParameterType = 5;
pub const VAEncMiscParameterType_VAEncMiscParameterTypeQualityLevel: VAEncMiscParameterType = 6;
pub const VAEncMiscParameterType_VAEncMiscParameterTypeRIR: VAEncMiscParameterType = 7;
pub const VAEncMiscParameterType_VAEncMiscParameterTypeQuantization: VAEncMiscParameterType = 8;
pub const VAEncMiscParameterType_VAEncMiscParameterTypeSkipFrame: VAEncMiscParameterType = 9;
pub const VAEncMiscParameterType_VAEncMiscParameterTypeROI: VAEncMiscParameterType = 10;
pub const VAEncMiscParameterType_VAEncMiscParameterTypeMultiPassFrameSize: VAEncMiscParameterType =
    11;
pub const VAEncMiscParameterType_VAEncMiscParameterTypeTemporalLayerStructure:
    VAEncMiscParameterType = 12;
pub const VAEncMiscParameterType_VAEncMiscParameterTypeDirtyRect: VAEncMiscParameterType = 13;
pub const VAEncMiscParameterType_VAEncMiscParameterTypeParallelBRC: VAEncMiscParameterType = 14;
pub const VAEncMiscParameterType_VAEncMiscParameterTypeSubMbPartPel: VAEncMiscParameterType = 15;
pub const VAEncMiscParameterType_VAEncMiscParameterTypeEncQuality: VAEncMiscParameterType = 16;
pub const VAEncMiscParameterType_VAEncMiscParameterTypeCustomRoundingControl:
    VAEncMiscParameterType = 17;
pub const VAEncMiscParameterType_VAEncMiscParameterTypeFEIFrameControl: VAEncMiscParameterType = 18;
pub const VAEncMiscParameterType_VAEncMiscParameterTypeExtensionData: VAEncMiscParameterType = 19;
pub type VAEncMiscParameterType = ::std::os::raw::c_uint;
pub const VAEncPackedHeaderType_VAEncPackedHeaderSequence: VAEncPackedHeaderType = 1;
pub const VAEncPackedHeaderType_VAEncPackedHeaderPicture: VAEncPackedHeaderType = 2;
pub const VAEncPackedHeaderType_VAEncPackedHeaderSlice: VAEncPackedHeaderType = 3;
pub const VAEncPackedHeaderType_VAEncPackedHeaderRawData: VAEncPackedHeaderType = 4;
pub const VAEncPackedHeaderType_VAEncPackedHeaderMiscMask: VAEncPackedHeaderType = 2147483648;
pub type VAEncPackedHeaderType = ::std::os::raw::c_uint;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct _VAEncPackedHeaderParameterBuffer {
    pub type_: u32,
    pub bit_length: u32,
    pub has_emulation_bytes: u8,
    pub va_reserved: [u32; 4usize],
}
#[test]
fn bindgen_test_layout__VAEncPackedHeaderParameterBuffer() {
    assert_eq!(
        ::std::mem::size_of::<_VAEncPackedHeaderParameterBuffer>(),
        28usize,
        concat!("Size of: ", stringify!(_VAEncPackedHeaderParameterBuffer))
    );
    assert_eq!(
        ::std::mem::align_of::<_VAEncPackedHeaderParameterBuffer>(),
        4usize,
        concat!(
            "Alignment of ",
            stringify!(_VAEncPackedHeaderParameterBuffer)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<_VAEncPackedHeaderParameterBuffer>())).type_ as *const _ as usize
        },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(_VAEncPackedHeaderParameterBuffer),
            "::",
            stringify!(type_)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<_VAEncPackedHeaderParameterBuffer>())).bit_length as *const _
                as usize
        },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(_VAEncPackedHeaderParameterBuffer),
            "::",
            stringify!(bit_length)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<_VAEncPackedHeaderParameterBuffer>())).has_emulation_bytes
                as *const _ as usize
        },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(_VAEncPackedHeaderParameterBuffer),
            "::",
            stringify!(has_emulation_bytes)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<_VAEncPackedHeaderParameterBuffer>())).va_reserved as *const _
                as usize
        },
        12usize,
        concat!(
            "Offset of field: ",
            stringify!(_VAEncPackedHeaderParameterBuffer),
            "::",
            stringify!(va_reserved)
        )
    );
}
pub type VAEncPackedHeaderParameterBuffer = _VAEncPackedHeaderParameterBuffer;
#[repr(C)]
#[derive(Debug)]
pub struct _VAEncMiscParameterBuffer {
    pub type_: VAEncMiscParameterType,
    pub data: __IncompleteArrayField<u32>,
}
#[test]
fn bindgen_test_layout__VAEncMiscParameterBuffer() {
    assert_eq!(
        ::std::mem::size_of::<_VAEncMiscParameterBuffer>(),
        4usize,
        concat!("Size of: ", stringify!(_VAEncMiscParameterBuffer))
    );
    assert_eq!(
        ::std::mem::align_of::<_VAEncMiscParameterBuffer>(),
        4usize,
        concat!("Alignment of ", stringify!(_VAEncMiscParameterBuffer))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<_VAEncMiscParameterBuffer>())).type_ as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(_VAEncMiscParameterBuffer),
            "::",
            stringify!(type_)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<_VAEncMiscParameterBuffer>())).data as *const _ as usize },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(_VAEncMiscParameterBuffer),
            "::",
            stringify!(data)
        )
    );
}
pub type VAEncMiscParameterBuffer = _VAEncMiscParameterBuffer;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct _VAEncMiscParameterTemporalLayerStructure {
    pub number_of_layers: u32,
    pub periodicity: u32,
    pub layer_id: [u32; 32usize],
    pub va_reserved: [u32; 4usize],
}
#[test]
fn bindgen_test_layout__VAEncMiscParameterTemporalLayerStructure() {
    assert_eq!(
        ::std::mem::size_of::<_VAEncMiscParameterTemporalLayerStructure>(),
        152usize,
        concat!(
            "Size of: ",
            stringify!(_VAEncMiscParameterTemporalLayerStructure)
        )
    );
    assert_eq!(
        ::std::mem::align_of::<_VAEncMiscParameterTemporalLayerStructure>(),
        4usize,
        concat!(
            "Alignment of ",
            stringify!(_VAEncMiscParameterTemporalLayerStructure)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<_VAEncMiscParameterTemporalLayerStructure>())).number_of_layers
                as *const _ as usize
        },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(_VAEncMiscParameterTemporalLayerStructure),
            "::",
            stringify!(number_of_layers)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<_VAEncMiscParameterTemporalLayerStructure>())).periodicity
                as *const _ as usize
        },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(_VAEncMiscParameterTemporalLayerStructure),
            "::",
            stringify!(periodicity)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<_VAEncMiscParameterTemporalLayerStructure>())).layer_id
                as *const _ as usize
        },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(_VAEncMiscParameterTemporalLayerStructure),
            "::",
            stringify!(layer_id)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<_VAEncMiscParameterTemporalLayerStructure>())).va_reserved
                as *const _ as usize
        },
        136usize,
        concat!(
            "Offset of field: ",
            stringify!(_VAEncMiscParameterTemporalLayerStructure),
            "::",
            stringify!(va_reserved)
        )
    );
}
pub type VAEncMiscParameterTemporalLayerStructure = _VAEncMiscParameterTemporalLayerStructure;
#[repr(C)]
#[derive(Copy, Clone)]
pub struct _VAEncMiscParameterRateControl {
    pub bits_per_second: u32,
    pub target_percentage: u32,
    pub window_size: u32,
    pub initial_qp: u32,
    pub min_qp: u32,
    pub basic_unit_size: u32,
    pub rc_flags: _VAEncMiscParameterRateControl__bindgen_ty_1,
    pub ICQ_quality_factor: u32,
    pub max_qp: u32,
    pub quality_factor: u32,
    pub target_frame_size: u32,
    pub va_reserved: [u32; 4usize],
}
#[repr(C)]
#[derive(Copy, Clone)]
pub union _VAEncMiscParameterRateControl__bindgen_ty_1 {
    pub bits: _VAEncMiscParameterRateControl__bindgen_ty_1__bindgen_ty_1,
    pub value: u32,
}
#[repr(C)]
#[repr(align(4))]
#[derive(Debug, Copy, Clone)]
pub struct _VAEncMiscParameterRateControl__bindgen_ty_1__bindgen_ty_1 {
    pub _bitfield_align_1: [u16; 0],
    pub _bitfield_1: __BindgenBitfieldUnit<[u8; 4usize]>,
}
#[test]
fn bindgen_test_layout__VAEncMiscParameterRateControl__bindgen_ty_1__bindgen_ty_1() {
    assert_eq!(
        ::std::mem::size_of::<_VAEncMiscParameterRateControl__bindgen_ty_1__bindgen_ty_1>(),
        4usize,
        concat!(
            "Size of: ",
            stringify!(_VAEncMiscParameterRateControl__bindgen_ty_1__bindgen_ty_1)
        )
    );
    assert_eq!(
        ::std::mem::align_of::<_VAEncMiscParameterRateControl__bindgen_ty_1__bindgen_ty_1>(),
        4usize,
        concat!(
            "Alignment of ",
            stringify!(_VAEncMiscParameterRateControl__bindgen_ty_1__bindgen_ty_1)
        )
    );
}
impl _VAEncMiscParameterRateControl__bindgen_ty_1__bindgen_ty_1 {
    #[inline]
    pub fn reset(&self) -> u32 {
        unsafe { ::std::mem::transmute(self._bitfield_1.get(0usize, 1u8) as u32) }
    }
    #[inline]
    pub fn set_reset(&mut self, val: u32) {
        unsafe {
            let val: u32 = ::std::mem::transmute(val);
            self._bitfield_1.set(0usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub fn disable_frame_skip(&self) -> u32 {
        unsafe { ::std::mem::transmute(self._bitfield_1.get(1usize, 1u8) as u32) }
    }
    #[inline]
    pub fn set_disable_frame_skip(&mut self, val: u32) {
        unsafe {
            let val: u32 = ::std::mem::transmute(val);
            self._bitfield_1.set(1usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub fn disable_bit_stuffing(&self) -> u32 {
        unsafe { ::std::mem::transmute(self._bitfield_1.get(2usize, 1u8) as u32) }
    }
    #[inline]
    pub fn set_disable_bit_stuffing(&mut self, val: u32) {
        unsafe {
            let val: u32 = ::std::mem::transmute(val);
            self._bitfield_1.set(2usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub fn mb_rate_control(&self) -> u32 {
        unsafe { ::std::mem::transmute(self._bitfield_1.get(3usize, 4u8) as u32) }
    }
    #[inline]
    pub fn set_mb_rate_control(&mut self, val: u32) {
        unsafe {
            let val: u32 = ::std::mem::transmute(val);
            self._bitfield_1.set(3usize, 4u8, val as u64)
        }
    }
    #[inline]
    pub fn temporal_id(&self) -> u32 {
        unsafe { ::std::mem::transmute(self._bitfield_1.get(7usize, 8u8) as u32) }
    }
    #[inline]
    pub fn set_temporal_id(&mut self, val: u32) {
        unsafe {
            let val: u32 = ::std::mem::transmute(val);
            self._bitfield_1.set(7usize, 8u8, val as u64)
        }
    }
    #[inline]
    pub fn cfs_I_frames(&self) -> u32 {
        unsafe { ::std::mem::transmute(self._bitfield_1.get(15usize, 1u8) as u32) }
    }
    #[inline]
    pub fn set_cfs_I_frames(&mut self, val: u32) {
        unsafe {
            let val: u32 = ::std::mem::transmute(val);
            self._bitfield_1.set(15usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub fn enable_parallel_brc(&self) -> u32 {
        unsafe { ::std::mem::transmute(self._bitfield_1.get(16usize, 1u8) as u32) }
    }
    #[inline]
    pub fn set_enable_parallel_brc(&mut self, val: u32) {
        unsafe {
            let val: u32 = ::std::mem::transmute(val);
            self._bitfield_1.set(16usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub fn enable_dynamic_scaling(&self) -> u32 {
        unsafe { ::std::mem::transmute(self._bitfield_1.get(17usize, 1u8) as u32) }
    }
    #[inline]
    pub fn set_enable_dynamic_scaling(&mut self, val: u32) {
        unsafe {
            let val: u32 = ::std::mem::transmute(val);
            self._bitfield_1.set(17usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub fn frame_tolerance_mode(&self) -> u32 {
        unsafe { ::std::mem::transmute(self._bitfield_1.get(18usize, 2u8) as u32) }
    }
    #[inline]
    pub fn set_frame_tolerance_mode(&mut self, val: u32) {
        unsafe {
            let val: u32 = ::std::mem::transmute(val);
            self._bitfield_1.set(18usize, 2u8, val as u64)
        }
    }
    #[inline]
    pub fn reserved(&self) -> u32 {
        unsafe { ::std::mem::transmute(self._bitfield_1.get(20usize, 12u8) as u32) }
    }
    #[inline]
    pub fn set_reserved(&mut self, val: u32) {
        unsafe {
            let val: u32 = ::std::mem::transmute(val);
            self._bitfield_1.set(20usize, 12u8, val as u64)
        }
    }
    #[inline]
    pub fn new_bitfield_1(
        reset: u32,
        disable_frame_skip: u32,
        disable_bit_stuffing: u32,
        mb_rate_control: u32,
        temporal_id: u32,
        cfs_I_frames: u32,
        enable_parallel_brc: u32,
        enable_dynamic_scaling: u32,
        frame_tolerance_mode: u32,
        reserved: u32,
    ) -> __BindgenBitfieldUnit<[u8; 4usize]> {
        let mut __bindgen_bitfield_unit: __BindgenBitfieldUnit<[u8; 4usize]> = Default::default();
        __bindgen_bitfield_unit.set(0usize, 1u8, {
            let reset: u32 = unsafe { ::std::mem::transmute(reset) };
            reset as u64
        });
        __bindgen_bitfield_unit.set(1usize, 1u8, {
            let disable_frame_skip: u32 = unsafe { ::std::mem::transmute(disable_frame_skip) };
            disable_frame_skip as u64
        });
        __bindgen_bitfield_unit.set(2usize, 1u8, {
            let disable_bit_stuffing: u32 = unsafe { ::std::mem::transmute(disable_bit_stuffing) };
            disable_bit_stuffing as u64
        });
        __bindgen_bitfield_unit.set(3usize, 4u8, {
            let mb_rate_control: u32 = unsafe { ::std::mem::transmute(mb_rate_control) };
            mb_rate_control as u64
        });
        __bindgen_bitfield_unit.set(7usize, 8u8, {
            let temporal_id: u32 = unsafe { ::std::mem::transmute(temporal_id) };
            temporal_id as u64
        });
        __bindgen_bitfield_unit.set(15usize, 1u8, {
            let cfs_I_frames: u32 = unsafe { ::std::mem::transmute(cfs_I_frames) };
            cfs_I_frames as u64
        });
        __bindgen_bitfield_unit.set(16usize, 1u8, {
            let enable_parallel_brc: u32 = unsafe { ::std::mem::transmute(enable_parallel_brc) };
            enable_parallel_brc as u64
        });
        __bindgen_bitfield_unit.set(17usize, 1u8, {
            let enable_dynamic_scaling: u32 =
                unsafe { ::std::mem::transmute(enable_dynamic_scaling) };
            enable_dynamic_scaling as u64
        });
        __bindgen_bitfield_unit.set(18usize, 2u8, {
            let frame_tolerance_mode: u32 = unsafe { ::std::mem::transmute(frame_tolerance_mode) };
            frame_tolerance_mode as u64
        });
        __bindgen_bitfield_unit.set(20usize, 12u8, {
            let reserved: u32 = unsafe { ::std::mem::transmute(reserved) };
            reserved as u64
        });
        __bindgen_bitfield_unit
    }
}
#[test]
fn bindgen_test_layout__VAEncMiscParameterRateControl__bindgen_ty_1() {
    assert_eq!(
        ::std::mem::size_of::<_VAEncMiscParameterRateControl__bindgen_ty_1>(),
        4usize,
        concat!(
            "Size of: ",
            stringify!(_VAEncMiscParameterRateControl__bindgen_ty_1)
        )
    );
    assert_eq!(
        ::std::mem::align_of::<_VAEncMiscParameterRateControl__bindgen_ty_1>(),
        4usize,
        concat!(
            "Alignment of ",
            stringify!(_VAEncMiscParameterRateControl__bindgen_ty_1)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<_VAEncMiscParameterRateControl__bindgen_ty_1>())).bits
                as *const _ as usize
        },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(_VAEncMiscParameterRateControl__bindgen_ty_1),
            "::",
            stringify!(bits)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<_VAEncMiscParameterRateControl__bindgen_ty_1>())).value
                as *const _ as usize
        },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(_VAEncMiscParameterRateControl__bindgen_ty_1),
            "::",
            stringify!(value)
        )
    );
}
#[test]
fn bindgen_test_layout__VAEncMiscParameterRateControl() {
    assert_eq!(
        ::std::mem::size_of::<_VAEncMiscParameterRateControl>(),
        60usize,
        concat!("Size of: ", stringify!(_VAEncMiscParameterRateControl))
    );
    assert_eq!(
        ::std::mem::align_of::<_VAEncMiscParameterRateControl>(),
        4usize,
        concat!("Alignment of ", stringify!(_VAEncMiscParameterRateControl))
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<_VAEncMiscParameterRateControl>())).bits_per_second as *const _
                as usize
        },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(_VAEncMiscParameterRateControl),
            "::",
            stringify!(bits_per_second)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<_VAEncMiscParameterRateControl>())).target_percentage as *const _
                as usize
        },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(_VAEncMiscParameterRateControl),
            "::",
            stringify!(target_percentage)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<_VAEncMiscParameterRateControl>())).window_size as *const _
                as usize
        },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(_VAEncMiscParameterRateControl),
            "::",
            stringify!(window_size)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<_VAEncMiscParameterRateControl>())).initial_qp as *const _
                as usize
        },
        12usize,
        concat!(
            "Offset of field: ",
            stringify!(_VAEncMiscParameterRateControl),
            "::",
            stringify!(initial_qp)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<_VAEncMiscParameterRateControl>())).min_qp as *const _ as usize
        },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(_VAEncMiscParameterRateControl),
            "::",
            stringify!(min_qp)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<_VAEncMiscParameterRateControl>())).basic_unit_size as *const _
                as usize
        },
        20usize,
        concat!(
            "Offset of field: ",
            stringify!(_VAEncMiscParameterRateControl),
            "::",
            stringify!(basic_unit_size)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<_VAEncMiscParameterRateControl>())).rc_flags as *const _ as usize
        },
        24usize,
        concat!(
            "Offset of field: ",
            stringify!(_VAEncMiscParameterRateControl),
            "::",
            stringify!(rc_flags)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<_VAEncMiscParameterRateControl>())).ICQ_quality_factor
                as *const _ as usize
        },
        28usize,
        concat!(
            "Offset of field: ",
            stringify!(_VAEncMiscParameterRateControl),
            "::",
            stringify!(ICQ_quality_factor)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<_VAEncMiscParameterRateControl>())).max_qp as *const _ as usize
        },
        32usize,
        concat!(
            "Offset of field: ",
            stringify!(_VAEncMiscParameterRateControl),
            "::",
            stringify!(max_qp)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<_VAEncMiscParameterRateControl>())).quality_factor as *const _
                as usize
        },
        36usize,
        concat!(
            "Offset of field: ",
            stringify!(_VAEncMiscParameterRateControl),
            "::",
            stringify!(quality_factor)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<_VAEncMiscParameterRateControl>())).target_frame_size as *const _
                as usize
        },
        40usize,
        concat!(
            "Offset of field: ",
            stringify!(_VAEncMiscParameterRateControl),
            "::",
            stringify!(target_frame_size)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<_VAEncMiscParameterRateControl>())).va_reserved as *const _
                as usize
        },
        44usize,
        concat!(
            "Offset of field: ",
            stringify!(_VAEncMiscParameterRateControl),
            "::",
            stringify!(va_reserved)
        )
    );
}
pub type VAEncMiscParameterRateControl = _VAEncMiscParameterRateControl;
#[repr(C)]
#[derive(Copy, Clone)]
pub struct _VAEncMiscParameterFrameRate {
    pub framerate: u32,
    pub framerate_flags: _VAEncMiscParameterFrameRate__bindgen_ty_1,
    pub va_reserved: [u32; 4usize],
}
#[repr(C)]
#[derive(Copy, Clone)]
pub union _VAEncMiscParameterFrameRate__bindgen_ty_1 {
    pub bits: _VAEncMiscParameterFrameRate__bindgen_ty_1__bindgen_ty_1,
    pub value: u32,
}
#[repr(C)]
#[repr(align(4))]
#[derive(Debug, Copy, Clone)]
pub struct _VAEncMiscParameterFrameRate__bindgen_ty_1__bindgen_ty_1 {
    pub _bitfield_align_1: [u32; 0],
    pub _bitfield_1: __BindgenBitfieldUnit<[u8; 4usize]>,
}
#[test]
fn bindgen_test_layout__VAEncMiscParameterFrameRate__bindgen_ty_1__bindgen_ty_1() {
    assert_eq!(
        ::std::mem::size_of::<_VAEncMiscParameterFrameRate__bindgen_ty_1__bindgen_ty_1>(),
        4usize,
        concat!(
            "Size of: ",
            stringify!(_VAEncMiscParameterFrameRate__bindgen_ty_1__bindgen_ty_1)
        )
    );
    assert_eq!(
        ::std::mem::align_of::<_VAEncMiscParameterFrameRate__bindgen_ty_1__bindgen_ty_1>(),
        4usize,
        concat!(
            "Alignment of ",
            stringify!(_VAEncMiscParameterFrameRate__bindgen_ty_1__bindgen_ty_1)
        )
    );
}
impl _VAEncMiscParameterFrameRate__bindgen_ty_1__bindgen_ty_1 {
    #[inline]
    pub fn temporal_id(&self) -> u32 {
        unsafe { ::std::mem::transmute(self._bitfield_1.get(0usize, 8u8) as u32) }
    }
    #[inline]
    pub fn set_temporal_id(&mut self, val: u32) {
        unsafe {
            let val: u32 = ::std::mem::transmute(val);
            self._bitfield_1.set(0usize, 8u8, val as u64)
        }
    }
    #[inline]
    pub fn reserved(&self) -> u32 {
        unsafe { ::std::mem::transmute(self._bitfield_1.get(8usize, 24u8) as u32) }
    }
    #[inline]
    pub fn set_reserved(&mut self, val: u32) {
        unsafe {
            let val: u32 = ::std::mem::transmute(val);
            self._bitfield_1.set(8usize, 24u8, val as u64)
        }
    }
    #[inline]
    pub fn new_bitfield_1(temporal_id: u32, reserved: u32) -> __BindgenBitfieldUnit<[u8; 4usize]> {
        let mut __bindgen_bitfield_unit: __BindgenBitfieldUnit<[u8; 4usize]> = Default::default();
        __bindgen_bitfield_unit.set(0usize, 8u8, {
            let temporal_id: u32 = unsafe { ::std::mem::transmute(temporal_id) };
            temporal_id as u64
        });
        __bindgen_bitfield_unit.set(8usize, 24u8, {
            let reserved: u32 = unsafe { ::std::mem::transmute(reserved) };
            reserved as u64
        });
        __bindgen_bitfield_unit
    }
}
#[test]
fn bindgen_test_layout__VAEncMiscParameterFrameRate__bindgen_ty_1() {
    assert_eq!(
        ::std::mem::size_of::<_VAEncMiscParameterFrameRate__bindgen_ty_1>(),
        4usize,
        concat!(
            "Size of: ",
            stringify!(_VAEncMiscParameterFrameRate__bindgen_ty_1)
        )
    );
    assert_eq!(
        ::std::mem::align_of::<_VAEncMiscParameterFrameRate__bindgen_ty_1>(),
        4usize,
        concat!(
            "Alignment of ",
            stringify!(_VAEncMiscParameterFrameRate__bindgen_ty_1)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<_VAEncMiscParameterFrameRate__bindgen_ty_1>())).bits as *const _
                as usize
        },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(_VAEncMiscParameterFrameRate__bindgen_ty_1),
            "::",
            stringify!(bits)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<_VAEncMiscParameterFrameRate__bindgen_ty_1>())).value as *const _
                as usize
        },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(_VAEncMiscParameterFrameRate__bindgen_ty_1),
            "::",
            stringify!(value)
        )
    );
}
#[test]
fn bindgen_test_layout__VAEncMiscParameterFrameRate() {
    assert_eq!(
        ::std::mem::size_of::<_VAEncMiscParameterFrameRate>(),
        24usize,
        concat!("Size of: ", stringify!(_VAEncMiscParameterFrameRate))
    );
    assert_eq!(
        ::std::mem::align_of::<_VAEncMiscParameterFrameRate>(),
        4usize,
        concat!("Alignment of ", stringify!(_VAEncMiscParameterFrameRate))
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<_VAEncMiscParameterFrameRate>())).framerate as *const _ as usize
        },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(_VAEncMiscParameterFrameRate),
            "::",
            stringify!(framerate)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<_VAEncMiscParameterFrameRate>())).framerate_flags as *const _
                as usize
        },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(_VAEncMiscParameterFrameRate),
            "::",
            stringify!(framerate_flags)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<_VAEncMiscParameterFrameRate>())).va_reserved as *const _
                as usize
        },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(_VAEncMiscParameterFrameRate),
            "::",
            stringify!(va_reserved)
        )
    );
}
pub type VAEncMiscParameterFrameRate = _VAEncMiscParameterFrameRate;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct _VAEncMiscParameterMaxSliceSize {
    pub max_slice_size: u32,
    pub va_reserved: [u32; 4usize],
}
#[test]
fn bindgen_test_layout__VAEncMiscParameterMaxSliceSize() {
    assert_eq!(
        ::std::mem::size_of::<_VAEncMiscParameterMaxSliceSize>(),
        20usize,
        concat!("Size of: ", stringify!(_VAEncMiscParameterMaxSliceSize))
    );
    assert_eq!(
        ::std::mem::align_of::<_VAEncMiscParameterMaxSliceSize>(),
        4usize,
        concat!("Alignment of ", stringify!(_VAEncMiscParameterMaxSliceSize))
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<_VAEncMiscParameterMaxSliceSize>())).max_slice_size as *const _
                as usize
        },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(_VAEncMiscParameterMaxSliceSize),
            "::",
            stringify!(max_slice_size)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<_VAEncMiscParameterMaxSliceSize>())).va_reserved as *const _
                as usize
        },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(_VAEncMiscParameterMaxSliceSize),
            "::",
            stringify!(va_reserved)
        )
    );
}
pub type VAEncMiscParameterMaxSliceSize = _VAEncMiscParameterMaxSliceSize;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct _VAEncMiscParameterAIR {
    pub air_num_mbs: u32,
    pub air_threshold: u32,
    pub air_auto: u32,
    pub va_reserved: [u32; 4usize],
}
#[test]
fn bindgen_test_layout__VAEncMiscParameterAIR() {
    assert_eq!(
        ::std::mem::size_of::<_VAEncMiscParameterAIR>(),
        28usize,
        concat!("Size of: ", stringify!(_VAEncMiscParameterAIR))
    );
    assert_eq!(
        ::std::mem::align_of::<_VAEncMiscParameterAIR>(),
        4usize,
        concat!("Alignment of ", stringify!(_VAEncMiscParameterAIR))
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<_VAEncMiscParameterAIR>())).air_num_mbs as *const _ as usize
        },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(_VAEncMiscParameterAIR),
            "::",
            stringify!(air_num_mbs)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<_VAEncMiscParameterAIR>())).air_threshold as *const _ as usize
        },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(_VAEncMiscParameterAIR),
            "::",
            stringify!(air_threshold)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<_VAEncMiscParameterAIR>())).air_auto as *const _ as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(_VAEncMiscParameterAIR),
            "::",
            stringify!(air_auto)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<_VAEncMiscParameterAIR>())).va_reserved as *const _ as usize
        },
        12usize,
        concat!(
            "Offset of field: ",
            stringify!(_VAEncMiscParameterAIR),
            "::",
            stringify!(va_reserved)
        )
    );
}
pub type VAEncMiscParameterAIR = _VAEncMiscParameterAIR;
#[repr(C)]
#[derive(Copy, Clone)]
pub struct _VAEncMiscParameterRIR {
    pub rir_flags: _VAEncMiscParameterRIR__bindgen_ty_1,
    pub intra_insertion_location: u16,
    pub intra_insert_size: u16,
    pub qp_delta_for_inserted_intra: u8,
    pub va_reserved: [u32; 4usize],
}
#[repr(C)]
#[derive(Copy, Clone)]
pub union _VAEncMiscParameterRIR__bindgen_ty_1 {
    pub bits: _VAEncMiscParameterRIR__bindgen_ty_1__bindgen_ty_1,
    pub value: u32,
}
#[repr(C)]
#[repr(align(4))]
#[derive(Debug, Copy, Clone)]
pub struct _VAEncMiscParameterRIR__bindgen_ty_1__bindgen_ty_1 {
    pub _bitfield_align_1: [u32; 0],
    pub _bitfield_1: __BindgenBitfieldUnit<[u8; 4usize]>,
}
#[test]
fn bindgen_test_layout__VAEncMiscParameterRIR__bindgen_ty_1__bindgen_ty_1() {
    assert_eq!(
        ::std::mem::size_of::<_VAEncMiscParameterRIR__bindgen_ty_1__bindgen_ty_1>(),
        4usize,
        concat!(
            "Size of: ",
            stringify!(_VAEncMiscParameterRIR__bindgen_ty_1__bindgen_ty_1)
        )
    );
    assert_eq!(
        ::std::mem::align_of::<_VAEncMiscParameterRIR__bindgen_ty_1__bindgen_ty_1>(),
        4usize,
        concat!(
            "Alignment of ",
            stringify!(_VAEncMiscParameterRIR__bindgen_ty_1__bindgen_ty_1)
        )
    );
}
impl _VAEncMiscParameterRIR__bindgen_ty_1__bindgen_ty_1 {
    #[inline]
    pub fn enable_rir_column(&self) -> u32 {
        unsafe { ::std::mem::transmute(self._bitfield_1.get(0usize, 1u8) as u32) }
    }
    #[inline]
    pub fn set_enable_rir_column(&mut self, val: u32) {
        unsafe {
            let val: u32 = ::std::mem::transmute(val);
            self._bitfield_1.set(0usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub fn enable_rir_row(&self) -> u32 {
        unsafe { ::std::mem::transmute(self._bitfield_1.get(1usize, 1u8) as u32) }
    }
    #[inline]
    pub fn set_enable_rir_row(&mut self, val: u32) {
        unsafe {
            let val: u32 = ::std::mem::transmute(val);
            self._bitfield_1.set(1usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub fn reserved(&self) -> u32 {
        unsafe { ::std::mem::transmute(self._bitfield_1.get(2usize, 30u8) as u32) }
    }
    #[inline]
    pub fn set_reserved(&mut self, val: u32) {
        unsafe {
            let val: u32 = ::std::mem::transmute(val);
            self._bitfield_1.set(2usize, 30u8, val as u64)
        }
    }
    #[inline]
    pub fn new_bitfield_1(
        enable_rir_column: u32,
        enable_rir_row: u32,
        reserved: u32,
    ) -> __BindgenBitfieldUnit<[u8; 4usize]> {
        let mut __bindgen_bitfield_unit: __BindgenBitfieldUnit<[u8; 4usize]> = Default::default();
        __bindgen_bitfield_unit.set(0usize, 1u8, {
            let enable_rir_column: u32 = unsafe { ::std::mem::transmute(enable_rir_column) };
            enable_rir_column as u64
        });
        __bindgen_bitfield_unit.set(1usize, 1u8, {
            let enable_rir_row: u32 = unsafe { ::std::mem::transmute(enable_rir_row) };
            enable_rir_row as u64
        });
        __bindgen_bitfield_unit.set(2usize, 30u8, {
            let reserved: u32 = unsafe { ::std::mem::transmute(reserved) };
            reserved as u64
        });
        __bindgen_bitfield_unit
    }
}
#[test]
fn bindgen_test_layout__VAEncMiscParameterRIR__bindgen_ty_1() {
    assert_eq!(
        ::std::mem::size_of::<_VAEncMiscParameterRIR__bindgen_ty_1>(),
        4usize,
        concat!(
            "Size of: ",
            stringify!(_VAEncMiscParameterRIR__bindgen_ty_1)
        )
    );
    assert_eq!(
        ::std::mem::align_of::<_VAEncMiscParameterRIR__bindgen_ty_1>(),
        4usize,
        concat!(
            "Alignment of ",
            stringify!(_VAEncMiscParameterRIR__bindgen_ty_1)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<_VAEncMiscParameterRIR__bindgen_ty_1>())).bits as *const _
                as usize
        },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(_VAEncMiscParameterRIR__bindgen_ty_1),
            "::",
            stringify!(bits)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<_VAEncMiscParameterRIR__bindgen_ty_1>())).value as *const _
                as usize
        },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(_VAEncMiscParameterRIR__bindgen_ty_1),
            "::",
            stringify!(value)
        )
    );
}
#[test]
fn bindgen_test_layout__VAEncMiscParameterRIR() {
    assert_eq!(
        ::std::mem::size_of::<_VAEncMiscParameterRIR>(),
        28usize,
        concat!("Size of: ", stringify!(_VAEncMiscParameterRIR))
    );
    assert_eq!(
        ::std::mem::align_of::<_VAEncMiscParameterRIR>(),
        4usize,
        concat!("Alignment of ", stringify!(_VAEncMiscParameterRIR))
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<_VAEncMiscParameterRIR>())).rir_flags as *const _ as usize
        },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(_VAEncMiscParameterRIR),
            "::",
            stringify!(rir_flags)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<_VAEncMiscParameterRIR>())).intra_insertion_location as *const _
                as usize
        },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(_VAEncMiscParameterRIR),
            "::",
            stringify!(intra_insertion_location)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<_VAEncMiscParameterRIR>())).intra_insert_size as *const _
                as usize
        },
        6usize,
        concat!(
            "Offset of field: ",
            stringify!(_VAEncMiscParameterRIR),
            "::",
            stringify!(intra_insert_size)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<_VAEncMiscParameterRIR>())).qp_delta_for_inserted_intra
                as *const _ as usize
        },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(_VAEncMiscParameterRIR),
            "::",
            stringify!(qp_delta_for_inserted_intra)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<_VAEncMiscParameterRIR>())).va_reserved as *const _ as usize
        },
        12usize,
        concat!(
            "Offset of field: ",
            stringify!(_VAEncMiscParameterRIR),
            "::",
            stringify!(va_reserved)
        )
    );
}
pub type VAEncMiscParameterRIR = _VAEncMiscParameterRIR;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct _VAEncMiscParameterHRD {
    pub initial_buffer_fullness: u32,
    pub buffer_size: u32,
    pub va_reserved: [u32; 4usize],
}
#[test]
fn bindgen_test_layout__VAEncMiscParameterHRD() {
    assert_eq!(
        ::std::mem::size_of::<_VAEncMiscParameterHRD>(),
        24usize,
        concat!("Size of: ", stringify!(_VAEncMiscParameterHRD))
    );
    assert_eq!(
        ::std::mem::align_of::<_VAEncMiscParameterHRD>(),
        4usize,
        concat!("Alignment of ", stringify!(_VAEncMiscParameterHRD))
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<_VAEncMiscParameterHRD>())).initial_buffer_fullness as *const _
                as usize
        },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(_VAEncMiscParameterHRD),
            "::",
            stringify!(initial_buffer_fullness)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<_VAEncMiscParameterHRD>())).buffer_size as *const _ as usize
        },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(_VAEncMiscParameterHRD),
            "::",
            stringify!(buffer_size)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<_VAEncMiscParameterHRD>())).va_reserved as *const _ as usize
        },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(_VAEncMiscParameterHRD),
            "::",
            stringify!(va_reserved)
        )
    );
}
pub type VAEncMiscParameterHRD = _VAEncMiscParameterHRD;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct _VAEncMiscParameterBufferMaxFrameSize {
    pub type_: VAEncMiscParameterType,
    pub max_frame_size: u32,
    pub va_reserved: [u32; 4usize],
}
#[test]
fn bindgen_test_layout__VAEncMiscParameterBufferMaxFrameSize() {
    assert_eq!(
        ::std::mem::size_of::<_VAEncMiscParameterBufferMaxFrameSize>(),
        24usize,
        concat!(
            "Size of: ",
            stringify!(_VAEncMiscParameterBufferMaxFrameSize)
        )
    );
    assert_eq!(
        ::std::mem::align_of::<_VAEncMiscParameterBufferMaxFrameSize>(),
        4usize,
        concat!(
            "Alignment of ",
            stringify!(_VAEncMiscParameterBufferMaxFrameSize)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<_VAEncMiscParameterBufferMaxFrameSize>())).type_ as *const _
                as usize
        },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(_VAEncMiscParameterBufferMaxFrameSize),
            "::",
            stringify!(type_)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<_VAEncMiscParameterBufferMaxFrameSize>())).max_frame_size
                as *const _ as usize
        },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(_VAEncMiscParameterBufferMaxFrameSize),
            "::",
            stringify!(max_frame_size)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<_VAEncMiscParameterBufferMaxFrameSize>())).va_reserved
                as *const _ as usize
        },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(_VAEncMiscParameterBufferMaxFrameSize),
            "::",
            stringify!(va_reserved)
        )
    );
}
pub type VAEncMiscParameterBufferMaxFrameSize = _VAEncMiscParameterBufferMaxFrameSize;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct _VAEncMiscParameterBufferMultiPassFrameSize {
    pub type_: VAEncMiscParameterType,
    pub max_frame_size: u32,
    pub reserved: u32,
    pub num_passes: u8,
    pub delta_qp: *mut u8,
    pub va_reserved: [::std::os::raw::c_ulong; 4usize],
}
#[test]
fn bindgen_test_layout__VAEncMiscParameterBufferMultiPassFrameSize() {
    assert_eq!(
        ::std::mem::size_of::<_VAEncMiscParameterBufferMultiPassFrameSize>(),
        56usize,
        concat!(
            "Size of: ",
            stringify!(_VAEncMiscParameterBufferMultiPassFrameSize)
        )
    );
    assert_eq!(
        ::std::mem::align_of::<_VAEncMiscParameterBufferMultiPassFrameSize>(),
        8usize,
        concat!(
            "Alignment of ",
            stringify!(_VAEncMiscParameterBufferMultiPassFrameSize)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<_VAEncMiscParameterBufferMultiPassFrameSize>())).type_
                as *const _ as usize
        },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(_VAEncMiscParameterBufferMultiPassFrameSize),
            "::",
            stringify!(type_)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<_VAEncMiscParameterBufferMultiPassFrameSize>())).max_frame_size
                as *const _ as usize
        },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(_VAEncMiscParameterBufferMultiPassFrameSize),
            "::",
            stringify!(max_frame_size)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<_VAEncMiscParameterBufferMultiPassFrameSize>())).reserved
                as *const _ as usize
        },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(_VAEncMiscParameterBufferMultiPassFrameSize),
            "::",
            stringify!(reserved)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<_VAEncMiscParameterBufferMultiPassFrameSize>())).num_passes
                as *const _ as usize
        },
        12usize,
        concat!(
            "Offset of field: ",
            stringify!(_VAEncMiscParameterBufferMultiPassFrameSize),
            "::",
            stringify!(num_passes)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<_VAEncMiscParameterBufferMultiPassFrameSize>())).delta_qp
                as *const _ as usize
        },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(_VAEncMiscParameterBufferMultiPassFrameSize),
            "::",
            stringify!(delta_qp)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<_VAEncMiscParameterBufferMultiPassFrameSize>())).va_reserved
                as *const _ as usize
        },
        24usize,
        concat!(
            "Offset of field: ",
            stringify!(_VAEncMiscParameterBufferMultiPassFrameSize),
            "::",
            stringify!(va_reserved)
        )
    );
}
pub type VAEncMiscParameterBufferMultiPassFrameSize = _VAEncMiscParameterBufferMultiPassFrameSize;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct _VAEncMiscParameterBufferQualityLevel {
    pub quality_level: u32,
    pub va_reserved: [u32; 4usize],
}
#[test]
fn bindgen_test_layout__VAEncMiscParameterBufferQualityLevel() {
    assert_eq!(
        ::std::mem::size_of::<_VAEncMiscParameterBufferQualityLevel>(),
        20usize,
        concat!(
            "Size of: ",
            stringify!(_VAEncMiscParameterBufferQualityLevel)
        )
    );
    assert_eq!(
        ::std::mem::align_of::<_VAEncMiscParameterBufferQualityLevel>(),
        4usize,
        concat!(
            "Alignment of ",
            stringify!(_VAEncMiscParameterBufferQualityLevel)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<_VAEncMiscParameterBufferQualityLevel>())).quality_level
                as *const _ as usize
        },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(_VAEncMiscParameterBufferQualityLevel),
            "::",
            stringify!(quality_level)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<_VAEncMiscParameterBufferQualityLevel>())).va_reserved
                as *const _ as usize
        },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(_VAEncMiscParameterBufferQualityLevel),
            "::",
            stringify!(va_reserved)
        )
    );
}
pub type VAEncMiscParameterBufferQualityLevel = _VAEncMiscParameterBufferQualityLevel;
#[repr(C)]
#[derive(Copy, Clone)]
pub struct _VAEncMiscParameterQuantization {
    pub quantization_flags: _VAEncMiscParameterQuantization__bindgen_ty_1,
    pub va_reserved: u32,
}
#[repr(C)]
#[derive(Copy, Clone)]
pub union _VAEncMiscParameterQuantization__bindgen_ty_1 {
    pub bits: _VAEncMiscParameterQuantization__bindgen_ty_1__bindgen_ty_1,
    pub value: u32,
}
#[repr(C)]
#[repr(align(4))]
#[derive(Debug, Copy, Clone)]
pub struct _VAEncMiscParameterQuantization__bindgen_ty_1__bindgen_ty_1 {
    pub _bitfield_align_1: [u32; 0],
    pub _bitfield_1: __BindgenBitfieldUnit<[u8; 4usize]>,
}
#[test]
fn bindgen_test_layout__VAEncMiscParameterQuantization__bindgen_ty_1__bindgen_ty_1() {
    assert_eq!(
        ::std::mem::size_of::<_VAEncMiscParameterQuantization__bindgen_ty_1__bindgen_ty_1>(),
        4usize,
        concat!(
            "Size of: ",
            stringify!(_VAEncMiscParameterQuantization__bindgen_ty_1__bindgen_ty_1)
        )
    );
    assert_eq!(
        ::std::mem::align_of::<_VAEncMiscParameterQuantization__bindgen_ty_1__bindgen_ty_1>(),
        4usize,
        concat!(
            "Alignment of ",
            stringify!(_VAEncMiscParameterQuantization__bindgen_ty_1__bindgen_ty_1)
        )
    );
}
impl _VAEncMiscParameterQuantization__bindgen_ty_1__bindgen_ty_1 {
    #[inline]
    pub fn disable_trellis(&self) -> u32 {
        unsafe { ::std::mem::transmute(self._bitfield_1.get(0usize, 1u8) as u32) }
    }
    #[inline]
    pub fn set_disable_trellis(&mut self, val: u32) {
        unsafe {
            let val: u32 = ::std::mem::transmute(val);
            self._bitfield_1.set(0usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub fn enable_trellis_I(&self) -> u32 {
        unsafe { ::std::mem::transmute(self._bitfield_1.get(1usize, 1u8) as u32) }
    }
    #[inline]
    pub fn set_enable_trellis_I(&mut self, val: u32) {
        unsafe {
            let val: u32 = ::std::mem::transmute(val);
            self._bitfield_1.set(1usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub fn enable_trellis_P(&self) -> u32 {
        unsafe { ::std::mem::transmute(self._bitfield_1.get(2usize, 1u8) as u32) }
    }
    #[inline]
    pub fn set_enable_trellis_P(&mut self, val: u32) {
        unsafe {
            let val: u32 = ::std::mem::transmute(val);
            self._bitfield_1.set(2usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub fn enable_trellis_B(&self) -> u32 {
        unsafe { ::std::mem::transmute(self._bitfield_1.get(3usize, 1u8) as u32) }
    }
    #[inline]
    pub fn set_enable_trellis_B(&mut self, val: u32) {
        unsafe {
            let val: u32 = ::std::mem::transmute(val);
            self._bitfield_1.set(3usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub fn reserved(&self) -> u32 {
        unsafe { ::std::mem::transmute(self._bitfield_1.get(4usize, 28u8) as u32) }
    }
    #[inline]
    pub fn set_reserved(&mut self, val: u32) {
        unsafe {
            let val: u32 = ::std::mem::transmute(val);
            self._bitfield_1.set(4usize, 28u8, val as u64)
        }
    }
    #[inline]
    pub fn new_bitfield_1(
        disable_trellis: u32,
        enable_trellis_I: u32,
        enable_trellis_P: u32,
        enable_trellis_B: u32,
        reserved: u32,
    ) -> __BindgenBitfieldUnit<[u8; 4usize]> {
        let mut __bindgen_bitfield_unit: __BindgenBitfieldUnit<[u8; 4usize]> = Default::default();
        __bindgen_bitfield_unit.set(0usize, 1u8, {
            let disable_trellis: u32 = unsafe { ::std::mem::transmute(disable_trellis) };
            disable_trellis as u64
        });
        __bindgen_bitfield_unit.set(1usize, 1u8, {
            let enable_trellis_I: u32 = unsafe { ::std::mem::transmute(enable_trellis_I) };
            enable_trellis_I as u64
        });
        __bindgen_bitfield_unit.set(2usize, 1u8, {
            let enable_trellis_P: u32 = unsafe { ::std::mem::transmute(enable_trellis_P) };
            enable_trellis_P as u64
        });
        __bindgen_bitfield_unit.set(3usize, 1u8, {
            let enable_trellis_B: u32 = unsafe { ::std::mem::transmute(enable_trellis_B) };
            enable_trellis_B as u64
        });
        __bindgen_bitfield_unit.set(4usize, 28u8, {
            let reserved: u32 = unsafe { ::std::mem::transmute(reserved) };
            reserved as u64
        });
        __bindgen_bitfield_unit
    }
}
#[test]
fn bindgen_test_layout__VAEncMiscParameterQuantization__bindgen_ty_1() {
    assert_eq!(
        ::std::mem::size_of::<_VAEncMiscParameterQuantization__bindgen_ty_1>(),
        4usize,
        concat!(
            "Size of: ",
            stringify!(_VAEncMiscParameterQuantization__bindgen_ty_1)
        )
    );
    assert_eq!(
        ::std::mem::align_of::<_VAEncMiscParameterQuantization__bindgen_ty_1>(),
        4usize,
        concat!(
            "Alignment of ",
            stringify!(_VAEncMiscParameterQuantization__bindgen_ty_1)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<_VAEncMiscParameterQuantization__bindgen_ty_1>())).bits
                as *const _ as usize
        },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(_VAEncMiscParameterQuantization__bindgen_ty_1),
            "::",
            stringify!(bits)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<_VAEncMiscParameterQuantization__bindgen_ty_1>())).value
                as *const _ as usize
        },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(_VAEncMiscParameterQuantization__bindgen_ty_1),
            "::",
            stringify!(value)
        )
    );
}
#[test]
fn bindgen_test_layout__VAEncMiscParameterQuantization() {
    assert_eq!(
        ::std::mem::size_of::<_VAEncMiscParameterQuantization>(),
        8usize,
        concat!("Size of: ", stringify!(_VAEncMiscParameterQuantization))
    );
    assert_eq!(
        ::std::mem::align_of::<_VAEncMiscParameterQuantization>(),
        4usize,
        concat!("Alignment of ", stringify!(_VAEncMiscParameterQuantization))
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<_VAEncMiscParameterQuantization>())).quantization_flags
                as *const _ as usize
        },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(_VAEncMiscParameterQuantization),
            "::",
            stringify!(quantization_flags)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<_VAEncMiscParameterQuantization>())).va_reserved as *const _
                as usize
        },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(_VAEncMiscParameterQuantization),
            "::",
            stringify!(va_reserved)
        )
    );
}
pub type VAEncMiscParameterQuantization = _VAEncMiscParameterQuantization;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct _VAEncMiscParameterSkipFrame {
    pub skip_frame_flag: u8,
    pub num_skip_frames: u8,
    pub size_skip_frames: u32,
    pub va_reserved: [u32; 4usize],
}
#[test]
fn bindgen_test_layout__VAEncMiscParameterSkipFrame() {
    assert_eq!(
        ::std::mem::size_of::<_VAEncMiscParameterSkipFrame>(),
        24usize,
        concat!("Size of: ", stringify!(_VAEncMiscParameterSkipFrame))
    );
    assert_eq!(
        ::std::mem::align_of::<_VAEncMiscParameterSkipFrame>(),
        4usize,
        concat!("Alignment of ", stringify!(_VAEncMiscParameterSkipFrame))
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<_VAEncMiscParameterSkipFrame>())).skip_frame_flag as *const _
                as usize
        },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(_VAEncMiscParameterSkipFrame),
            "::",
            stringify!(skip_frame_flag)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<_VAEncMiscParameterSkipFrame>())).num_skip_frames as *const _
                as usize
        },
        1usize,
        concat!(
            "Offset of field: ",
            stringify!(_VAEncMiscParameterSkipFrame),
            "::",
            stringify!(num_skip_frames)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<_VAEncMiscParameterSkipFrame>())).size_skip_frames as *const _
                as usize
        },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(_VAEncMiscParameterSkipFrame),
            "::",
            stringify!(size_skip_frames)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<_VAEncMiscParameterSkipFrame>())).va_reserved as *const _
                as usize
        },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(_VAEncMiscParameterSkipFrame),
            "::",
            stringify!(va_reserved)
        )
    );
}
pub type VAEncMiscParameterSkipFrame = _VAEncMiscParameterSkipFrame;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct _VAEncROI {
    pub roi_rectangle: VARectangle,
    pub roi_value: i8,
}
#[test]
fn bindgen_test_layout__VAEncROI() {
    assert_eq!(
        ::std::mem::size_of::<_VAEncROI>(),
        10usize,
        concat!("Size of: ", stringify!(_VAEncROI))
    );
    assert_eq!(
        ::std::mem::align_of::<_VAEncROI>(),
        2usize,
        concat!("Alignment of ", stringify!(_VAEncROI))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<_VAEncROI>())).roi_rectangle as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(_VAEncROI),
            "::",
            stringify!(roi_rectangle)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<_VAEncROI>())).roi_value as *const _ as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(_VAEncROI),
            "::",
            stringify!(roi_value)
        )
    );
}
pub type VAEncROI = _VAEncROI;
#[repr(C)]
#[derive(Copy, Clone)]
pub struct _VAEncMiscParameterBufferROI {
    pub num_roi: u32,
    pub max_delta_qp: i8,
    pub min_delta_qp: i8,
    pub roi: *mut VAEncROI,
    pub roi_flags: _VAEncMiscParameterBufferROI__bindgen_ty_1,
    pub va_reserved: [u32; 4usize],
}
#[repr(C)]
#[derive(Copy, Clone)]
pub union _VAEncMiscParameterBufferROI__bindgen_ty_1 {
    pub bits: _VAEncMiscParameterBufferROI__bindgen_ty_1__bindgen_ty_1,
    pub value: u32,
}
#[repr(C)]
#[repr(align(4))]
#[derive(Debug, Copy, Clone)]
pub struct _VAEncMiscParameterBufferROI__bindgen_ty_1__bindgen_ty_1 {
    pub _bitfield_align_1: [u32; 0],
    pub _bitfield_1: __BindgenBitfieldUnit<[u8; 4usize]>,
}
#[test]
fn bindgen_test_layout__VAEncMiscParameterBufferROI__bindgen_ty_1__bindgen_ty_1() {
    assert_eq!(
        ::std::mem::size_of::<_VAEncMiscParameterBufferROI__bindgen_ty_1__bindgen_ty_1>(),
        4usize,
        concat!(
            "Size of: ",
            stringify!(_VAEncMiscParameterBufferROI__bindgen_ty_1__bindgen_ty_1)
        )
    );
    assert_eq!(
        ::std::mem::align_of::<_VAEncMiscParameterBufferROI__bindgen_ty_1__bindgen_ty_1>(),
        4usize,
        concat!(
            "Alignment of ",
            stringify!(_VAEncMiscParameterBufferROI__bindgen_ty_1__bindgen_ty_1)
        )
    );
}
impl _VAEncMiscParameterBufferROI__bindgen_ty_1__bindgen_ty_1 {
    #[inline]
    pub fn roi_value_is_qp_delta(&self) -> u32 {
        unsafe { ::std::mem::transmute(self._bitfield_1.get(0usize, 1u8) as u32) }
    }
    #[inline]
    pub fn set_roi_value_is_qp_delta(&mut self, val: u32) {
        unsafe {
            let val: u32 = ::std::mem::transmute(val);
            self._bitfield_1.set(0usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub fn reserved(&self) -> u32 {
        unsafe { ::std::mem::transmute(self._bitfield_1.get(1usize, 31u8) as u32) }
    }
    #[inline]
    pub fn set_reserved(&mut self, val: u32) {
        unsafe {
            let val: u32 = ::std::mem::transmute(val);
            self._bitfield_1.set(1usize, 31u8, val as u64)
        }
    }
    #[inline]
    pub fn new_bitfield_1(
        roi_value_is_qp_delta: u32,
        reserved: u32,
    ) -> __BindgenBitfieldUnit<[u8; 4usize]> {
        let mut __bindgen_bitfield_unit: __BindgenBitfieldUnit<[u8; 4usize]> = Default::default();
        __bindgen_bitfield_unit.set(0usize, 1u8, {
            let roi_value_is_qp_delta: u32 =
                unsafe { ::std::mem::transmute(roi_value_is_qp_delta) };
            roi_value_is_qp_delta as u64
        });
        __bindgen_bitfield_unit.set(1usize, 31u8, {
            let reserved: u32 = unsafe { ::std::mem::transmute(reserved) };
            reserved as u64
        });
        __bindgen_bitfield_unit
    }
}
#[test]
fn bindgen_test_layout__VAEncMiscParameterBufferROI__bindgen_ty_1() {
    assert_eq!(
        ::std::mem::size_of::<_VAEncMiscParameterBufferROI__bindgen_ty_1>(),
        4usize,
        concat!(
            "Size of: ",
            stringify!(_VAEncMiscParameterBufferROI__bindgen_ty_1)
        )
    );
    assert_eq!(
        ::std::mem::align_of::<_VAEncMiscParameterBufferROI__bindgen_ty_1>(),
        4usize,
        concat!(
            "Alignment of ",
            stringify!(_VAEncMiscParameterBufferROI__bindgen_ty_1)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<_VAEncMiscParameterBufferROI__bindgen_ty_1>())).bits as *const _
                as usize
        },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(_VAEncMiscParameterBufferROI__bindgen_ty_1),
            "::",
            stringify!(bits)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<_VAEncMiscParameterBufferROI__bindgen_ty_1>())).value as *const _
                as usize
        },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(_VAEncMiscParameterBufferROI__bindgen_ty_1),
            "::",
            stringify!(value)
        )
    );
}
#[test]
fn bindgen_test_layout__VAEncMiscParameterBufferROI() {
    assert_eq!(
        ::std::mem::size_of::<_VAEncMiscParameterBufferROI>(),
        40usize,
        concat!("Size of: ", stringify!(_VAEncMiscParameterBufferROI))
    );
    assert_eq!(
        ::std::mem::align_of::<_VAEncMiscParameterBufferROI>(),
        8usize,
        concat!("Alignment of ", stringify!(_VAEncMiscParameterBufferROI))
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<_VAEncMiscParameterBufferROI>())).num_roi as *const _ as usize
        },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(_VAEncMiscParameterBufferROI),
            "::",
            stringify!(num_roi)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<_VAEncMiscParameterBufferROI>())).max_delta_qp as *const _
                as usize
        },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(_VAEncMiscParameterBufferROI),
            "::",
            stringify!(max_delta_qp)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<_VAEncMiscParameterBufferROI>())).min_delta_qp as *const _
                as usize
        },
        5usize,
        concat!(
            "Offset of field: ",
            stringify!(_VAEncMiscParameterBufferROI),
            "::",
            stringify!(min_delta_qp)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<_VAEncMiscParameterBufferROI>())).roi as *const _ as usize
        },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(_VAEncMiscParameterBufferROI),
            "::",
            stringify!(roi)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<_VAEncMiscParameterBufferROI>())).roi_flags as *const _ as usize
        },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(_VAEncMiscParameterBufferROI),
            "::",
            stringify!(roi_flags)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<_VAEncMiscParameterBufferROI>())).va_reserved as *const _
                as usize
        },
        20usize,
        concat!(
            "Offset of field: ",
            stringify!(_VAEncMiscParameterBufferROI),
            "::",
            stringify!(va_reserved)
        )
    );
}
pub type VAEncMiscParameterBufferROI = _VAEncMiscParameterBufferROI;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct _VAEncMiscParameterBufferDirtyRect {
    pub num_roi_rectangle: u32,
    pub roi_rectangle: *mut VARectangle,
}
#[test]
fn bindgen_test_layout__VAEncMiscParameterBufferDirtyRect() {
    assert_eq!(
        ::std::mem::size_of::<_VAEncMiscParameterBufferDirtyRect>(),
        16usize,
        concat!("Size of: ", stringify!(_VAEncMiscParameterBufferDirtyRect))
    );
    assert_eq!(
        ::std::mem::align_of::<_VAEncMiscParameterBufferDirtyRect>(),
        8usize,
        concat!(
            "Alignment of ",
            stringify!(_VAEncMiscParameterBufferDirtyRect)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<_VAEncMiscParameterBufferDirtyRect>())).num_roi_rectangle
                as *const _ as usize
        },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(_VAEncMiscParameterBufferDirtyRect),
            "::",
            stringify!(num_roi_rectangle)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<_VAEncMiscParameterBufferDirtyRect>())).roi_rectangle as *const _
                as usize
        },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(_VAEncMiscParameterBufferDirtyRect),
            "::",
            stringify!(roi_rectangle)
        )
    );
}
pub type VAEncMiscParameterBufferDirtyRect = _VAEncMiscParameterBufferDirtyRect;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct _VAEncMiscParameterParallelRateControl {
    pub num_layers: u32,
    pub num_b_in_gop: *mut u32,
}
#[test]
fn bindgen_test_layout__VAEncMiscParameterParallelRateControl() {
    assert_eq!(
        ::std::mem::size_of::<_VAEncMiscParameterParallelRateControl>(),
        16usize,
        concat!(
            "Size of: ",
            stringify!(_VAEncMiscParameterParallelRateControl)
        )
    );
    assert_eq!(
        ::std::mem::align_of::<_VAEncMiscParameterParallelRateControl>(),
        8usize,
        concat!(
            "Alignment of ",
            stringify!(_VAEncMiscParameterParallelRateControl)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<_VAEncMiscParameterParallelRateControl>())).num_layers
                as *const _ as usize
        },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(_VAEncMiscParameterParallelRateControl),
            "::",
            stringify!(num_layers)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<_VAEncMiscParameterParallelRateControl>())).num_b_in_gop
                as *const _ as usize
        },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(_VAEncMiscParameterParallelRateControl),
            "::",
            stringify!(num_b_in_gop)
        )
    );
}
pub type VAEncMiscParameterParallelRateControl = _VAEncMiscParameterParallelRateControl;
#[repr(C)]
#[derive(Copy, Clone)]
pub struct _VAEncMiscParameterEncQuality {
    pub __bindgen_anon_1: _VAEncMiscParameterEncQuality__bindgen_ty_1,
    pub FTQSkipThresholdLUT: [u8; 52usize],
    pub NonFTQSkipThresholdLUT: [u16; 52usize],
    pub reserved: [u32; 16usize],
}
#[repr(C)]
#[derive(Copy, Clone)]
pub union _VAEncMiscParameterEncQuality__bindgen_ty_1 {
    pub __bindgen_anon_1: _VAEncMiscParameterEncQuality__bindgen_ty_1__bindgen_ty_1,
    pub encControls: u32,
}
#[repr(C)]
#[repr(align(4))]
#[derive(Debug, Copy, Clone)]
pub struct _VAEncMiscParameterEncQuality__bindgen_ty_1__bindgen_ty_1 {
    pub _bitfield_align_1: [u8; 0],
    pub _bitfield_1: __BindgenBitfieldUnit<[u8; 3usize]>,
    pub __bindgen_padding_0: u8,
}
#[test]
fn bindgen_test_layout__VAEncMiscParameterEncQuality__bindgen_ty_1__bindgen_ty_1() {
    assert_eq!(
        ::std::mem::size_of::<_VAEncMiscParameterEncQuality__bindgen_ty_1__bindgen_ty_1>(),
        4usize,
        concat!(
            "Size of: ",
            stringify!(_VAEncMiscParameterEncQuality__bindgen_ty_1__bindgen_ty_1)
        )
    );
    assert_eq!(
        ::std::mem::align_of::<_VAEncMiscParameterEncQuality__bindgen_ty_1__bindgen_ty_1>(),
        4usize,
        concat!(
            "Alignment of ",
            stringify!(_VAEncMiscParameterEncQuality__bindgen_ty_1__bindgen_ty_1)
        )
    );
}
impl _VAEncMiscParameterEncQuality__bindgen_ty_1__bindgen_ty_1 {
    #[inline]
    pub fn useRawPicForRef(&self) -> u32 {
        unsafe { ::std::mem::transmute(self._bitfield_1.get(0usize, 1u8) as u32) }
    }
    #[inline]
    pub fn set_useRawPicForRef(&mut self, val: u32) {
        unsafe {
            let val: u32 = ::std::mem::transmute(val);
            self._bitfield_1.set(0usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub fn skipCheckDisable(&self) -> u32 {
        unsafe { ::std::mem::transmute(self._bitfield_1.get(1usize, 1u8) as u32) }
    }
    #[inline]
    pub fn set_skipCheckDisable(&mut self, val: u32) {
        unsafe {
            let val: u32 = ::std::mem::transmute(val);
            self._bitfield_1.set(1usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub fn FTQOverride(&self) -> u32 {
        unsafe { ::std::mem::transmute(self._bitfield_1.get(2usize, 1u8) as u32) }
    }
    #[inline]
    pub fn set_FTQOverride(&mut self, val: u32) {
        unsafe {
            let val: u32 = ::std::mem::transmute(val);
            self._bitfield_1.set(2usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub fn FTQEnable(&self) -> u32 {
        unsafe { ::std::mem::transmute(self._bitfield_1.get(3usize, 1u8) as u32) }
    }
    #[inline]
    pub fn set_FTQEnable(&mut self, val: u32) {
        unsafe {
            let val: u32 = ::std::mem::transmute(val);
            self._bitfield_1.set(3usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub fn FTQSkipThresholdLUTInput(&self) -> u32 {
        unsafe { ::std::mem::transmute(self._bitfield_1.get(4usize, 1u8) as u32) }
    }
    #[inline]
    pub fn set_FTQSkipThresholdLUTInput(&mut self, val: u32) {
        unsafe {
            let val: u32 = ::std::mem::transmute(val);
            self._bitfield_1.set(4usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub fn NonFTQSkipThresholdLUTInput(&self) -> u32 {
        unsafe { ::std::mem::transmute(self._bitfield_1.get(5usize, 1u8) as u32) }
    }
    #[inline]
    pub fn set_NonFTQSkipThresholdLUTInput(&mut self, val: u32) {
        unsafe {
            let val: u32 = ::std::mem::transmute(val);
            self._bitfield_1.set(5usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub fn ReservedBit(&self) -> u32 {
        unsafe { ::std::mem::transmute(self._bitfield_1.get(6usize, 1u8) as u32) }
    }
    #[inline]
    pub fn set_ReservedBit(&mut self, val: u32) {
        unsafe {
            let val: u32 = ::std::mem::transmute(val);
            self._bitfield_1.set(6usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub fn directBiasAdjustmentEnable(&self) -> u32 {
        unsafe { ::std::mem::transmute(self._bitfield_1.get(7usize, 1u8) as u32) }
    }
    #[inline]
    pub fn set_directBiasAdjustmentEnable(&mut self, val: u32) {
        unsafe {
            let val: u32 = ::std::mem::transmute(val);
            self._bitfield_1.set(7usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub fn globalMotionBiasAdjustmentEnable(&self) -> u32 {
        unsafe { ::std::mem::transmute(self._bitfield_1.get(8usize, 1u8) as u32) }
    }
    #[inline]
    pub fn set_globalMotionBiasAdjustmentEnable(&mut self, val: u32) {
        unsafe {
            let val: u32 = ::std::mem::transmute(val);
            self._bitfield_1.set(8usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub fn HMEMVCostScalingFactor(&self) -> u32 {
        unsafe { ::std::mem::transmute(self._bitfield_1.get(9usize, 2u8) as u32) }
    }
    #[inline]
    pub fn set_HMEMVCostScalingFactor(&mut self, val: u32) {
        unsafe {
            let val: u32 = ::std::mem::transmute(val);
            self._bitfield_1.set(9usize, 2u8, val as u64)
        }
    }
    #[inline]
    pub fn HMEDisable(&self) -> u32 {
        unsafe { ::std::mem::transmute(self._bitfield_1.get(11usize, 1u8) as u32) }
    }
    #[inline]
    pub fn set_HMEDisable(&mut self, val: u32) {
        unsafe {
            let val: u32 = ::std::mem::transmute(val);
            self._bitfield_1.set(11usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub fn SuperHMEDisable(&self) -> u32 {
        unsafe { ::std::mem::transmute(self._bitfield_1.get(12usize, 1u8) as u32) }
    }
    #[inline]
    pub fn set_SuperHMEDisable(&mut self, val: u32) {
        unsafe {
            let val: u32 = ::std::mem::transmute(val);
            self._bitfield_1.set(12usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub fn UltraHMEDisable(&self) -> u32 {
        unsafe { ::std::mem::transmute(self._bitfield_1.get(13usize, 1u8) as u32) }
    }
    #[inline]
    pub fn set_UltraHMEDisable(&mut self, val: u32) {
        unsafe {
            let val: u32 = ::std::mem::transmute(val);
            self._bitfield_1.set(13usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub fn PanicModeDisable(&self) -> u32 {
        unsafe { ::std::mem::transmute(self._bitfield_1.get(14usize, 1u8) as u32) }
    }
    #[inline]
    pub fn set_PanicModeDisable(&mut self, val: u32) {
        unsafe {
            let val: u32 = ::std::mem::transmute(val);
            self._bitfield_1.set(14usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub fn ForceRepartitionCheck(&self) -> u32 {
        unsafe { ::std::mem::transmute(self._bitfield_1.get(15usize, 2u8) as u32) }
    }
    #[inline]
    pub fn set_ForceRepartitionCheck(&mut self, val: u32) {
        unsafe {
            let val: u32 = ::std::mem::transmute(val);
            self._bitfield_1.set(15usize, 2u8, val as u64)
        }
    }
    #[inline]
    pub fn new_bitfield_1(
        useRawPicForRef: u32,
        skipCheckDisable: u32,
        FTQOverride: u32,
        FTQEnable: u32,
        FTQSkipThresholdLUTInput: u32,
        NonFTQSkipThresholdLUTInput: u32,
        ReservedBit: u32,
        directBiasAdjustmentEnable: u32,
        globalMotionBiasAdjustmentEnable: u32,
        HMEMVCostScalingFactor: u32,
        HMEDisable: u32,
        SuperHMEDisable: u32,
        UltraHMEDisable: u32,
        PanicModeDisable: u32,
        ForceRepartitionCheck: u32,
    ) -> __BindgenBitfieldUnit<[u8; 3usize]> {
        let mut __bindgen_bitfield_unit: __BindgenBitfieldUnit<[u8; 3usize]> = Default::default();
        __bindgen_bitfield_unit.set(0usize, 1u8, {
            let useRawPicForRef: u32 = unsafe { ::std::mem::transmute(useRawPicForRef) };
            useRawPicForRef as u64
        });
        __bindgen_bitfield_unit.set(1usize, 1u8, {
            let skipCheckDisable: u32 = unsafe { ::std::mem::transmute(skipCheckDisable) };
            skipCheckDisable as u64
        });
        __bindgen_bitfield_unit.set(2usize, 1u8, {
            let FTQOverride: u32 = unsafe { ::std::mem::transmute(FTQOverride) };
            FTQOverride as u64
        });
        __bindgen_bitfield_unit.set(3usize, 1u8, {
            let FTQEnable: u32 = unsafe { ::std::mem::transmute(FTQEnable) };
            FTQEnable as u64
        });
        __bindgen_bitfield_unit.set(4usize, 1u8, {
            let FTQSkipThresholdLUTInput: u32 =
                unsafe { ::std::mem::transmute(FTQSkipThresholdLUTInput) };
            FTQSkipThresholdLUTInput as u64
        });
        __bindgen_bitfield_unit.set(5usize, 1u8, {
            let NonFTQSkipThresholdLUTInput: u32 =
                unsafe { ::std::mem::transmute(NonFTQSkipThresholdLUTInput) };
            NonFTQSkipThresholdLUTInput as u64
        });
        __bindgen_bitfield_unit.set(6usize, 1u8, {
            let ReservedBit: u32 = unsafe { ::std::mem::transmute(ReservedBit) };
            ReservedBit as u64
        });
        __bindgen_bitfield_unit.set(7usize, 1u8, {
            let directBiasAdjustmentEnable: u32 =
                unsafe { ::std::mem::transmute(directBiasAdjustmentEnable) };
            directBiasAdjustmentEnable as u64
        });
        __bindgen_bitfield_unit.set(8usize, 1u8, {
            let globalMotionBiasAdjustmentEnable: u32 =
                unsafe { ::std::mem::transmute(globalMotionBiasAdjustmentEnable) };
            globalMotionBiasAdjustmentEnable as u64
        });
        __bindgen_bitfield_unit.set(9usize, 2u8, {
            let HMEMVCostScalingFactor: u32 =
                unsafe { ::std::mem::transmute(HMEMVCostScalingFactor) };
            HMEMVCostScalingFactor as u64
        });
        __bindgen_bitfield_unit.set(11usize, 1u8, {
            let HMEDisable: u32 = unsafe { ::std::mem::transmute(HMEDisable) };
            HMEDisable as u64
        });
        __bindgen_bitfield_unit.set(12usize, 1u8, {
            let SuperHMEDisable: u32 = unsafe { ::std::mem::transmute(SuperHMEDisable) };
            SuperHMEDisable as u64
        });
        __bindgen_bitfield_unit.set(13usize, 1u8, {
            let UltraHMEDisable: u32 = unsafe { ::std::mem::transmute(UltraHMEDisable) };
            UltraHMEDisable as u64
        });
        __bindgen_bitfield_unit.set(14usize, 1u8, {
            let PanicModeDisable: u32 = unsafe { ::std::mem::transmute(PanicModeDisable) };
            PanicModeDisable as u64
        });
        __bindgen_bitfield_unit.set(15usize, 2u8, {
            let ForceRepartitionCheck: u32 =
                unsafe { ::std::mem::transmute(ForceRepartitionCheck) };
            ForceRepartitionCheck as u64
        });
        __bindgen_bitfield_unit
    }
}
#[test]
fn bindgen_test_layout__VAEncMiscParameterEncQuality__bindgen_ty_1() {
    assert_eq!(
        ::std::mem::size_of::<_VAEncMiscParameterEncQuality__bindgen_ty_1>(),
        4usize,
        concat!(
            "Size of: ",
            stringify!(_VAEncMiscParameterEncQuality__bindgen_ty_1)
        )
    );
    assert_eq!(
        ::std::mem::align_of::<_VAEncMiscParameterEncQuality__bindgen_ty_1>(),
        4usize,
        concat!(
            "Alignment of ",
            stringify!(_VAEncMiscParameterEncQuality__bindgen_ty_1)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<_VAEncMiscParameterEncQuality__bindgen_ty_1>())).encControls
                as *const _ as usize
        },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(_VAEncMiscParameterEncQuality__bindgen_ty_1),
            "::",
            stringify!(encControls)
        )
    );
}
#[test]
fn bindgen_test_layout__VAEncMiscParameterEncQuality() {
    assert_eq!(
        ::std::mem::size_of::<_VAEncMiscParameterEncQuality>(),
        224usize,
        concat!("Size of: ", stringify!(_VAEncMiscParameterEncQuality))
    );
    assert_eq!(
        ::std::mem::align_of::<_VAEncMiscParameterEncQuality>(),
        4usize,
        concat!("Alignment of ", stringify!(_VAEncMiscParameterEncQuality))
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<_VAEncMiscParameterEncQuality>())).FTQSkipThresholdLUT
                as *const _ as usize
        },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(_VAEncMiscParameterEncQuality),
            "::",
            stringify!(FTQSkipThresholdLUT)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<_VAEncMiscParameterEncQuality>())).NonFTQSkipThresholdLUT
                as *const _ as usize
        },
        56usize,
        concat!(
            "Offset of field: ",
            stringify!(_VAEncMiscParameterEncQuality),
            "::",
            stringify!(NonFTQSkipThresholdLUT)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<_VAEncMiscParameterEncQuality>())).reserved as *const _ as usize
        },
        160usize,
        concat!(
            "Offset of field: ",
            stringify!(_VAEncMiscParameterEncQuality),
            "::",
            stringify!(reserved)
        )
    );
}
pub type VAEncMiscParameterEncQuality = _VAEncMiscParameterEncQuality;
#[repr(C)]
#[derive(Copy, Clone)]
pub struct _VAEncMiscParameterCustomRoundingControl {
    pub rounding_offset_setting: _VAEncMiscParameterCustomRoundingControl__bindgen_ty_1,
}
#[repr(C)]
#[derive(Copy, Clone)]
pub union _VAEncMiscParameterCustomRoundingControl__bindgen_ty_1 {
    pub bits: _VAEncMiscParameterCustomRoundingControl__bindgen_ty_1__bindgen_ty_1,
    pub value: u32,
}
#[repr(C)]
#[repr(align(4))]
#[derive(Debug, Copy, Clone)]
pub struct _VAEncMiscParameterCustomRoundingControl__bindgen_ty_1__bindgen_ty_1 {
    pub _bitfield_align_1: [u16; 0],
    pub _bitfield_1: __BindgenBitfieldUnit<[u8; 4usize]>,
}
#[test]
fn bindgen_test_layout__VAEncMiscParameterCustomRoundingControl__bindgen_ty_1__bindgen_ty_1() {
    assert_eq!(
        ::std::mem::size_of::<_VAEncMiscParameterCustomRoundingControl__bindgen_ty_1__bindgen_ty_1>(
        ),
        4usize,
        concat!(
            "Size of: ",
            stringify!(_VAEncMiscParameterCustomRoundingControl__bindgen_ty_1__bindgen_ty_1)
        )
    );
    assert_eq!(
        ::std::mem::align_of::<_VAEncMiscParameterCustomRoundingControl__bindgen_ty_1__bindgen_ty_1>(
        ),
        4usize,
        concat!(
            "Alignment of ",
            stringify!(_VAEncMiscParameterCustomRoundingControl__bindgen_ty_1__bindgen_ty_1)
        )
    );
}
impl _VAEncMiscParameterCustomRoundingControl__bindgen_ty_1__bindgen_ty_1 {
    #[inline]
    pub fn enable_custom_rouding_intra(&self) -> u32 {
        unsafe { ::std::mem::transmute(self._bitfield_1.get(0usize, 1u8) as u32) }
    }
    #[inline]
    pub fn set_enable_custom_rouding_intra(&mut self, val: u32) {
        unsafe {
            let val: u32 = ::std::mem::transmute(val);
            self._bitfield_1.set(0usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub fn rounding_offset_intra(&self) -> u32 {
        unsafe { ::std::mem::transmute(self._bitfield_1.get(1usize, 7u8) as u32) }
    }
    #[inline]
    pub fn set_rounding_offset_intra(&mut self, val: u32) {
        unsafe {
            let val: u32 = ::std::mem::transmute(val);
            self._bitfield_1.set(1usize, 7u8, val as u64)
        }
    }
    #[inline]
    pub fn enable_custom_rounding_inter(&self) -> u32 {
        unsafe { ::std::mem::transmute(self._bitfield_1.get(8usize, 1u8) as u32) }
    }
    #[inline]
    pub fn set_enable_custom_rounding_inter(&mut self, val: u32) {
        unsafe {
            let val: u32 = ::std::mem::transmute(val);
            self._bitfield_1.set(8usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub fn rounding_offset_inter(&self) -> u32 {
        unsafe { ::std::mem::transmute(self._bitfield_1.get(9usize, 7u8) as u32) }
    }
    #[inline]
    pub fn set_rounding_offset_inter(&mut self, val: u32) {
        unsafe {
            let val: u32 = ::std::mem::transmute(val);
            self._bitfield_1.set(9usize, 7u8, val as u64)
        }
    }
    #[inline]
    pub fn reserved(&self) -> u32 {
        unsafe { ::std::mem::transmute(self._bitfield_1.get(16usize, 16u8) as u32) }
    }
    #[inline]
    pub fn set_reserved(&mut self, val: u32) {
        unsafe {
            let val: u32 = ::std::mem::transmute(val);
            self._bitfield_1.set(16usize, 16u8, val as u64)
        }
    }
    #[inline]
    pub fn new_bitfield_1(
        enable_custom_rouding_intra: u32,
        rounding_offset_intra: u32,
        enable_custom_rounding_inter: u32,
        rounding_offset_inter: u32,
        reserved: u32,
    ) -> __BindgenBitfieldUnit<[u8; 4usize]> {
        let mut __bindgen_bitfield_unit: __BindgenBitfieldUnit<[u8; 4usize]> = Default::default();
        __bindgen_bitfield_unit.set(0usize, 1u8, {
            let enable_custom_rouding_intra: u32 =
                unsafe { ::std::mem::transmute(enable_custom_rouding_intra) };
            enable_custom_rouding_intra as u64
        });
        __bindgen_bitfield_unit.set(1usize, 7u8, {
            let rounding_offset_intra: u32 =
                unsafe { ::std::mem::transmute(rounding_offset_intra) };
            rounding_offset_intra as u64
        });
        __bindgen_bitfield_unit.set(8usize, 1u8, {
            let enable_custom_rounding_inter: u32 =
                unsafe { ::std::mem::transmute(enable_custom_rounding_inter) };
            enable_custom_rounding_inter as u64
        });
        __bindgen_bitfield_unit.set(9usize, 7u8, {
            let rounding_offset_inter: u32 =
                unsafe { ::std::mem::transmute(rounding_offset_inter) };
            rounding_offset_inter as u64
        });
        __bindgen_bitfield_unit.set(16usize, 16u8, {
            let reserved: u32 = unsafe { ::std::mem::transmute(reserved) };
            reserved as u64
        });
        __bindgen_bitfield_unit
    }
}
#[test]
fn bindgen_test_layout__VAEncMiscParameterCustomRoundingControl__bindgen_ty_1() {
    assert_eq!(
        ::std::mem::size_of::<_VAEncMiscParameterCustomRoundingControl__bindgen_ty_1>(),
        4usize,
        concat!(
            "Size of: ",
            stringify!(_VAEncMiscParameterCustomRoundingControl__bindgen_ty_1)
        )
    );
    assert_eq!(
        ::std::mem::align_of::<_VAEncMiscParameterCustomRoundingControl__bindgen_ty_1>(),
        4usize,
        concat!(
            "Alignment of ",
            stringify!(_VAEncMiscParameterCustomRoundingControl__bindgen_ty_1)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<_VAEncMiscParameterCustomRoundingControl__bindgen_ty_1>())).bits
                as *const _ as usize
        },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(_VAEncMiscParameterCustomRoundingControl__bindgen_ty_1),
            "::",
            stringify!(bits)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<_VAEncMiscParameterCustomRoundingControl__bindgen_ty_1>())).value
                as *const _ as usize
        },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(_VAEncMiscParameterCustomRoundingControl__bindgen_ty_1),
            "::",
            stringify!(value)
        )
    );
}
#[test]
fn bindgen_test_layout__VAEncMiscParameterCustomRoundingControl() {
    assert_eq!(
        ::std::mem::size_of::<_VAEncMiscParameterCustomRoundingControl>(),
        4usize,
        concat!(
            "Size of: ",
            stringify!(_VAEncMiscParameterCustomRoundingControl)
        )
    );
    assert_eq!(
        ::std::mem::align_of::<_VAEncMiscParameterCustomRoundingControl>(),
        4usize,
        concat!(
            "Alignment of ",
            stringify!(_VAEncMiscParameterCustomRoundingControl)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<_VAEncMiscParameterCustomRoundingControl>()))
                .rounding_offset_setting as *const _ as usize
        },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(_VAEncMiscParameterCustomRoundingControl),
            "::",
            stringify!(rounding_offset_setting)
        )
    );
}
pub type VAEncMiscParameterCustomRoundingControl = _VAEncMiscParameterCustomRoundingControl;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct _VASliceParameterBufferBase {
    pub slice_data_size: u32,
    pub slice_data_offset: u32,
    pub slice_data_flag: u32,
}
#[test]
fn bindgen_test_layout__VASliceParameterBufferBase() {
    assert_eq!(
        ::std::mem::size_of::<_VASliceParameterBufferBase>(),
        12usize,
        concat!("Size of: ", stringify!(_VASliceParameterBufferBase))
    );
    assert_eq!(
        ::std::mem::align_of::<_VASliceParameterBufferBase>(),
        4usize,
        concat!("Alignment of ", stringify!(_VASliceParameterBufferBase))
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<_VASliceParameterBufferBase>())).slice_data_size as *const _
                as usize
        },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(_VASliceParameterBufferBase),
            "::",
            stringify!(slice_data_size)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<_VASliceParameterBufferBase>())).slice_data_offset as *const _
                as usize
        },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(_VASliceParameterBufferBase),
            "::",
            stringify!(slice_data_offset)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<_VASliceParameterBufferBase>())).slice_data_flag as *const _
                as usize
        },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(_VASliceParameterBufferBase),
            "::",
            stringify!(slice_data_flag)
        )
    );
}
pub type VASliceParameterBufferBase = _VASliceParameterBufferBase;
#[repr(C)]
#[derive(Copy, Clone)]
pub struct _VAHuffmanTableBufferJPEGBaseline {
    pub load_huffman_table: [u8; 2usize],
    pub huffman_table: [_VAHuffmanTableBufferJPEGBaseline__bindgen_ty_1; 2usize],
    pub va_reserved: [u32; 4usize],
}
#[repr(C)]
#[derive(Copy, Clone)]
pub struct _VAHuffmanTableBufferJPEGBaseline__bindgen_ty_1 {
    pub num_dc_codes: [u8; 16usize],
    pub dc_values: [u8; 12usize],
    pub num_ac_codes: [u8; 16usize],
    pub ac_values: [u8; 162usize],
    pub pad: [u8; 2usize],
}
#[test]
fn bindgen_test_layout__VAHuffmanTableBufferJPEGBaseline__bindgen_ty_1() {
    assert_eq!(
        ::std::mem::size_of::<_VAHuffmanTableBufferJPEGBaseline__bindgen_ty_1>(),
        208usize,
        concat!(
            "Size of: ",
            stringify!(_VAHuffmanTableBufferJPEGBaseline__bindgen_ty_1)
        )
    );
    assert_eq!(
        ::std::mem::align_of::<_VAHuffmanTableBufferJPEGBaseline__bindgen_ty_1>(),
        1usize,
        concat!(
            "Alignment of ",
            stringify!(_VAHuffmanTableBufferJPEGBaseline__bindgen_ty_1)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<_VAHuffmanTableBufferJPEGBaseline__bindgen_ty_1>())).num_dc_codes
                as *const _ as usize
        },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(_VAHuffmanTableBufferJPEGBaseline__bindgen_ty_1),
            "::",
            stringify!(num_dc_codes)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<_VAHuffmanTableBufferJPEGBaseline__bindgen_ty_1>())).dc_values
                as *const _ as usize
        },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(_VAHuffmanTableBufferJPEGBaseline__bindgen_ty_1),
            "::",
            stringify!(dc_values)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<_VAHuffmanTableBufferJPEGBaseline__bindgen_ty_1>())).num_ac_codes
                as *const _ as usize
        },
        28usize,
        concat!(
            "Offset of field: ",
            stringify!(_VAHuffmanTableBufferJPEGBaseline__bindgen_ty_1),
            "::",
            stringify!(num_ac_codes)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<_VAHuffmanTableBufferJPEGBaseline__bindgen_ty_1>())).ac_values
                as *const _ as usize
        },
        44usize,
        concat!(
            "Offset of field: ",
            stringify!(_VAHuffmanTableBufferJPEGBaseline__bindgen_ty_1),
            "::",
            stringify!(ac_values)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<_VAHuffmanTableBufferJPEGBaseline__bindgen_ty_1>())).pad
                as *const _ as usize
        },
        206usize,
        concat!(
            "Offset of field: ",
            stringify!(_VAHuffmanTableBufferJPEGBaseline__bindgen_ty_1),
            "::",
            stringify!(pad)
        )
    );
}
#[test]
fn bindgen_test_layout__VAHuffmanTableBufferJPEGBaseline() {
    assert_eq!(
        ::std::mem::size_of::<_VAHuffmanTableBufferJPEGBaseline>(),
        436usize,
        concat!("Size of: ", stringify!(_VAHuffmanTableBufferJPEGBaseline))
    );
    assert_eq!(
        ::std::mem::align_of::<_VAHuffmanTableBufferJPEGBaseline>(),
        4usize,
        concat!(
            "Alignment of ",
            stringify!(_VAHuffmanTableBufferJPEGBaseline)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<_VAHuffmanTableBufferJPEGBaseline>())).load_huffman_table
                as *const _ as usize
        },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(_VAHuffmanTableBufferJPEGBaseline),
            "::",
            stringify!(load_huffman_table)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<_VAHuffmanTableBufferJPEGBaseline>())).huffman_table as *const _
                as usize
        },
        2usize,
        concat!(
            "Offset of field: ",
            stringify!(_VAHuffmanTableBufferJPEGBaseline),
            "::",
            stringify!(huffman_table)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<_VAHuffmanTableBufferJPEGBaseline>())).va_reserved as *const _
                as usize
        },
        420usize,
        concat!(
            "Offset of field: ",
            stringify!(_VAHuffmanTableBufferJPEGBaseline),
            "::",
            stringify!(va_reserved)
        )
    );
}
pub type VAHuffmanTableBufferJPEGBaseline = _VAHuffmanTableBufferJPEGBaseline;
#[repr(C)]
#[derive(Copy, Clone)]
pub struct _VAPictureParameterBufferMPEG2 {
    pub horizontal_size: u16,
    pub vertical_size: u16,
    pub forward_reference_picture: VASurfaceID,
    pub backward_reference_picture: VASurfaceID,
    pub picture_coding_type: i32,
    pub f_code: i32,
    pub picture_coding_extension: _VAPictureParameterBufferMPEG2__bindgen_ty_1,
    pub va_reserved: [u32; 4usize],
}
#[repr(C)]
#[derive(Copy, Clone)]
pub union _VAPictureParameterBufferMPEG2__bindgen_ty_1 {
    pub bits: _VAPictureParameterBufferMPEG2__bindgen_ty_1__bindgen_ty_1,
    pub value: u32,
}
#[repr(C)]
#[repr(align(4))]
#[derive(Debug, Copy, Clone)]
pub struct _VAPictureParameterBufferMPEG2__bindgen_ty_1__bindgen_ty_1 {
    pub _bitfield_align_1: [u8; 0],
    pub _bitfield_1: __BindgenBitfieldUnit<[u8; 2usize]>,
    pub __bindgen_padding_0: u16,
}
#[test]
fn bindgen_test_layout__VAPictureParameterBufferMPEG2__bindgen_ty_1__bindgen_ty_1() {
    assert_eq!(
        ::std::mem::size_of::<_VAPictureParameterBufferMPEG2__bindgen_ty_1__bindgen_ty_1>(),
        4usize,
        concat!(
            "Size of: ",
            stringify!(_VAPictureParameterBufferMPEG2__bindgen_ty_1__bindgen_ty_1)
        )
    );
    assert_eq!(
        ::std::mem::align_of::<_VAPictureParameterBufferMPEG2__bindgen_ty_1__bindgen_ty_1>(),
        4usize,
        concat!(
            "Alignment of ",
            stringify!(_VAPictureParameterBufferMPEG2__bindgen_ty_1__bindgen_ty_1)
        )
    );
}
impl _VAPictureParameterBufferMPEG2__bindgen_ty_1__bindgen_ty_1 {
    #[inline]
    pub fn intra_dc_precision(&self) -> u32 {
        unsafe { ::std::mem::transmute(self._bitfield_1.get(0usize, 2u8) as u32) }
    }
    #[inline]
    pub fn set_intra_dc_precision(&mut self, val: u32) {
        unsafe {
            let val: u32 = ::std::mem::transmute(val);
            self._bitfield_1.set(0usize, 2u8, val as u64)
        }
    }
    #[inline]
    pub fn picture_structure(&self) -> u32 {
        unsafe { ::std::mem::transmute(self._bitfield_1.get(2usize, 2u8) as u32) }
    }
    #[inline]
    pub fn set_picture_structure(&mut self, val: u32) {
        unsafe {
            let val: u32 = ::std::mem::transmute(val);
            self._bitfield_1.set(2usize, 2u8, val as u64)
        }
    }
    #[inline]
    pub fn top_field_first(&self) -> u32 {
        unsafe { ::std::mem::transmute(self._bitfield_1.get(4usize, 1u8) as u32) }
    }
    #[inline]
    pub fn set_top_field_first(&mut self, val: u32) {
        unsafe {
            let val: u32 = ::std::mem::transmute(val);
            self._bitfield_1.set(4usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub fn frame_pred_frame_dct(&self) -> u32 {
        unsafe { ::std::mem::transmute(self._bitfield_1.get(5usize, 1u8) as u32) }
    }
    #[inline]
    pub fn set_frame_pred_frame_dct(&mut self, val: u32) {
        unsafe {
            let val: u32 = ::std::mem::transmute(val);
            self._bitfield_1.set(5usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub fn concealment_motion_vectors(&self) -> u32 {
        unsafe { ::std::mem::transmute(self._bitfield_1.get(6usize, 1u8) as u32) }
    }
    #[inline]
    pub fn set_concealment_motion_vectors(&mut self, val: u32) {
        unsafe {
            let val: u32 = ::std::mem::transmute(val);
            self._bitfield_1.set(6usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub fn q_scale_type(&self) -> u32 {
        unsafe { ::std::mem::transmute(self._bitfield_1.get(7usize, 1u8) as u32) }
    }
    #[inline]
    pub fn set_q_scale_type(&mut self, val: u32) {
        unsafe {
            let val: u32 = ::std::mem::transmute(val);
            self._bitfield_1.set(7usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub fn intra_vlc_format(&self) -> u32 {
        unsafe { ::std::mem::transmute(self._bitfield_1.get(8usize, 1u8) as u32) }
    }
    #[inline]
    pub fn set_intra_vlc_format(&mut self, val: u32) {
        unsafe {
            let val: u32 = ::std::mem::transmute(val);
            self._bitfield_1.set(8usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub fn alternate_scan(&self) -> u32 {
        unsafe { ::std::mem::transmute(self._bitfield_1.get(9usize, 1u8) as u32) }
    }
    #[inline]
    pub fn set_alternate_scan(&mut self, val: u32) {
        unsafe {
            let val: u32 = ::std::mem::transmute(val);
            self._bitfield_1.set(9usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub fn repeat_first_field(&self) -> u32 {
        unsafe { ::std::mem::transmute(self._bitfield_1.get(10usize, 1u8) as u32) }
    }
    #[inline]
    pub fn set_repeat_first_field(&mut self, val: u32) {
        unsafe {
            let val: u32 = ::std::mem::transmute(val);
            self._bitfield_1.set(10usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub fn progressive_frame(&self) -> u32 {
        unsafe { ::std::mem::transmute(self._bitfield_1.get(11usize, 1u8) as u32) }
    }
    #[inline]
    pub fn set_progressive_frame(&mut self, val: u32) {
        unsafe {
            let val: u32 = ::std::mem::transmute(val);
            self._bitfield_1.set(11usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub fn is_first_field(&self) -> u32 {
        unsafe { ::std::mem::transmute(self._bitfield_1.get(12usize, 1u8) as u32) }
    }
    #[inline]
    pub fn set_is_first_field(&mut self, val: u32) {
        unsafe {
            let val: u32 = ::std::mem::transmute(val);
            self._bitfield_1.set(12usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub fn new_bitfield_1(
        intra_dc_precision: u32,
        picture_structure: u32,
        top_field_first: u32,
        frame_pred_frame_dct: u32,
        concealment_motion_vectors: u32,
        q_scale_type: u32,
        intra_vlc_format: u32,
        alternate_scan: u32,
        repeat_first_field: u32,
        progressive_frame: u32,
        is_first_field: u32,
    ) -> __BindgenBitfieldUnit<[u8; 2usize]> {
        let mut __bindgen_bitfield_unit: __BindgenBitfieldUnit<[u8; 2usize]> = Default::default();
        __bindgen_bitfield_unit.set(0usize, 2u8, {
            let intra_dc_precision: u32 = unsafe { ::std::mem::transmute(intra_dc_precision) };
            intra_dc_precision as u64
        });
        __bindgen_bitfield_unit.set(2usize, 2u8, {
            let picture_structure: u32 = unsafe { ::std::mem::transmute(picture_structure) };
            picture_structure as u64
        });
        __bindgen_bitfield_unit.set(4usize, 1u8, {
            let top_field_first: u32 = unsafe { ::std::mem::transmute(top_field_first) };
            top_field_first as u64
        });
        __bindgen_bitfield_unit.set(5usize, 1u8, {
            let frame_pred_frame_dct: u32 = unsafe { ::std::mem::transmute(frame_pred_frame_dct) };
            frame_pred_frame_dct as u64
        });
        __bindgen_bitfield_unit.set(6usize, 1u8, {
            let concealment_motion_vectors: u32 =
                unsafe { ::std::mem::transmute(concealment_motion_vectors) };
            concealment_motion_vectors as u64
        });
        __bindgen_bitfield_unit.set(7usize, 1u8, {
            let q_scale_type: u32 = unsafe { ::std::mem::transmute(q_scale_type) };
            q_scale_type as u64
        });
        __bindgen_bitfield_unit.set(8usize, 1u8, {
            let intra_vlc_format: u32 = unsafe { ::std::mem::transmute(intra_vlc_format) };
            intra_vlc_format as u64
        });
        __bindgen_bitfield_unit.set(9usize, 1u8, {
            let alternate_scan: u32 = unsafe { ::std::mem::transmute(alternate_scan) };
            alternate_scan as u64
        });
        __bindgen_bitfield_unit.set(10usize, 1u8, {
            let repeat_first_field: u32 = unsafe { ::std::mem::transmute(repeat_first_field) };
            repeat_first_field as u64
        });
        __bindgen_bitfield_unit.set(11usize, 1u8, {
            let progressive_frame: u32 = unsafe { ::std::mem::transmute(progressive_frame) };
            progressive_frame as u64
        });
        __bindgen_bitfield_unit.set(12usize, 1u8, {
            let is_first_field: u32 = unsafe { ::std::mem::transmute(is_first_field) };
            is_first_field as u64
        });
        __bindgen_bitfield_unit
    }
}
#[test]
fn bindgen_test_layout__VAPictureParameterBufferMPEG2__bindgen_ty_1() {
    assert_eq!(
        ::std::mem::size_of::<_VAPictureParameterBufferMPEG2__bindgen_ty_1>(),
        4usize,
        concat!(
            "Size of: ",
            stringify!(_VAPictureParameterBufferMPEG2__bindgen_ty_1)
        )
    );
    assert_eq!(
        ::std::mem::align_of::<_VAPictureParameterBufferMPEG2__bindgen_ty_1>(),
        4usize,
        concat!(
            "Alignment of ",
            stringify!(_VAPictureParameterBufferMPEG2__bindgen_ty_1)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<_VAPictureParameterBufferMPEG2__bindgen_ty_1>())).bits
                as *const _ as usize
        },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(_VAPictureParameterBufferMPEG2__bindgen_ty_1),
            "::",
            stringify!(bits)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<_VAPictureParameterBufferMPEG2__bindgen_ty_1>())).value
                as *const _ as usize
        },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(_VAPictureParameterBufferMPEG2__bindgen_ty_1),
            "::",
            stringify!(value)
        )
    );
}
#[test]
fn bindgen_test_layout__VAPictureParameterBufferMPEG2() {
    assert_eq!(
        ::std::mem::size_of::<_VAPictureParameterBufferMPEG2>(),
        40usize,
        concat!("Size of: ", stringify!(_VAPictureParameterBufferMPEG2))
    );
    assert_eq!(
        ::std::mem::align_of::<_VAPictureParameterBufferMPEG2>(),
        4usize,
        concat!("Alignment of ", stringify!(_VAPictureParameterBufferMPEG2))
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<_VAPictureParameterBufferMPEG2>())).horizontal_size as *const _
                as usize
        },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(_VAPictureParameterBufferMPEG2),
            "::",
            stringify!(horizontal_size)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<_VAPictureParameterBufferMPEG2>())).vertical_size as *const _
                as usize
        },
        2usize,
        concat!(
            "Offset of field: ",
            stringify!(_VAPictureParameterBufferMPEG2),
            "::",
            stringify!(vertical_size)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<_VAPictureParameterBufferMPEG2>())).forward_reference_picture
                as *const _ as usize
        },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(_VAPictureParameterBufferMPEG2),
            "::",
            stringify!(forward_reference_picture)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<_VAPictureParameterBufferMPEG2>())).backward_reference_picture
                as *const _ as usize
        },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(_VAPictureParameterBufferMPEG2),
            "::",
            stringify!(backward_reference_picture)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<_VAPictureParameterBufferMPEG2>())).picture_coding_type
                as *const _ as usize
        },
        12usize,
        concat!(
            "Offset of field: ",
            stringify!(_VAPictureParameterBufferMPEG2),
            "::",
            stringify!(picture_coding_type)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<_VAPictureParameterBufferMPEG2>())).f_code as *const _ as usize
        },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(_VAPictureParameterBufferMPEG2),
            "::",
            stringify!(f_code)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<_VAPictureParameterBufferMPEG2>())).picture_coding_extension
                as *const _ as usize
        },
        20usize,
        concat!(
            "Offset of field: ",
            stringify!(_VAPictureParameterBufferMPEG2),
            "::",
            stringify!(picture_coding_extension)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<_VAPictureParameterBufferMPEG2>())).va_reserved as *const _
                as usize
        },
        24usize,
        concat!(
            "Offset of field: ",
            stringify!(_VAPictureParameterBufferMPEG2),
            "::",
            stringify!(va_reserved)
        )
    );
}
pub type VAPictureParameterBufferMPEG2 = _VAPictureParameterBufferMPEG2;
#[repr(C)]
#[derive(Copy, Clone)]
pub struct _VAIQMatrixBufferMPEG2 {
    pub load_intra_quantiser_matrix: i32,
    pub load_non_intra_quantiser_matrix: i32,
    pub load_chroma_intra_quantiser_matrix: i32,
    pub load_chroma_non_intra_quantiser_matrix: i32,
    pub intra_quantiser_matrix: [u8; 64usize],
    pub non_intra_quantiser_matrix: [u8; 64usize],
    pub chroma_intra_quantiser_matrix: [u8; 64usize],
    pub chroma_non_intra_quantiser_matrix: [u8; 64usize],
    pub va_reserved: [u32; 4usize],
}
#[test]
fn bindgen_test_layout__VAIQMatrixBufferMPEG2() {
    assert_eq!(
        ::std::mem::size_of::<_VAIQMatrixBufferMPEG2>(),
        288usize,
        concat!("Size of: ", stringify!(_VAIQMatrixBufferMPEG2))
    );
    assert_eq!(
        ::std::mem::align_of::<_VAIQMatrixBufferMPEG2>(),
        4usize,
        concat!("Alignment of ", stringify!(_VAIQMatrixBufferMPEG2))
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<_VAIQMatrixBufferMPEG2>())).load_intra_quantiser_matrix
                as *const _ as usize
        },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(_VAIQMatrixBufferMPEG2),
            "::",
            stringify!(load_intra_quantiser_matrix)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<_VAIQMatrixBufferMPEG2>())).load_non_intra_quantiser_matrix
                as *const _ as usize
        },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(_VAIQMatrixBufferMPEG2),
            "::",
            stringify!(load_non_intra_quantiser_matrix)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<_VAIQMatrixBufferMPEG2>())).load_chroma_intra_quantiser_matrix
                as *const _ as usize
        },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(_VAIQMatrixBufferMPEG2),
            "::",
            stringify!(load_chroma_intra_quantiser_matrix)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<_VAIQMatrixBufferMPEG2>()))
                .load_chroma_non_intra_quantiser_matrix as *const _ as usize
        },
        12usize,
        concat!(
            "Offset of field: ",
            stringify!(_VAIQMatrixBufferMPEG2),
            "::",
            stringify!(load_chroma_non_intra_quantiser_matrix)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<_VAIQMatrixBufferMPEG2>())).intra_quantiser_matrix as *const _
                as usize
        },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(_VAIQMatrixBufferMPEG2),
            "::",
            stringify!(intra_quantiser_matrix)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<_VAIQMatrixBufferMPEG2>())).non_intra_quantiser_matrix
                as *const _ as usize
        },
        80usize,
        concat!(
            "Offset of field: ",
            stringify!(_VAIQMatrixBufferMPEG2),
            "::",
            stringify!(non_intra_quantiser_matrix)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<_VAIQMatrixBufferMPEG2>())).chroma_intra_quantiser_matrix
                as *const _ as usize
        },
        144usize,
        concat!(
            "Offset of field: ",
            stringify!(_VAIQMatrixBufferMPEG2),
            "::",
            stringify!(chroma_intra_quantiser_matrix)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<_VAIQMatrixBufferMPEG2>())).chroma_non_intra_quantiser_matrix
                as *const _ as usize
        },
        208usize,
        concat!(
            "Offset of field: ",
            stringify!(_VAIQMatrixBufferMPEG2),
            "::",
            stringify!(chroma_non_intra_quantiser_matrix)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<_VAIQMatrixBufferMPEG2>())).va_reserved as *const _ as usize
        },
        272usize,
        concat!(
            "Offset of field: ",
            stringify!(_VAIQMatrixBufferMPEG2),
            "::",
            stringify!(va_reserved)
        )
    );
}
pub type VAIQMatrixBufferMPEG2 = _VAIQMatrixBufferMPEG2;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct _VASliceParameterBufferMPEG2 {
    pub slice_data_size: u32,
    pub slice_data_offset: u32,
    pub slice_data_flag: u32,
    pub macroblock_offset: u32,
    pub slice_horizontal_position: u32,
    pub slice_vertical_position: u32,
    pub quantiser_scale_code: i32,
    pub intra_slice_flag: i32,
    pub va_reserved: [u32; 4usize],
}
#[test]
fn bindgen_test_layout__VASliceParameterBufferMPEG2() {
    assert_eq!(
        ::std::mem::size_of::<_VASliceParameterBufferMPEG2>(),
        48usize,
        concat!("Size of: ", stringify!(_VASliceParameterBufferMPEG2))
    );
    assert_eq!(
        ::std::mem::align_of::<_VASliceParameterBufferMPEG2>(),
        4usize,
        concat!("Alignment of ", stringify!(_VASliceParameterBufferMPEG2))
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<_VASliceParameterBufferMPEG2>())).slice_data_size as *const _
                as usize
        },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(_VASliceParameterBufferMPEG2),
            "::",
            stringify!(slice_data_size)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<_VASliceParameterBufferMPEG2>())).slice_data_offset as *const _
                as usize
        },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(_VASliceParameterBufferMPEG2),
            "::",
            stringify!(slice_data_offset)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<_VASliceParameterBufferMPEG2>())).slice_data_flag as *const _
                as usize
        },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(_VASliceParameterBufferMPEG2),
            "::",
            stringify!(slice_data_flag)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<_VASliceParameterBufferMPEG2>())).macroblock_offset as *const _
                as usize
        },
        12usize,
        concat!(
            "Offset of field: ",
            stringify!(_VASliceParameterBufferMPEG2),
            "::",
            stringify!(macroblock_offset)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<_VASliceParameterBufferMPEG2>())).slice_horizontal_position
                as *const _ as usize
        },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(_VASliceParameterBufferMPEG2),
            "::",
            stringify!(slice_horizontal_position)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<_VASliceParameterBufferMPEG2>())).slice_vertical_position
                as *const _ as usize
        },
        20usize,
        concat!(
            "Offset of field: ",
            stringify!(_VASliceParameterBufferMPEG2),
            "::",
            stringify!(slice_vertical_position)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<_VASliceParameterBufferMPEG2>())).quantiser_scale_code
                as *const _ as usize
        },
        24usize,
        concat!(
            "Offset of field: ",
            stringify!(_VASliceParameterBufferMPEG2),
            "::",
            stringify!(quantiser_scale_code)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<_VASliceParameterBufferMPEG2>())).intra_slice_flag as *const _
                as usize
        },
        28usize,
        concat!(
            "Offset of field: ",
            stringify!(_VASliceParameterBufferMPEG2),
            "::",
            stringify!(intra_slice_flag)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<_VASliceParameterBufferMPEG2>())).va_reserved as *const _
                as usize
        },
        32usize,
        concat!(
            "Offset of field: ",
            stringify!(_VASliceParameterBufferMPEG2),
            "::",
            stringify!(va_reserved)
        )
    );
}
pub type VASliceParameterBufferMPEG2 = _VASliceParameterBufferMPEG2;
#[repr(C)]
#[derive(Copy, Clone)]
pub struct _VAMacroblockParameterBufferMPEG2 {
    pub macroblock_address: u16,
    pub macroblock_type: u8,
    pub macroblock_modes: _VAMacroblockParameterBufferMPEG2__bindgen_ty_1,
    pub motion_vertical_field_select: u8,
    pub PMV: [[[i16; 2usize]; 2usize]; 2usize],
    pub coded_block_pattern: u16,
    pub num_skipped_macroblocks: u16,
    pub va_reserved: [u32; 4usize],
}
#[repr(C)]
#[derive(Copy, Clone)]
pub union _VAMacroblockParameterBufferMPEG2__bindgen_ty_1 {
    pub bits: _VAMacroblockParameterBufferMPEG2__bindgen_ty_1__bindgen_ty_1,
    pub value: u32,
}
#[repr(C)]
#[repr(align(4))]
#[derive(Debug, Copy, Clone)]
pub struct _VAMacroblockParameterBufferMPEG2__bindgen_ty_1__bindgen_ty_1 {
    pub _bitfield_align_1: [u8; 0],
    pub _bitfield_1: __BindgenBitfieldUnit<[u8; 1usize]>,
    pub __bindgen_padding_0: [u8; 3usize],
}
#[test]
fn bindgen_test_layout__VAMacroblockParameterBufferMPEG2__bindgen_ty_1__bindgen_ty_1() {
    assert_eq!(
        ::std::mem::size_of::<_VAMacroblockParameterBufferMPEG2__bindgen_ty_1__bindgen_ty_1>(),
        4usize,
        concat!(
            "Size of: ",
            stringify!(_VAMacroblockParameterBufferMPEG2__bindgen_ty_1__bindgen_ty_1)
        )
    );
    assert_eq!(
        ::std::mem::align_of::<_VAMacroblockParameterBufferMPEG2__bindgen_ty_1__bindgen_ty_1>(),
        4usize,
        concat!(
            "Alignment of ",
            stringify!(_VAMacroblockParameterBufferMPEG2__bindgen_ty_1__bindgen_ty_1)
        )
    );
}
impl _VAMacroblockParameterBufferMPEG2__bindgen_ty_1__bindgen_ty_1 {
    #[inline]
    pub fn frame_motion_type(&self) -> u32 {
        unsafe { ::std::mem::transmute(self._bitfield_1.get(0usize, 2u8) as u32) }
    }
    #[inline]
    pub fn set_frame_motion_type(&mut self, val: u32) {
        unsafe {
            let val: u32 = ::std::mem::transmute(val);
            self._bitfield_1.set(0usize, 2u8, val as u64)
        }
    }
    #[inline]
    pub fn field_motion_type(&self) -> u32 {
        unsafe { ::std::mem::transmute(self._bitfield_1.get(2usize, 2u8) as u32) }
    }
    #[inline]
    pub fn set_field_motion_type(&mut self, val: u32) {
        unsafe {
            let val: u32 = ::std::mem::transmute(val);
            self._bitfield_1.set(2usize, 2u8, val as u64)
        }
    }
    #[inline]
    pub fn dct_type(&self) -> u32 {
        unsafe { ::std::mem::transmute(self._bitfield_1.get(4usize, 1u8) as u32) }
    }
    #[inline]
    pub fn set_dct_type(&mut self, val: u32) {
        unsafe {
            let val: u32 = ::std::mem::transmute(val);
            self._bitfield_1.set(4usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub fn new_bitfield_1(
        frame_motion_type: u32,
        field_motion_type: u32,
        dct_type: u32,
    ) -> __BindgenBitfieldUnit<[u8; 1usize]> {
        let mut __bindgen_bitfield_unit: __BindgenBitfieldUnit<[u8; 1usize]> = Default::default();
        __bindgen_bitfield_unit.set(0usize, 2u8, {
            let frame_motion_type: u32 = unsafe { ::std::mem::transmute(frame_motion_type) };
            frame_motion_type as u64
        });
        __bindgen_bitfield_unit.set(2usize, 2u8, {
            let field_motion_type: u32 = unsafe { ::std::mem::transmute(field_motion_type) };
            field_motion_type as u64
        });
        __bindgen_bitfield_unit.set(4usize, 1u8, {
            let dct_type: u32 = unsafe { ::std::mem::transmute(dct_type) };
            dct_type as u64
        });
        __bindgen_bitfield_unit
    }
}
#[test]
fn bindgen_test_layout__VAMacroblockParameterBufferMPEG2__bindgen_ty_1() {
    assert_eq!(
        ::std::mem::size_of::<_VAMacroblockParameterBufferMPEG2__bindgen_ty_1>(),
        4usize,
        concat!(
            "Size of: ",
            stringify!(_VAMacroblockParameterBufferMPEG2__bindgen_ty_1)
        )
    );
    assert_eq!(
        ::std::mem::align_of::<_VAMacroblockParameterBufferMPEG2__bindgen_ty_1>(),
        4usize,
        concat!(
            "Alignment of ",
            stringify!(_VAMacroblockParameterBufferMPEG2__bindgen_ty_1)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<_VAMacroblockParameterBufferMPEG2__bindgen_ty_1>())).bits
                as *const _ as usize
        },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(_VAMacroblockParameterBufferMPEG2__bindgen_ty_1),
            "::",
            stringify!(bits)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<_VAMacroblockParameterBufferMPEG2__bindgen_ty_1>())).value
                as *const _ as usize
        },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(_VAMacroblockParameterBufferMPEG2__bindgen_ty_1),
            "::",
            stringify!(value)
        )
    );
}
#[test]
fn bindgen_test_layout__VAMacroblockParameterBufferMPEG2() {
    assert_eq!(
        ::std::mem::size_of::<_VAMacroblockParameterBufferMPEG2>(),
        48usize,
        concat!("Size of: ", stringify!(_VAMacroblockParameterBufferMPEG2))
    );
    assert_eq!(
        ::std::mem::align_of::<_VAMacroblockParameterBufferMPEG2>(),
        4usize,
        concat!(
            "Alignment of ",
            stringify!(_VAMacroblockParameterBufferMPEG2)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<_VAMacroblockParameterBufferMPEG2>())).macroblock_address
                as *const _ as usize
        },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(_VAMacroblockParameterBufferMPEG2),
            "::",
            stringify!(macroblock_address)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<_VAMacroblockParameterBufferMPEG2>())).macroblock_type
                as *const _ as usize
        },
        2usize,
        concat!(
            "Offset of field: ",
            stringify!(_VAMacroblockParameterBufferMPEG2),
            "::",
            stringify!(macroblock_type)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<_VAMacroblockParameterBufferMPEG2>())).macroblock_modes
                as *const _ as usize
        },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(_VAMacroblockParameterBufferMPEG2),
            "::",
            stringify!(macroblock_modes)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<_VAMacroblockParameterBufferMPEG2>()))
                .motion_vertical_field_select as *const _ as usize
        },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(_VAMacroblockParameterBufferMPEG2),
            "::",
            stringify!(motion_vertical_field_select)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<_VAMacroblockParameterBufferMPEG2>())).PMV as *const _ as usize
        },
        10usize,
        concat!(
            "Offset of field: ",
            stringify!(_VAMacroblockParameterBufferMPEG2),
            "::",
            stringify!(PMV)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<_VAMacroblockParameterBufferMPEG2>())).coded_block_pattern
                as *const _ as usize
        },
        26usize,
        concat!(
            "Offset of field: ",
            stringify!(_VAMacroblockParameterBufferMPEG2),
            "::",
            stringify!(coded_block_pattern)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<_VAMacroblockParameterBufferMPEG2>())).num_skipped_macroblocks
                as *const _ as usize
        },
        28usize,
        concat!(
            "Offset of field: ",
            stringify!(_VAMacroblockParameterBufferMPEG2),
            "::",
            stringify!(num_skipped_macroblocks)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<_VAMacroblockParameterBufferMPEG2>())).va_reserved as *const _
                as usize
        },
        32usize,
        concat!(
            "Offset of field: ",
            stringify!(_VAMacroblockParameterBufferMPEG2),
            "::",
            stringify!(va_reserved)
        )
    );
}
pub type VAMacroblockParameterBufferMPEG2 = _VAMacroblockParameterBufferMPEG2;
#[repr(C)]
#[derive(Copy, Clone)]
pub struct _VAPictureParameterBufferMPEG4 {
    pub vop_width: u16,
    pub vop_height: u16,
    pub forward_reference_picture: VASurfaceID,
    pub backward_reference_picture: VASurfaceID,
    pub vol_fields: _VAPictureParameterBufferMPEG4__bindgen_ty_1,
    pub no_of_sprite_warping_points: u8,
    pub sprite_trajectory_du: [i16; 3usize],
    pub sprite_trajectory_dv: [i16; 3usize],
    pub quant_precision: u8,
    pub vop_fields: _VAPictureParameterBufferMPEG4__bindgen_ty_2,
    pub vop_fcode_forward: u8,
    pub vop_fcode_backward: u8,
    pub vop_time_increment_resolution: u16,
    pub num_gobs_in_vop: u8,
    pub num_macroblocks_in_gob: u8,
    pub TRB: i16,
    pub TRD: i16,
    pub va_reserved: [u32; 4usize],
}
#[repr(C)]
#[derive(Copy, Clone)]
pub union _VAPictureParameterBufferMPEG4__bindgen_ty_1 {
    pub bits: _VAPictureParameterBufferMPEG4__bindgen_ty_1__bindgen_ty_1,
    pub value: u32,
}
#[repr(C)]
#[repr(align(4))]
#[derive(Debug, Copy, Clone)]
pub struct _VAPictureParameterBufferMPEG4__bindgen_ty_1__bindgen_ty_1 {
    pub _bitfield_align_1: [u8; 0],
    pub _bitfield_1: __BindgenBitfieldUnit<[u8; 2usize]>,
    pub __bindgen_padding_0: u16,
}
#[test]
fn bindgen_test_layout__VAPictureParameterBufferMPEG4__bindgen_ty_1__bindgen_ty_1() {
    assert_eq!(
        ::std::mem::size_of::<_VAPictureParameterBufferMPEG4__bindgen_ty_1__bindgen_ty_1>(),
        4usize,
        concat!(
            "Size of: ",
            stringify!(_VAPictureParameterBufferMPEG4__bindgen_ty_1__bindgen_ty_1)
        )
    );
    assert_eq!(
        ::std::mem::align_of::<_VAPictureParameterBufferMPEG4__bindgen_ty_1__bindgen_ty_1>(),
        4usize,
        concat!(
            "Alignment of ",
            stringify!(_VAPictureParameterBufferMPEG4__bindgen_ty_1__bindgen_ty_1)
        )
    );
}
impl _VAPictureParameterBufferMPEG4__bindgen_ty_1__bindgen_ty_1 {
    #[inline]
    pub fn short_video_header(&self) -> u32 {
        unsafe { ::std::mem::transmute(self._bitfield_1.get(0usize, 1u8) as u32) }
    }
    #[inline]
    pub fn set_short_video_header(&mut self, val: u32) {
        unsafe {
            let val: u32 = ::std::mem::transmute(val);
            self._bitfield_1.set(0usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub fn chroma_format(&self) -> u32 {
        unsafe { ::std::mem::transmute(self._bitfield_1.get(1usize, 2u8) as u32) }
    }
    #[inline]
    pub fn set_chroma_format(&mut self, val: u32) {
        unsafe {
            let val: u32 = ::std::mem::transmute(val);
            self._bitfield_1.set(1usize, 2u8, val as u64)
        }
    }
    #[inline]
    pub fn interlaced(&self) -> u32 {
        unsafe { ::std::mem::transmute(self._bitfield_1.get(3usize, 1u8) as u32) }
    }
    #[inline]
    pub fn set_interlaced(&mut self, val: u32) {
        unsafe {
            let val: u32 = ::std::mem::transmute(val);
            self._bitfield_1.set(3usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub fn obmc_disable(&self) -> u32 {
        unsafe { ::std::mem::transmute(self._bitfield_1.get(4usize, 1u8) as u32) }
    }
    #[inline]
    pub fn set_obmc_disable(&mut self, val: u32) {
        unsafe {
            let val: u32 = ::std::mem::transmute(val);
            self._bitfield_1.set(4usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub fn sprite_enable(&self) -> u32 {
        unsafe { ::std::mem::transmute(self._bitfield_1.get(5usize, 2u8) as u32) }
    }
    #[inline]
    pub fn set_sprite_enable(&mut self, val: u32) {
        unsafe {
            let val: u32 = ::std::mem::transmute(val);
            self._bitfield_1.set(5usize, 2u8, val as u64)
        }
    }
    #[inline]
    pub fn sprite_warping_accuracy(&self) -> u32 {
        unsafe { ::std::mem::transmute(self._bitfield_1.get(7usize, 2u8) as u32) }
    }
    #[inline]
    pub fn set_sprite_warping_accuracy(&mut self, val: u32) {
        unsafe {
            let val: u32 = ::std::mem::transmute(val);
            self._bitfield_1.set(7usize, 2u8, val as u64)
        }
    }
    #[inline]
    pub fn quant_type(&self) -> u32 {
        unsafe { ::std::mem::transmute(self._bitfield_1.get(9usize, 1u8) as u32) }
    }
    #[inline]
    pub fn set_quant_type(&mut self, val: u32) {
        unsafe {
            let val: u32 = ::std::mem::transmute(val);
            self._bitfield_1.set(9usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub fn quarter_sample(&self) -> u32 {
        unsafe { ::std::mem::transmute(self._bitfield_1.get(10usize, 1u8) as u32) }
    }
    #[inline]
    pub fn set_quarter_sample(&mut self, val: u32) {
        unsafe {
            let val: u32 = ::std::mem::transmute(val);
            self._bitfield_1.set(10usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub fn data_partitioned(&self) -> u32 {
        unsafe { ::std::mem::transmute(self._bitfield_1.get(11usize, 1u8) as u32) }
    }
    #[inline]
    pub fn set_data_partitioned(&mut self, val: u32) {
        unsafe {
            let val: u32 = ::std::mem::transmute(val);
            self._bitfield_1.set(11usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub fn reversible_vlc(&self) -> u32 {
        unsafe { ::std::mem::transmute(self._bitfield_1.get(12usize, 1u8) as u32) }
    }
    #[inline]
    pub fn set_reversible_vlc(&mut self, val: u32) {
        unsafe {
            let val: u32 = ::std::mem::transmute(val);
            self._bitfield_1.set(12usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub fn resync_marker_disable(&self) -> u32 {
        unsafe { ::std::mem::transmute(self._bitfield_1.get(13usize, 1u8) as u32) }
    }
    #[inline]
    pub fn set_resync_marker_disable(&mut self, val: u32) {
        unsafe {
            let val: u32 = ::std::mem::transmute(val);
            self._bitfield_1.set(13usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub fn new_bitfield_1(
        short_video_header: u32,
        chroma_format: u32,
        interlaced: u32,
        obmc_disable: u32,
        sprite_enable: u32,
        sprite_warping_accuracy: u32,
        quant_type: u32,
        quarter_sample: u32,
        data_partitioned: u32,
        reversible_vlc: u32,
        resync_marker_disable: u32,
    ) -> __BindgenBitfieldUnit<[u8; 2usize]> {
        let mut __bindgen_bitfield_unit: __BindgenBitfieldUnit<[u8; 2usize]> = Default::default();
        __bindgen_bitfield_unit.set(0usize, 1u8, {
            let short_video_header: u32 = unsafe { ::std::mem::transmute(short_video_header) };
            short_video_header as u64
        });
        __bindgen_bitfield_unit.set(1usize, 2u8, {
            let chroma_format: u32 = unsafe { ::std::mem::transmute(chroma_format) };
            chroma_format as u64
        });
        __bindgen_bitfield_unit.set(3usize, 1u8, {
            let interlaced: u32 = unsafe { ::std::mem::transmute(interlaced) };
            interlaced as u64
        });
        __bindgen_bitfield_unit.set(4usize, 1u8, {
            let obmc_disable: u32 = unsafe { ::std::mem::transmute(obmc_disable) };
            obmc_disable as u64
        });
        __bindgen_bitfield_unit.set(5usize, 2u8, {
            let sprite_enable: u32 = unsafe { ::std::mem::transmute(sprite_enable) };
            sprite_enable as u64
        });
        __bindgen_bitfield_unit.set(7usize, 2u8, {
            let sprite_warping_accuracy: u32 =
                unsafe { ::std::mem::transmute(sprite_warping_accuracy) };
            sprite_warping_accuracy as u64
        });
        __bindgen_bitfield_unit.set(9usize, 1u8, {
            let quant_type: u32 = unsafe { ::std::mem::transmute(quant_type) };
            quant_type as u64
        });
        __bindgen_bitfield_unit.set(10usize, 1u8, {
            let quarter_sample: u32 = unsafe { ::std::mem::transmute(quarter_sample) };
            quarter_sample as u64
        });
        __bindgen_bitfield_unit.set(11usize, 1u8, {
            let data_partitioned: u32 = unsafe { ::std::mem::transmute(data_partitioned) };
            data_partitioned as u64
        });
        __bindgen_bitfield_unit.set(12usize, 1u8, {
            let reversible_vlc: u32 = unsafe { ::std::mem::transmute(reversible_vlc) };
            reversible_vlc as u64
        });
        __bindgen_bitfield_unit.set(13usize, 1u8, {
            let resync_marker_disable: u32 =
                unsafe { ::std::mem::transmute(resync_marker_disable) };
            resync_marker_disable as u64
        });
        __bindgen_bitfield_unit
    }
}
#[test]
fn bindgen_test_layout__VAPictureParameterBufferMPEG4__bindgen_ty_1() {
    assert_eq!(
        ::std::mem::size_of::<_VAPictureParameterBufferMPEG4__bindgen_ty_1>(),
        4usize,
        concat!(
            "Size of: ",
            stringify!(_VAPictureParameterBufferMPEG4__bindgen_ty_1)
        )
    );
    assert_eq!(
        ::std::mem::align_of::<_VAPictureParameterBufferMPEG4__bindgen_ty_1>(),
        4usize,
        concat!(
            "Alignment of ",
            stringify!(_VAPictureParameterBufferMPEG4__bindgen_ty_1)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<_VAPictureParameterBufferMPEG4__bindgen_ty_1>())).bits
                as *const _ as usize
        },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(_VAPictureParameterBufferMPEG4__bindgen_ty_1),
            "::",
            stringify!(bits)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<_VAPictureParameterBufferMPEG4__bindgen_ty_1>())).value
                as *const _ as usize
        },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(_VAPictureParameterBufferMPEG4__bindgen_ty_1),
            "::",
            stringify!(value)
        )
    );
}
#[repr(C)]
#[derive(Copy, Clone)]
pub union _VAPictureParameterBufferMPEG4__bindgen_ty_2 {
    pub bits: _VAPictureParameterBufferMPEG4__bindgen_ty_2__bindgen_ty_1,
    pub value: u32,
}
#[repr(C)]
#[repr(align(4))]
#[derive(Debug, Copy, Clone)]
pub struct _VAPictureParameterBufferMPEG4__bindgen_ty_2__bindgen_ty_1 {
    pub _bitfield_align_1: [u8; 0],
    pub _bitfield_1: __BindgenBitfieldUnit<[u8; 2usize]>,
    pub __bindgen_padding_0: u16,
}
#[test]
fn bindgen_test_layout__VAPictureParameterBufferMPEG4__bindgen_ty_2__bindgen_ty_1() {
    assert_eq!(
        ::std::mem::size_of::<_VAPictureParameterBufferMPEG4__bindgen_ty_2__bindgen_ty_1>(),
        4usize,
        concat!(
            "Size of: ",
            stringify!(_VAPictureParameterBufferMPEG4__bindgen_ty_2__bindgen_ty_1)
        )
    );
    assert_eq!(
        ::std::mem::align_of::<_VAPictureParameterBufferMPEG4__bindgen_ty_2__bindgen_ty_1>(),
        4usize,
        concat!(
            "Alignment of ",
            stringify!(_VAPictureParameterBufferMPEG4__bindgen_ty_2__bindgen_ty_1)
        )
    );
}
impl _VAPictureParameterBufferMPEG4__bindgen_ty_2__bindgen_ty_1 {
    #[inline]
    pub fn vop_coding_type(&self) -> u32 {
        unsafe { ::std::mem::transmute(self._bitfield_1.get(0usize, 2u8) as u32) }
    }
    #[inline]
    pub fn set_vop_coding_type(&mut self, val: u32) {
        unsafe {
            let val: u32 = ::std::mem::transmute(val);
            self._bitfield_1.set(0usize, 2u8, val as u64)
        }
    }
    #[inline]
    pub fn backward_reference_vop_coding_type(&self) -> u32 {
        unsafe { ::std::mem::transmute(self._bitfield_1.get(2usize, 2u8) as u32) }
    }
    #[inline]
    pub fn set_backward_reference_vop_coding_type(&mut self, val: u32) {
        unsafe {
            let val: u32 = ::std::mem::transmute(val);
            self._bitfield_1.set(2usize, 2u8, val as u64)
        }
    }
    #[inline]
    pub fn vop_rounding_type(&self) -> u32 {
        unsafe { ::std::mem::transmute(self._bitfield_1.get(4usize, 1u8) as u32) }
    }
    #[inline]
    pub fn set_vop_rounding_type(&mut self, val: u32) {
        unsafe {
            let val: u32 = ::std::mem::transmute(val);
            self._bitfield_1.set(4usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub fn intra_dc_vlc_thr(&self) -> u32 {
        unsafe { ::std::mem::transmute(self._bitfield_1.get(5usize, 3u8) as u32) }
    }
    #[inline]
    pub fn set_intra_dc_vlc_thr(&mut self, val: u32) {
        unsafe {
            let val: u32 = ::std::mem::transmute(val);
            self._bitfield_1.set(5usize, 3u8, val as u64)
        }
    }
    #[inline]
    pub fn top_field_first(&self) -> u32 {
        unsafe { ::std::mem::transmute(self._bitfield_1.get(8usize, 1u8) as u32) }
    }
    #[inline]
    pub fn set_top_field_first(&mut self, val: u32) {
        unsafe {
            let val: u32 = ::std::mem::transmute(val);
            self._bitfield_1.set(8usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub fn alternate_vertical_scan_flag(&self) -> u32 {
        unsafe { ::std::mem::transmute(self._bitfield_1.get(9usize, 1u8) as u32) }
    }
    #[inline]
    pub fn set_alternate_vertical_scan_flag(&mut self, val: u32) {
        unsafe {
            let val: u32 = ::std::mem::transmute(val);
            self._bitfield_1.set(9usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub fn new_bitfield_1(
        vop_coding_type: u32,
        backward_reference_vop_coding_type: u32,
        vop_rounding_type: u32,
        intra_dc_vlc_thr: u32,
        top_field_first: u32,
        alternate_vertical_scan_flag: u32,
    ) -> __BindgenBitfieldUnit<[u8; 2usize]> {
        let mut __bindgen_bitfield_unit: __BindgenBitfieldUnit<[u8; 2usize]> = Default::default();
        __bindgen_bitfield_unit.set(0usize, 2u8, {
            let vop_coding_type: u32 = unsafe { ::std::mem::transmute(vop_coding_type) };
            vop_coding_type as u64
        });
        __bindgen_bitfield_unit.set(2usize, 2u8, {
            let backward_reference_vop_coding_type: u32 =
                unsafe { ::std::mem::transmute(backward_reference_vop_coding_type) };
            backward_reference_vop_coding_type as u64
        });
        __bindgen_bitfield_unit.set(4usize, 1u8, {
            let vop_rounding_type: u32 = unsafe { ::std::mem::transmute(vop_rounding_type) };
            vop_rounding_type as u64
        });
        __bindgen_bitfield_unit.set(5usize, 3u8, {
            let intra_dc_vlc_thr: u32 = unsafe { ::std::mem::transmute(intra_dc_vlc_thr) };
            intra_dc_vlc_thr as u64
        });
        __bindgen_bitfield_unit.set(8usize, 1u8, {
            let top_field_first: u32 = unsafe { ::std::mem::transmute(top_field_first) };
            top_field_first as u64
        });
        __bindgen_bitfield_unit.set(9usize, 1u8, {
            let alternate_vertical_scan_flag: u32 =
                unsafe { ::std::mem::transmute(alternate_vertical_scan_flag) };
            alternate_vertical_scan_flag as u64
        });
        __bindgen_bitfield_unit
    }
}
#[test]
fn bindgen_test_layout__VAPictureParameterBufferMPEG4__bindgen_ty_2() {
    assert_eq!(
        ::std::mem::size_of::<_VAPictureParameterBufferMPEG4__bindgen_ty_2>(),
        4usize,
        concat!(
            "Size of: ",
            stringify!(_VAPictureParameterBufferMPEG4__bindgen_ty_2)
        )
    );
    assert_eq!(
        ::std::mem::align_of::<_VAPictureParameterBufferMPEG4__bindgen_ty_2>(),
        4usize,
        concat!(
            "Alignment of ",
            stringify!(_VAPictureParameterBufferMPEG4__bindgen_ty_2)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<_VAPictureParameterBufferMPEG4__bindgen_ty_2>())).bits
                as *const _ as usize
        },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(_VAPictureParameterBufferMPEG4__bindgen_ty_2),
            "::",
            stringify!(bits)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<_VAPictureParameterBufferMPEG4__bindgen_ty_2>())).value
                as *const _ as usize
        },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(_VAPictureParameterBufferMPEG4__bindgen_ty_2),
            "::",
            stringify!(value)
        )
    );
}
#[test]
fn bindgen_test_layout__VAPictureParameterBufferMPEG4() {
    assert_eq!(
        ::std::mem::size_of::<_VAPictureParameterBufferMPEG4>(),
        64usize,
        concat!("Size of: ", stringify!(_VAPictureParameterBufferMPEG4))
    );
    assert_eq!(
        ::std::mem::align_of::<_VAPictureParameterBufferMPEG4>(),
        4usize,
        concat!("Alignment of ", stringify!(_VAPictureParameterBufferMPEG4))
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<_VAPictureParameterBufferMPEG4>())).vop_width as *const _
                as usize
        },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(_VAPictureParameterBufferMPEG4),
            "::",
            stringify!(vop_width)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<_VAPictureParameterBufferMPEG4>())).vop_height as *const _
                as usize
        },
        2usize,
        concat!(
            "Offset of field: ",
            stringify!(_VAPictureParameterBufferMPEG4),
            "::",
            stringify!(vop_height)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<_VAPictureParameterBufferMPEG4>())).forward_reference_picture
                as *const _ as usize
        },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(_VAPictureParameterBufferMPEG4),
            "::",
            stringify!(forward_reference_picture)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<_VAPictureParameterBufferMPEG4>())).backward_reference_picture
                as *const _ as usize
        },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(_VAPictureParameterBufferMPEG4),
            "::",
            stringify!(backward_reference_picture)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<_VAPictureParameterBufferMPEG4>())).vol_fields as *const _
                as usize
        },
        12usize,
        concat!(
            "Offset of field: ",
            stringify!(_VAPictureParameterBufferMPEG4),
            "::",
            stringify!(vol_fields)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<_VAPictureParameterBufferMPEG4>())).no_of_sprite_warping_points
                as *const _ as usize
        },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(_VAPictureParameterBufferMPEG4),
            "::",
            stringify!(no_of_sprite_warping_points)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<_VAPictureParameterBufferMPEG4>())).sprite_trajectory_du
                as *const _ as usize
        },
        18usize,
        concat!(
            "Offset of field: ",
            stringify!(_VAPictureParameterBufferMPEG4),
            "::",
            stringify!(sprite_trajectory_du)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<_VAPictureParameterBufferMPEG4>())).sprite_trajectory_dv
                as *const _ as usize
        },
        24usize,
        concat!(
            "Offset of field: ",
            stringify!(_VAPictureParameterBufferMPEG4),
            "::",
            stringify!(sprite_trajectory_dv)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<_VAPictureParameterBufferMPEG4>())).quant_precision as *const _
                as usize
        },
        30usize,
        concat!(
            "Offset of field: ",
            stringify!(_VAPictureParameterBufferMPEG4),
            "::",
            stringify!(quant_precision)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<_VAPictureParameterBufferMPEG4>())).vop_fields as *const _
                as usize
        },
        32usize,
        concat!(
            "Offset of field: ",
            stringify!(_VAPictureParameterBufferMPEG4),
            "::",
            stringify!(vop_fields)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<_VAPictureParameterBufferMPEG4>())).vop_fcode_forward as *const _
                as usize
        },
        36usize,
        concat!(
            "Offset of field: ",
            stringify!(_VAPictureParameterBufferMPEG4),
            "::",
            stringify!(vop_fcode_forward)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<_VAPictureParameterBufferMPEG4>())).vop_fcode_backward
                as *const _ as usize
        },
        37usize,
        concat!(
            "Offset of field: ",
            stringify!(_VAPictureParameterBufferMPEG4),
            "::",
            stringify!(vop_fcode_backward)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<_VAPictureParameterBufferMPEG4>())).vop_time_increment_resolution
                as *const _ as usize
        },
        38usize,
        concat!(
            "Offset of field: ",
            stringify!(_VAPictureParameterBufferMPEG4),
            "::",
            stringify!(vop_time_increment_resolution)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<_VAPictureParameterBufferMPEG4>())).num_gobs_in_vop as *const _
                as usize
        },
        40usize,
        concat!(
            "Offset of field: ",
            stringify!(_VAPictureParameterBufferMPEG4),
            "::",
            stringify!(num_gobs_in_vop)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<_VAPictureParameterBufferMPEG4>())).num_macroblocks_in_gob
                as *const _ as usize
        },
        41usize,
        concat!(
            "Offset of field: ",
            stringify!(_VAPictureParameterBufferMPEG4),
            "::",
            stringify!(num_macroblocks_in_gob)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<_VAPictureParameterBufferMPEG4>())).TRB as *const _ as usize
        },
        42usize,
        concat!(
            "Offset of field: ",
            stringify!(_VAPictureParameterBufferMPEG4),
            "::",
            stringify!(TRB)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<_VAPictureParameterBufferMPEG4>())).TRD as *const _ as usize
        },
        44usize,
        concat!(
            "Offset of field: ",
            stringify!(_VAPictureParameterBufferMPEG4),
            "::",
            stringify!(TRD)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<_VAPictureParameterBufferMPEG4>())).va_reserved as *const _
                as usize
        },
        48usize,
        concat!(
            "Offset of field: ",
            stringify!(_VAPictureParameterBufferMPEG4),
            "::",
            stringify!(va_reserved)
        )
    );
}
pub type VAPictureParameterBufferMPEG4 = _VAPictureParameterBufferMPEG4;
#[repr(C)]
#[derive(Copy, Clone)]
pub struct _VAIQMatrixBufferMPEG4 {
    pub load_intra_quant_mat: i32,
    pub load_non_intra_quant_mat: i32,
    pub intra_quant_mat: [u8; 64usize],
    pub non_intra_quant_mat: [u8; 64usize],
    pub va_reserved: [u32; 4usize],
}
#[test]
fn bindgen_test_layout__VAIQMatrixBufferMPEG4() {
    assert_eq!(
        ::std::mem::size_of::<_VAIQMatrixBufferMPEG4>(),
        152usize,
        concat!("Size of: ", stringify!(_VAIQMatrixBufferMPEG4))
    );
    assert_eq!(
        ::std::mem::align_of::<_VAIQMatrixBufferMPEG4>(),
        4usize,
        concat!("Alignment of ", stringify!(_VAIQMatrixBufferMPEG4))
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<_VAIQMatrixBufferMPEG4>())).load_intra_quant_mat as *const _
                as usize
        },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(_VAIQMatrixBufferMPEG4),
            "::",
            stringify!(load_intra_quant_mat)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<_VAIQMatrixBufferMPEG4>())).load_non_intra_quant_mat as *const _
                as usize
        },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(_VAIQMatrixBufferMPEG4),
            "::",
            stringify!(load_non_intra_quant_mat)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<_VAIQMatrixBufferMPEG4>())).intra_quant_mat as *const _ as usize
        },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(_VAIQMatrixBufferMPEG4),
            "::",
            stringify!(intra_quant_mat)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<_VAIQMatrixBufferMPEG4>())).non_intra_quant_mat as *const _
                as usize
        },
        72usize,
        concat!(
            "Offset of field: ",
            stringify!(_VAIQMatrixBufferMPEG4),
            "::",
            stringify!(non_intra_quant_mat)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<_VAIQMatrixBufferMPEG4>())).va_reserved as *const _ as usize
        },
        136usize,
        concat!(
            "Offset of field: ",
            stringify!(_VAIQMatrixBufferMPEG4),
            "::",
            stringify!(va_reserved)
        )
    );
}
pub type VAIQMatrixBufferMPEG4 = _VAIQMatrixBufferMPEG4;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct _VASliceParameterBufferMPEG4 {
    pub slice_data_size: u32,
    pub slice_data_offset: u32,
    pub slice_data_flag: u32,
    pub macroblock_offset: u32,
    pub macroblock_number: u32,
    pub quant_scale: i32,
    pub va_reserved: [u32; 4usize],
}
#[test]
fn bindgen_test_layout__VASliceParameterBufferMPEG4() {
    assert_eq!(
        ::std::mem::size_of::<_VASliceParameterBufferMPEG4>(),
        40usize,
        concat!("Size of: ", stringify!(_VASliceParameterBufferMPEG4))
    );
    assert_eq!(
        ::std::mem::align_of::<_VASliceParameterBufferMPEG4>(),
        4usize,
        concat!("Alignment of ", stringify!(_VASliceParameterBufferMPEG4))
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<_VASliceParameterBufferMPEG4>())).slice_data_size as *const _
                as usize
        },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(_VASliceParameterBufferMPEG4),
            "::",
            stringify!(slice_data_size)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<_VASliceParameterBufferMPEG4>())).slice_data_offset as *const _
                as usize
        },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(_VASliceParameterBufferMPEG4),
            "::",
            stringify!(slice_data_offset)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<_VASliceParameterBufferMPEG4>())).slice_data_flag as *const _
                as usize
        },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(_VASliceParameterBufferMPEG4),
            "::",
            stringify!(slice_data_flag)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<_VASliceParameterBufferMPEG4>())).macroblock_offset as *const _
                as usize
        },
        12usize,
        concat!(
            "Offset of field: ",
            stringify!(_VASliceParameterBufferMPEG4),
            "::",
            stringify!(macroblock_offset)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<_VASliceParameterBufferMPEG4>())).macroblock_number as *const _
                as usize
        },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(_VASliceParameterBufferMPEG4),
            "::",
            stringify!(macroblock_number)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<_VASliceParameterBufferMPEG4>())).quant_scale as *const _
                as usize
        },
        20usize,
        concat!(
            "Offset of field: ",
            stringify!(_VASliceParameterBufferMPEG4),
            "::",
            stringify!(quant_scale)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<_VASliceParameterBufferMPEG4>())).va_reserved as *const _
                as usize
        },
        24usize,
        concat!(
            "Offset of field: ",
            stringify!(_VASliceParameterBufferMPEG4),
            "::",
            stringify!(va_reserved)
        )
    );
}
pub type VASliceParameterBufferMPEG4 = _VASliceParameterBufferMPEG4;
pub const VAMvModeVC1_VAMvMode1Mv: VAMvModeVC1 = 0;
pub const VAMvModeVC1_VAMvMode1MvHalfPel: VAMvModeVC1 = 1;
pub const VAMvModeVC1_VAMvMode1MvHalfPelBilinear: VAMvModeVC1 = 2;
pub const VAMvModeVC1_VAMvModeMixedMv: VAMvModeVC1 = 3;
pub const VAMvModeVC1_VAMvModeIntensityCompensation: VAMvModeVC1 = 4;
pub type VAMvModeVC1 = ::std::os::raw::c_uint;
#[repr(C)]
#[derive(Copy, Clone)]
pub struct _VAPictureParameterBufferVC1 {
    pub forward_reference_picture: VASurfaceID,
    pub backward_reference_picture: VASurfaceID,
    pub inloop_decoded_picture: VASurfaceID,
    pub sequence_fields: _VAPictureParameterBufferVC1__bindgen_ty_1,
    pub coded_width: u16,
    pub coded_height: u16,
    pub entrypoint_fields: _VAPictureParameterBufferVC1__bindgen_ty_2,
    pub conditional_overlap_flag: u8,
    pub fast_uvmc_flag: u8,
    pub range_mapping_fields: _VAPictureParameterBufferVC1__bindgen_ty_3,
    pub b_picture_fraction: u8,
    pub cbp_table: u8,
    pub mb_mode_table: u8,
    pub range_reduction_frame: u8,
    pub rounding_control: u8,
    pub post_processing: u8,
    pub picture_resolution_index: u8,
    pub luma_scale: u8,
    pub luma_shift: u8,
    pub picture_fields: _VAPictureParameterBufferVC1__bindgen_ty_4,
    pub raw_coding: _VAPictureParameterBufferVC1__bindgen_ty_5,
    pub bitplane_present: _VAPictureParameterBufferVC1__bindgen_ty_6,
    pub reference_fields: _VAPictureParameterBufferVC1__bindgen_ty_7,
    pub mv_fields: _VAPictureParameterBufferVC1__bindgen_ty_8,
    pub pic_quantizer_fields: _VAPictureParameterBufferVC1__bindgen_ty_9,
    pub transform_fields: _VAPictureParameterBufferVC1__bindgen_ty_10,
    pub luma_scale2: u8,
    pub luma_shift2: u8,
    pub intensity_compensation_field: u8,
    pub va_reserved: [u32; 7usize],
}
#[repr(C)]
#[derive(Copy, Clone)]
pub union _VAPictureParameterBufferVC1__bindgen_ty_1 {
    pub bits: _VAPictureParameterBufferVC1__bindgen_ty_1__bindgen_ty_1,
    pub value: u32,
}
#[repr(C)]
#[repr(align(4))]
#[derive(Debug, Copy, Clone)]
pub struct _VAPictureParameterBufferVC1__bindgen_ty_1__bindgen_ty_1 {
    pub _bitfield_align_1: [u8; 0],
    pub _bitfield_1: __BindgenBitfieldUnit<[u8; 2usize]>,
    pub __bindgen_padding_0: u16,
}
#[test]
fn bindgen_test_layout__VAPictureParameterBufferVC1__bindgen_ty_1__bindgen_ty_1() {
    assert_eq!(
        ::std::mem::size_of::<_VAPictureParameterBufferVC1__bindgen_ty_1__bindgen_ty_1>(),
        4usize,
        concat!(
            "Size of: ",
            stringify!(_VAPictureParameterBufferVC1__bindgen_ty_1__bindgen_ty_1)
        )
    );
    assert_eq!(
        ::std::mem::align_of::<_VAPictureParameterBufferVC1__bindgen_ty_1__bindgen_ty_1>(),
        4usize,
        concat!(
            "Alignment of ",
            stringify!(_VAPictureParameterBufferVC1__bindgen_ty_1__bindgen_ty_1)
        )
    );
}
impl _VAPictureParameterBufferVC1__bindgen_ty_1__bindgen_ty_1 {
    #[inline]
    pub fn pulldown(&self) -> u32 {
        unsafe { ::std::mem::transmute(self._bitfield_1.get(0usize, 1u8) as u32) }
    }
    #[inline]
    pub fn set_pulldown(&mut self, val: u32) {
        unsafe {
            let val: u32 = ::std::mem::transmute(val);
            self._bitfield_1.set(0usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub fn interlace(&self) -> u32 {
        unsafe { ::std::mem::transmute(self._bitfield_1.get(1usize, 1u8) as u32) }
    }
    #[inline]
    pub fn set_interlace(&mut self, val: u32) {
        unsafe {
            let val: u32 = ::std::mem::transmute(val);
            self._bitfield_1.set(1usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub fn tfcntrflag(&self) -> u32 {
        unsafe { ::std::mem::transmute(self._bitfield_1.get(2usize, 1u8) as u32) }
    }
    #[inline]
    pub fn set_tfcntrflag(&mut self, val: u32) {
        unsafe {
            let val: u32 = ::std::mem::transmute(val);
            self._bitfield_1.set(2usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub fn finterpflag(&self) -> u32 {
        unsafe { ::std::mem::transmute(self._bitfield_1.get(3usize, 1u8) as u32) }
    }
    #[inline]
    pub fn set_finterpflag(&mut self, val: u32) {
        unsafe {
            let val: u32 = ::std::mem::transmute(val);
            self._bitfield_1.set(3usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub fn psf(&self) -> u32 {
        unsafe { ::std::mem::transmute(self._bitfield_1.get(4usize, 1u8) as u32) }
    }
    #[inline]
    pub fn set_psf(&mut self, val: u32) {
        unsafe {
            let val: u32 = ::std::mem::transmute(val);
            self._bitfield_1.set(4usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub fn multires(&self) -> u32 {
        unsafe { ::std::mem::transmute(self._bitfield_1.get(5usize, 1u8) as u32) }
    }
    #[inline]
    pub fn set_multires(&mut self, val: u32) {
        unsafe {
            let val: u32 = ::std::mem::transmute(val);
            self._bitfield_1.set(5usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub fn overlap(&self) -> u32 {
        unsafe { ::std::mem::transmute(self._bitfield_1.get(6usize, 1u8) as u32) }
    }
    #[inline]
    pub fn set_overlap(&mut self, val: u32) {
        unsafe {
            let val: u32 = ::std::mem::transmute(val);
            self._bitfield_1.set(6usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub fn syncmarker(&self) -> u32 {
        unsafe { ::std::mem::transmute(self._bitfield_1.get(7usize, 1u8) as u32) }
    }
    #[inline]
    pub fn set_syncmarker(&mut self, val: u32) {
        unsafe {
            let val: u32 = ::std::mem::transmute(val);
            self._bitfield_1.set(7usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub fn rangered(&self) -> u32 {
        unsafe { ::std::mem::transmute(self._bitfield_1.get(8usize, 1u8) as u32) }
    }
    #[inline]
    pub fn set_rangered(&mut self, val: u32) {
        unsafe {
            let val: u32 = ::std::mem::transmute(val);
            self._bitfield_1.set(8usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub fn max_b_frames(&self) -> u32 {
        unsafe { ::std::mem::transmute(self._bitfield_1.get(9usize, 3u8) as u32) }
    }
    #[inline]
    pub fn set_max_b_frames(&mut self, val: u32) {
        unsafe {
            let val: u32 = ::std::mem::transmute(val);
            self._bitfield_1.set(9usize, 3u8, val as u64)
        }
    }
    #[inline]
    pub fn profile(&self) -> u32 {
        unsafe { ::std::mem::transmute(self._bitfield_1.get(12usize, 2u8) as u32) }
    }
    #[inline]
    pub fn set_profile(&mut self, val: u32) {
        unsafe {
            let val: u32 = ::std::mem::transmute(val);
            self._bitfield_1.set(12usize, 2u8, val as u64)
        }
    }
    #[inline]
    pub fn new_bitfield_1(
        pulldown: u32,
        interlace: u32,
        tfcntrflag: u32,
        finterpflag: u32,
        psf: u32,
        multires: u32,
        overlap: u32,
        syncmarker: u32,
        rangered: u32,
        max_b_frames: u32,
        profile: u32,
    ) -> __BindgenBitfieldUnit<[u8; 2usize]> {
        let mut __bindgen_bitfield_unit: __BindgenBitfieldUnit<[u8; 2usize]> = Default::default();
        __bindgen_bitfield_unit.set(0usize, 1u8, {
            let pulldown: u32 = unsafe { ::std::mem::transmute(pulldown) };
            pulldown as u64
        });
        __bindgen_bitfield_unit.set(1usize, 1u8, {
            let interlace: u32 = unsafe { ::std::mem::transmute(interlace) };
            interlace as u64
        });
        __bindgen_bitfield_unit.set(2usize, 1u8, {
            let tfcntrflag: u32 = unsafe { ::std::mem::transmute(tfcntrflag) };
            tfcntrflag as u64
        });
        __bindgen_bitfield_unit.set(3usize, 1u8, {
            let finterpflag: u32 = unsafe { ::std::mem::transmute(finterpflag) };
            finterpflag as u64
        });
        __bindgen_bitfield_unit.set(4usize, 1u8, {
            let psf: u32 = unsafe { ::std::mem::transmute(psf) };
            psf as u64
        });
        __bindgen_bitfield_unit.set(5usize, 1u8, {
            let multires: u32 = unsafe { ::std::mem::transmute(multires) };
            multires as u64
        });
        __bindgen_bitfield_unit.set(6usize, 1u8, {
            let overlap: u32 = unsafe { ::std::mem::transmute(overlap) };
            overlap as u64
        });
        __bindgen_bitfield_unit.set(7usize, 1u8, {
            let syncmarker: u32 = unsafe { ::std::mem::transmute(syncmarker) };
            syncmarker as u64
        });
        __bindgen_bitfield_unit.set(8usize, 1u8, {
            let rangered: u32 = unsafe { ::std::mem::transmute(rangered) };
            rangered as u64
        });
        __bindgen_bitfield_unit.set(9usize, 3u8, {
            let max_b_frames: u32 = unsafe { ::std::mem::transmute(max_b_frames) };
            max_b_frames as u64
        });
        __bindgen_bitfield_unit.set(12usize, 2u8, {
            let profile: u32 = unsafe { ::std::mem::transmute(profile) };
            profile as u64
        });
        __bindgen_bitfield_unit
    }
}
#[test]
fn bindgen_test_layout__VAPictureParameterBufferVC1__bindgen_ty_1() {
    assert_eq!(
        ::std::mem::size_of::<_VAPictureParameterBufferVC1__bindgen_ty_1>(),
        4usize,
        concat!(
            "Size of: ",
            stringify!(_VAPictureParameterBufferVC1__bindgen_ty_1)
        )
    );
    assert_eq!(
        ::std::mem::align_of::<_VAPictureParameterBufferVC1__bindgen_ty_1>(),
        4usize,
        concat!(
            "Alignment of ",
            stringify!(_VAPictureParameterBufferVC1__bindgen_ty_1)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<_VAPictureParameterBufferVC1__bindgen_ty_1>())).bits as *const _
                as usize
        },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(_VAPictureParameterBufferVC1__bindgen_ty_1),
            "::",
            stringify!(bits)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<_VAPictureParameterBufferVC1__bindgen_ty_1>())).value as *const _
                as usize
        },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(_VAPictureParameterBufferVC1__bindgen_ty_1),
            "::",
            stringify!(value)
        )
    );
}
#[repr(C)]
#[derive(Copy, Clone)]
pub union _VAPictureParameterBufferVC1__bindgen_ty_2 {
    pub bits: _VAPictureParameterBufferVC1__bindgen_ty_2__bindgen_ty_1,
    pub value: u32,
}
#[repr(C)]
#[repr(align(4))]
#[derive(Debug, Copy, Clone)]
pub struct _VAPictureParameterBufferVC1__bindgen_ty_2__bindgen_ty_1 {
    pub _bitfield_align_1: [u8; 0],
    pub _bitfield_1: __BindgenBitfieldUnit<[u8; 1usize]>,
    pub __bindgen_padding_0: [u8; 3usize],
}
#[test]
fn bindgen_test_layout__VAPictureParameterBufferVC1__bindgen_ty_2__bindgen_ty_1() {
    assert_eq!(
        ::std::mem::size_of::<_VAPictureParameterBufferVC1__bindgen_ty_2__bindgen_ty_1>(),
        4usize,
        concat!(
            "Size of: ",
            stringify!(_VAPictureParameterBufferVC1__bindgen_ty_2__bindgen_ty_1)
        )
    );
    assert_eq!(
        ::std::mem::align_of::<_VAPictureParameterBufferVC1__bindgen_ty_2__bindgen_ty_1>(),
        4usize,
        concat!(
            "Alignment of ",
            stringify!(_VAPictureParameterBufferVC1__bindgen_ty_2__bindgen_ty_1)
        )
    );
}
impl _VAPictureParameterBufferVC1__bindgen_ty_2__bindgen_ty_1 {
    #[inline]
    pub fn broken_link(&self) -> u32 {
        unsafe { ::std::mem::transmute(self._bitfield_1.get(0usize, 1u8) as u32) }
    }
    #[inline]
    pub fn set_broken_link(&mut self, val: u32) {
        unsafe {
            let val: u32 = ::std::mem::transmute(val);
            self._bitfield_1.set(0usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub fn closed_entry(&self) -> u32 {
        unsafe { ::std::mem::transmute(self._bitfield_1.get(1usize, 1u8) as u32) }
    }
    #[inline]
    pub fn set_closed_entry(&mut self, val: u32) {
        unsafe {
            let val: u32 = ::std::mem::transmute(val);
            self._bitfield_1.set(1usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub fn panscan_flag(&self) -> u32 {
        unsafe { ::std::mem::transmute(self._bitfield_1.get(2usize, 1u8) as u32) }
    }
    #[inline]
    pub fn set_panscan_flag(&mut self, val: u32) {
        unsafe {
            let val: u32 = ::std::mem::transmute(val);
            self._bitfield_1.set(2usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub fn loopfilter(&self) -> u32 {
        unsafe { ::std::mem::transmute(self._bitfield_1.get(3usize, 1u8) as u32) }
    }
    #[inline]
    pub fn set_loopfilter(&mut self, val: u32) {
        unsafe {
            let val: u32 = ::std::mem::transmute(val);
            self._bitfield_1.set(3usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub fn new_bitfield_1(
        broken_link: u32,
        closed_entry: u32,
        panscan_flag: u32,
        loopfilter: u32,
    ) -> __BindgenBitfieldUnit<[u8; 1usize]> {
        let mut __bindgen_bitfield_unit: __BindgenBitfieldUnit<[u8; 1usize]> = Default::default();
        __bindgen_bitfield_unit.set(0usize, 1u8, {
            let broken_link: u32 = unsafe { ::std::mem::transmute(broken_link) };
            broken_link as u64
        });
        __bindgen_bitfield_unit.set(1usize, 1u8, {
            let closed_entry: u32 = unsafe { ::std::mem::transmute(closed_entry) };
            closed_entry as u64
        });
        __bindgen_bitfield_unit.set(2usize, 1u8, {
            let panscan_flag: u32 = unsafe { ::std::mem::transmute(panscan_flag) };
            panscan_flag as u64
        });
        __bindgen_bitfield_unit.set(3usize, 1u8, {
            let loopfilter: u32 = unsafe { ::std::mem::transmute(loopfilter) };
            loopfilter as u64
        });
        __bindgen_bitfield_unit
    }
}
#[test]
fn bindgen_test_layout__VAPictureParameterBufferVC1__bindgen_ty_2() {
    assert_eq!(
        ::std::mem::size_of::<_VAPictureParameterBufferVC1__bindgen_ty_2>(),
        4usize,
        concat!(
            "Size of: ",
            stringify!(_VAPictureParameterBufferVC1__bindgen_ty_2)
        )
    );
    assert_eq!(
        ::std::mem::align_of::<_VAPictureParameterBufferVC1__bindgen_ty_2>(),
        4usize,
        concat!(
            "Alignment of ",
            stringify!(_VAPictureParameterBufferVC1__bindgen_ty_2)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<_VAPictureParameterBufferVC1__bindgen_ty_2>())).bits as *const _
                as usize
        },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(_VAPictureParameterBufferVC1__bindgen_ty_2),
            "::",
            stringify!(bits)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<_VAPictureParameterBufferVC1__bindgen_ty_2>())).value as *const _
                as usize
        },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(_VAPictureParameterBufferVC1__bindgen_ty_2),
            "::",
            stringify!(value)
        )
    );
}
#[repr(C)]
#[derive(Copy, Clone)]
pub union _VAPictureParameterBufferVC1__bindgen_ty_3 {
    pub bits: _VAPictureParameterBufferVC1__bindgen_ty_3__bindgen_ty_1,
    pub value: u32,
}
#[repr(C)]
#[repr(align(4))]
#[derive(Debug, Copy, Clone)]
pub struct _VAPictureParameterBufferVC1__bindgen_ty_3__bindgen_ty_1 {
    pub _bitfield_align_1: [u8; 0],
    pub _bitfield_1: __BindgenBitfieldUnit<[u8; 1usize]>,
    pub __bindgen_padding_0: [u8; 3usize],
}
#[test]
fn bindgen_test_layout__VAPictureParameterBufferVC1__bindgen_ty_3__bindgen_ty_1() {
    assert_eq!(
        ::std::mem::size_of::<_VAPictureParameterBufferVC1__bindgen_ty_3__bindgen_ty_1>(),
        4usize,
        concat!(
            "Size of: ",
            stringify!(_VAPictureParameterBufferVC1__bindgen_ty_3__bindgen_ty_1)
        )
    );
    assert_eq!(
        ::std::mem::align_of::<_VAPictureParameterBufferVC1__bindgen_ty_3__bindgen_ty_1>(),
        4usize,
        concat!(
            "Alignment of ",
            stringify!(_VAPictureParameterBufferVC1__bindgen_ty_3__bindgen_ty_1)
        )
    );
}
impl _VAPictureParameterBufferVC1__bindgen_ty_3__bindgen_ty_1 {
    #[inline]
    pub fn luma_flag(&self) -> u32 {
        unsafe { ::std::mem::transmute(self._bitfield_1.get(0usize, 1u8) as u32) }
    }
    #[inline]
    pub fn set_luma_flag(&mut self, val: u32) {
        unsafe {
            let val: u32 = ::std::mem::transmute(val);
            self._bitfield_1.set(0usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub fn luma(&self) -> u32 {
        unsafe { ::std::mem::transmute(self._bitfield_1.get(1usize, 3u8) as u32) }
    }
    #[inline]
    pub fn set_luma(&mut self, val: u32) {
        unsafe {
            let val: u32 = ::std::mem::transmute(val);
            self._bitfield_1.set(1usize, 3u8, val as u64)
        }
    }
    #[inline]
    pub fn chroma_flag(&self) -> u32 {
        unsafe { ::std::mem::transmute(self._bitfield_1.get(4usize, 1u8) as u32) }
    }
    #[inline]
    pub fn set_chroma_flag(&mut self, val: u32) {
        unsafe {
            let val: u32 = ::std::mem::transmute(val);
            self._bitfield_1.set(4usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub fn chroma(&self) -> u32 {
        unsafe { ::std::mem::transmute(self._bitfield_1.get(5usize, 3u8) as u32) }
    }
    #[inline]
    pub fn set_chroma(&mut self, val: u32) {
        unsafe {
            let val: u32 = ::std::mem::transmute(val);
            self._bitfield_1.set(5usize, 3u8, val as u64)
        }
    }
    #[inline]
    pub fn new_bitfield_1(
        luma_flag: u32,
        luma: u32,
        chroma_flag: u32,
        chroma: u32,
    ) -> __BindgenBitfieldUnit<[u8; 1usize]> {
        let mut __bindgen_bitfield_unit: __BindgenBitfieldUnit<[u8; 1usize]> = Default::default();
        __bindgen_bitfield_unit.set(0usize, 1u8, {
            let luma_flag: u32 = unsafe { ::std::mem::transmute(luma_flag) };
            luma_flag as u64
        });
        __bindgen_bitfield_unit.set(1usize, 3u8, {
            let luma: u32 = unsafe { ::std::mem::transmute(luma) };
            luma as u64
        });
        __bindgen_bitfield_unit.set(4usize, 1u8, {
            let chroma_flag: u32 = unsafe { ::std::mem::transmute(chroma_flag) };
            chroma_flag as u64
        });
        __bindgen_bitfield_unit.set(5usize, 3u8, {
            let chroma: u32 = unsafe { ::std::mem::transmute(chroma) };
            chroma as u64
        });
        __bindgen_bitfield_unit
    }
}
#[test]
fn bindgen_test_layout__VAPictureParameterBufferVC1__bindgen_ty_3() {
    assert_eq!(
        ::std::mem::size_of::<_VAPictureParameterBufferVC1__bindgen_ty_3>(),
        4usize,
        concat!(
            "Size of: ",
            stringify!(_VAPictureParameterBufferVC1__bindgen_ty_3)
        )
    );
    assert_eq!(
        ::std::mem::align_of::<_VAPictureParameterBufferVC1__bindgen_ty_3>(),
        4usize,
        concat!(
            "Alignment of ",
            stringify!(_VAPictureParameterBufferVC1__bindgen_ty_3)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<_VAPictureParameterBufferVC1__bindgen_ty_3>())).bits as *const _
                as usize
        },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(_VAPictureParameterBufferVC1__bindgen_ty_3),
            "::",
            stringify!(bits)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<_VAPictureParameterBufferVC1__bindgen_ty_3>())).value as *const _
                as usize
        },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(_VAPictureParameterBufferVC1__bindgen_ty_3),
            "::",
            stringify!(value)
        )
    );
}
#[repr(C)]
#[derive(Copy, Clone)]
pub union _VAPictureParameterBufferVC1__bindgen_ty_4 {
    pub bits: _VAPictureParameterBufferVC1__bindgen_ty_4__bindgen_ty_1,
    pub value: u32,
}
#[repr(C)]
#[repr(align(4))]
#[derive(Debug, Copy, Clone)]
pub struct _VAPictureParameterBufferVC1__bindgen_ty_4__bindgen_ty_1 {
    pub _bitfield_align_1: [u8; 0],
    pub _bitfield_1: __BindgenBitfieldUnit<[u8; 2usize]>,
    pub __bindgen_padding_0: u16,
}
#[test]
fn bindgen_test_layout__VAPictureParameterBufferVC1__bindgen_ty_4__bindgen_ty_1() {
    assert_eq!(
        ::std::mem::size_of::<_VAPictureParameterBufferVC1__bindgen_ty_4__bindgen_ty_1>(),
        4usize,
        concat!(
            "Size of: ",
            stringify!(_VAPictureParameterBufferVC1__bindgen_ty_4__bindgen_ty_1)
        )
    );
    assert_eq!(
        ::std::mem::align_of::<_VAPictureParameterBufferVC1__bindgen_ty_4__bindgen_ty_1>(),
        4usize,
        concat!(
            "Alignment of ",
            stringify!(_VAPictureParameterBufferVC1__bindgen_ty_4__bindgen_ty_1)
        )
    );
}
impl _VAPictureParameterBufferVC1__bindgen_ty_4__bindgen_ty_1 {
    #[inline]
    pub fn picture_type(&self) -> u32 {
        unsafe { ::std::mem::transmute(self._bitfield_1.get(0usize, 3u8) as u32) }
    }
    #[inline]
    pub fn set_picture_type(&mut self, val: u32) {
        unsafe {
            let val: u32 = ::std::mem::transmute(val);
            self._bitfield_1.set(0usize, 3u8, val as u64)
        }
    }
    #[inline]
    pub fn frame_coding_mode(&self) -> u32 {
        unsafe { ::std::mem::transmute(self._bitfield_1.get(3usize, 3u8) as u32) }
    }
    #[inline]
    pub fn set_frame_coding_mode(&mut self, val: u32) {
        unsafe {
            let val: u32 = ::std::mem::transmute(val);
            self._bitfield_1.set(3usize, 3u8, val as u64)
        }
    }
    #[inline]
    pub fn top_field_first(&self) -> u32 {
        unsafe { ::std::mem::transmute(self._bitfield_1.get(6usize, 1u8) as u32) }
    }
    #[inline]
    pub fn set_top_field_first(&mut self, val: u32) {
        unsafe {
            let val: u32 = ::std::mem::transmute(val);
            self._bitfield_1.set(6usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub fn is_first_field(&self) -> u32 {
        unsafe { ::std::mem::transmute(self._bitfield_1.get(7usize, 1u8) as u32) }
    }
    #[inline]
    pub fn set_is_first_field(&mut self, val: u32) {
        unsafe {
            let val: u32 = ::std::mem::transmute(val);
            self._bitfield_1.set(7usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub fn intensity_compensation(&self) -> u32 {
        unsafe { ::std::mem::transmute(self._bitfield_1.get(8usize, 1u8) as u32) }
    }
    #[inline]
    pub fn set_intensity_compensation(&mut self, val: u32) {
        unsafe {
            let val: u32 = ::std::mem::transmute(val);
            self._bitfield_1.set(8usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub fn new_bitfield_1(
        picture_type: u32,
        frame_coding_mode: u32,
        top_field_first: u32,
        is_first_field: u32,
        intensity_compensation: u32,
    ) -> __BindgenBitfieldUnit<[u8; 2usize]> {
        let mut __bindgen_bitfield_unit: __BindgenBitfieldUnit<[u8; 2usize]> = Default::default();
        __bindgen_bitfield_unit.set(0usize, 3u8, {
            let picture_type: u32 = unsafe { ::std::mem::transmute(picture_type) };
            picture_type as u64
        });
        __bindgen_bitfield_unit.set(3usize, 3u8, {
            let frame_coding_mode: u32 = unsafe { ::std::mem::transmute(frame_coding_mode) };
            frame_coding_mode as u64
        });
        __bindgen_bitfield_unit.set(6usize, 1u8, {
            let top_field_first: u32 = unsafe { ::std::mem::transmute(top_field_first) };
            top_field_first as u64
        });
        __bindgen_bitfield_unit.set(7usize, 1u8, {
            let is_first_field: u32 = unsafe { ::std::mem::transmute(is_first_field) };
            is_first_field as u64
        });
        __bindgen_bitfield_unit.set(8usize, 1u8, {
            let intensity_compensation: u32 =
                unsafe { ::std::mem::transmute(intensity_compensation) };
            intensity_compensation as u64
        });
        __bindgen_bitfield_unit
    }
}
#[test]
fn bindgen_test_layout__VAPictureParameterBufferVC1__bindgen_ty_4() {
    assert_eq!(
        ::std::mem::size_of::<_VAPictureParameterBufferVC1__bindgen_ty_4>(),
        4usize,
        concat!(
            "Size of: ",
            stringify!(_VAPictureParameterBufferVC1__bindgen_ty_4)
        )
    );
    assert_eq!(
        ::std::mem::align_of::<_VAPictureParameterBufferVC1__bindgen_ty_4>(),
        4usize,
        concat!(
            "Alignment of ",
            stringify!(_VAPictureParameterBufferVC1__bindgen_ty_4)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<_VAPictureParameterBufferVC1__bindgen_ty_4>())).bits as *const _
                as usize
        },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(_VAPictureParameterBufferVC1__bindgen_ty_4),
            "::",
            stringify!(bits)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<_VAPictureParameterBufferVC1__bindgen_ty_4>())).value as *const _
                as usize
        },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(_VAPictureParameterBufferVC1__bindgen_ty_4),
            "::",
            stringify!(value)
        )
    );
}
#[repr(C)]
#[derive(Copy, Clone)]
pub union _VAPictureParameterBufferVC1__bindgen_ty_5 {
    pub flags: _VAPictureParameterBufferVC1__bindgen_ty_5__bindgen_ty_1,
    pub value: u32,
}
#[repr(C)]
#[repr(align(4))]
#[derive(Debug, Copy, Clone)]
pub struct _VAPictureParameterBufferVC1__bindgen_ty_5__bindgen_ty_1 {
    pub _bitfield_align_1: [u8; 0],
    pub _bitfield_1: __BindgenBitfieldUnit<[u8; 1usize]>,
    pub __bindgen_padding_0: [u8; 3usize],
}
#[test]
fn bindgen_test_layout__VAPictureParameterBufferVC1__bindgen_ty_5__bindgen_ty_1() {
    assert_eq!(
        ::std::mem::size_of::<_VAPictureParameterBufferVC1__bindgen_ty_5__bindgen_ty_1>(),
        4usize,
        concat!(
            "Size of: ",
            stringify!(_VAPictureParameterBufferVC1__bindgen_ty_5__bindgen_ty_1)
        )
    );
    assert_eq!(
        ::std::mem::align_of::<_VAPictureParameterBufferVC1__bindgen_ty_5__bindgen_ty_1>(),
        4usize,
        concat!(
            "Alignment of ",
            stringify!(_VAPictureParameterBufferVC1__bindgen_ty_5__bindgen_ty_1)
        )
    );
}
impl _VAPictureParameterBufferVC1__bindgen_ty_5__bindgen_ty_1 {
    #[inline]
    pub fn mv_type_mb(&self) -> u32 {
        unsafe { ::std::mem::transmute(self._bitfield_1.get(0usize, 1u8) as u32) }
    }
    #[inline]
    pub fn set_mv_type_mb(&mut self, val: u32) {
        unsafe {
            let val: u32 = ::std::mem::transmute(val);
            self._bitfield_1.set(0usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub fn direct_mb(&self) -> u32 {
        unsafe { ::std::mem::transmute(self._bitfield_1.get(1usize, 1u8) as u32) }
    }
    #[inline]
    pub fn set_direct_mb(&mut self, val: u32) {
        unsafe {
            let val: u32 = ::std::mem::transmute(val);
            self._bitfield_1.set(1usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub fn skip_mb(&self) -> u32 {
        unsafe { ::std::mem::transmute(self._bitfield_1.get(2usize, 1u8) as u32) }
    }
    #[inline]
    pub fn set_skip_mb(&mut self, val: u32) {
        unsafe {
            let val: u32 = ::std::mem::transmute(val);
            self._bitfield_1.set(2usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub fn field_tx(&self) -> u32 {
        unsafe { ::std::mem::transmute(self._bitfield_1.get(3usize, 1u8) as u32) }
    }
    #[inline]
    pub fn set_field_tx(&mut self, val: u32) {
        unsafe {
            let val: u32 = ::std::mem::transmute(val);
            self._bitfield_1.set(3usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub fn forward_mb(&self) -> u32 {
        unsafe { ::std::mem::transmute(self._bitfield_1.get(4usize, 1u8) as u32) }
    }
    #[inline]
    pub fn set_forward_mb(&mut self, val: u32) {
        unsafe {
            let val: u32 = ::std::mem::transmute(val);
            self._bitfield_1.set(4usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub fn ac_pred(&self) -> u32 {
        unsafe { ::std::mem::transmute(self._bitfield_1.get(5usize, 1u8) as u32) }
    }
    #[inline]
    pub fn set_ac_pred(&mut self, val: u32) {
        unsafe {
            let val: u32 = ::std::mem::transmute(val);
            self._bitfield_1.set(5usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub fn overflags(&self) -> u32 {
        unsafe { ::std::mem::transmute(self._bitfield_1.get(6usize, 1u8) as u32) }
    }
    #[inline]
    pub fn set_overflags(&mut self, val: u32) {
        unsafe {
            let val: u32 = ::std::mem::transmute(val);
            self._bitfield_1.set(6usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub fn new_bitfield_1(
        mv_type_mb: u32,
        direct_mb: u32,
        skip_mb: u32,
        field_tx: u32,
        forward_mb: u32,
        ac_pred: u32,
        overflags: u32,
    ) -> __BindgenBitfieldUnit<[u8; 1usize]> {
        let mut __bindgen_bitfield_unit: __BindgenBitfieldUnit<[u8; 1usize]> = Default::default();
        __bindgen_bitfield_unit.set(0usize, 1u8, {
            let mv_type_mb: u32 = unsafe { ::std::mem::transmute(mv_type_mb) };
            mv_type_mb as u64
        });
        __bindgen_bitfield_unit.set(1usize, 1u8, {
            let direct_mb: u32 = unsafe { ::std::mem::transmute(direct_mb) };
            direct_mb as u64
        });
        __bindgen_bitfield_unit.set(2usize, 1u8, {
            let skip_mb: u32 = unsafe { ::std::mem::transmute(skip_mb) };
            skip_mb as u64
        });
        __bindgen_bitfield_unit.set(3usize, 1u8, {
            let field_tx: u32 = unsafe { ::std::mem::transmute(field_tx) };
            field_tx as u64
        });
        __bindgen_bitfield_unit.set(4usize, 1u8, {
            let forward_mb: u32 = unsafe { ::std::mem::transmute(forward_mb) };
            forward_mb as u64
        });
        __bindgen_bitfield_unit.set(5usize, 1u8, {
            let ac_pred: u32 = unsafe { ::std::mem::transmute(ac_pred) };
            ac_pred as u64
        });
        __bindgen_bitfield_unit.set(6usize, 1u8, {
            let overflags: u32 = unsafe { ::std::mem::transmute(overflags) };
            overflags as u64
        });
        __bindgen_bitfield_unit
    }
}
#[test]
fn bindgen_test_layout__VAPictureParameterBufferVC1__bindgen_ty_5() {
    assert_eq!(
        ::std::mem::size_of::<_VAPictureParameterBufferVC1__bindgen_ty_5>(),
        4usize,
        concat!(
            "Size of: ",
            stringify!(_VAPictureParameterBufferVC1__bindgen_ty_5)
        )
    );
    assert_eq!(
        ::std::mem::align_of::<_VAPictureParameterBufferVC1__bindgen_ty_5>(),
        4usize,
        concat!(
            "Alignment of ",
            stringify!(_VAPictureParameterBufferVC1__bindgen_ty_5)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<_VAPictureParameterBufferVC1__bindgen_ty_5>())).flags as *const _
                as usize
        },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(_VAPictureParameterBufferVC1__bindgen_ty_5),
            "::",
            stringify!(flags)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<_VAPictureParameterBufferVC1__bindgen_ty_5>())).value as *const _
                as usize
        },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(_VAPictureParameterBufferVC1__bindgen_ty_5),
            "::",
            stringify!(value)
        )
    );
}
#[repr(C)]
#[derive(Copy, Clone)]
pub union _VAPictureParameterBufferVC1__bindgen_ty_6 {
    pub flags: _VAPictureParameterBufferVC1__bindgen_ty_6__bindgen_ty_1,
    pub value: u32,
}
#[repr(C)]
#[repr(align(4))]
#[derive(Debug, Copy, Clone)]
pub struct _VAPictureParameterBufferVC1__bindgen_ty_6__bindgen_ty_1 {
    pub _bitfield_align_1: [u8; 0],
    pub _bitfield_1: __BindgenBitfieldUnit<[u8; 1usize]>,
    pub __bindgen_padding_0: [u8; 3usize],
}
#[test]
fn bindgen_test_layout__VAPictureParameterBufferVC1__bindgen_ty_6__bindgen_ty_1() {
    assert_eq!(
        ::std::mem::size_of::<_VAPictureParameterBufferVC1__bindgen_ty_6__bindgen_ty_1>(),
        4usize,
        concat!(
            "Size of: ",
            stringify!(_VAPictureParameterBufferVC1__bindgen_ty_6__bindgen_ty_1)
        )
    );
    assert_eq!(
        ::std::mem::align_of::<_VAPictureParameterBufferVC1__bindgen_ty_6__bindgen_ty_1>(),
        4usize,
        concat!(
            "Alignment of ",
            stringify!(_VAPictureParameterBufferVC1__bindgen_ty_6__bindgen_ty_1)
        )
    );
}
impl _VAPictureParameterBufferVC1__bindgen_ty_6__bindgen_ty_1 {
    #[inline]
    pub fn bp_mv_type_mb(&self) -> u32 {
        unsafe { ::std::mem::transmute(self._bitfield_1.get(0usize, 1u8) as u32) }
    }
    #[inline]
    pub fn set_bp_mv_type_mb(&mut self, val: u32) {
        unsafe {
            let val: u32 = ::std::mem::transmute(val);
            self._bitfield_1.set(0usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub fn bp_direct_mb(&self) -> u32 {
        unsafe { ::std::mem::transmute(self._bitfield_1.get(1usize, 1u8) as u32) }
    }
    #[inline]
    pub fn set_bp_direct_mb(&mut self, val: u32) {
        unsafe {
            let val: u32 = ::std::mem::transmute(val);
            self._bitfield_1.set(1usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub fn bp_skip_mb(&self) -> u32 {
        unsafe { ::std::mem::transmute(self._bitfield_1.get(2usize, 1u8) as u32) }
    }
    #[inline]
    pub fn set_bp_skip_mb(&mut self, val: u32) {
        unsafe {
            let val: u32 = ::std::mem::transmute(val);
            self._bitfield_1.set(2usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub fn bp_field_tx(&self) -> u32 {
        unsafe { ::std::mem::transmute(self._bitfield_1.get(3usize, 1u8) as u32) }
    }
    #[inline]
    pub fn set_bp_field_tx(&mut self, val: u32) {
        unsafe {
            let val: u32 = ::std::mem::transmute(val);
            self._bitfield_1.set(3usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub fn bp_forward_mb(&self) -> u32 {
        unsafe { ::std::mem::transmute(self._bitfield_1.get(4usize, 1u8) as u32) }
    }
    #[inline]
    pub fn set_bp_forward_mb(&mut self, val: u32) {
        unsafe {
            let val: u32 = ::std::mem::transmute(val);
            self._bitfield_1.set(4usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub fn bp_ac_pred(&self) -> u32 {
        unsafe { ::std::mem::transmute(self._bitfield_1.get(5usize, 1u8) as u32) }
    }
    #[inline]
    pub fn set_bp_ac_pred(&mut self, val: u32) {
        unsafe {
            let val: u32 = ::std::mem::transmute(val);
            self._bitfield_1.set(5usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub fn bp_overflags(&self) -> u32 {
        unsafe { ::std::mem::transmute(self._bitfield_1.get(6usize, 1u8) as u32) }
    }
    #[inline]
    pub fn set_bp_overflags(&mut self, val: u32) {
        unsafe {
            let val: u32 = ::std::mem::transmute(val);
            self._bitfield_1.set(6usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub fn new_bitfield_1(
        bp_mv_type_mb: u32,
        bp_direct_mb: u32,
        bp_skip_mb: u32,
        bp_field_tx: u32,
        bp_forward_mb: u32,
        bp_ac_pred: u32,
        bp_overflags: u32,
    ) -> __BindgenBitfieldUnit<[u8; 1usize]> {
        let mut __bindgen_bitfield_unit: __BindgenBitfieldUnit<[u8; 1usize]> = Default::default();
        __bindgen_bitfield_unit.set(0usize, 1u8, {
            let bp_mv_type_mb: u32 = unsafe { ::std::mem::transmute(bp_mv_type_mb) };
            bp_mv_type_mb as u64
        });
        __bindgen_bitfield_unit.set(1usize, 1u8, {
            let bp_direct_mb: u32 = unsafe { ::std::mem::transmute(bp_direct_mb) };
            bp_direct_mb as u64
        });
        __bindgen_bitfield_unit.set(2usize, 1u8, {
            let bp_skip_mb: u32 = unsafe { ::std::mem::transmute(bp_skip_mb) };
            bp_skip_mb as u64
        });
        __bindgen_bitfield_unit.set(3usize, 1u8, {
            let bp_field_tx: u32 = unsafe { ::std::mem::transmute(bp_field_tx) };
            bp_field_tx as u64
        });
        __bindgen_bitfield_unit.set(4usize, 1u8, {
            let bp_forward_mb: u32 = unsafe { ::std::mem::transmute(bp_forward_mb) };
            bp_forward_mb as u64
        });
        __bindgen_bitfield_unit.set(5usize, 1u8, {
            let bp_ac_pred: u32 = unsafe { ::std::mem::transmute(bp_ac_pred) };
            bp_ac_pred as u64
        });
        __bindgen_bitfield_unit.set(6usize, 1u8, {
            let bp_overflags: u32 = unsafe { ::std::mem::transmute(bp_overflags) };
            bp_overflags as u64
        });
        __bindgen_bitfield_unit
    }
}
#[test]
fn bindgen_test_layout__VAPictureParameterBufferVC1__bindgen_ty_6() {
    assert_eq!(
        ::std::mem::size_of::<_VAPictureParameterBufferVC1__bindgen_ty_6>(),
        4usize,
        concat!(
            "Size of: ",
            stringify!(_VAPictureParameterBufferVC1__bindgen_ty_6)
        )
    );
    assert_eq!(
        ::std::mem::align_of::<_VAPictureParameterBufferVC1__bindgen_ty_6>(),
        4usize,
        concat!(
            "Alignment of ",
            stringify!(_VAPictureParameterBufferVC1__bindgen_ty_6)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<_VAPictureParameterBufferVC1__bindgen_ty_6>())).flags as *const _
                as usize
        },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(_VAPictureParameterBufferVC1__bindgen_ty_6),
            "::",
            stringify!(flags)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<_VAPictureParameterBufferVC1__bindgen_ty_6>())).value as *const _
                as usize
        },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(_VAPictureParameterBufferVC1__bindgen_ty_6),
            "::",
            stringify!(value)
        )
    );
}
#[repr(C)]
#[derive(Copy, Clone)]
pub union _VAPictureParameterBufferVC1__bindgen_ty_7 {
    pub bits: _VAPictureParameterBufferVC1__bindgen_ty_7__bindgen_ty_1,
    pub value: u32,
}
#[repr(C)]
#[repr(align(4))]
#[derive(Debug, Copy, Clone)]
pub struct _VAPictureParameterBufferVC1__bindgen_ty_7__bindgen_ty_1 {
    pub _bitfield_align_1: [u8; 0],
    pub _bitfield_1: __BindgenBitfieldUnit<[u8; 1usize]>,
    pub __bindgen_padding_0: [u8; 3usize],
}
#[test]
fn bindgen_test_layout__VAPictureParameterBufferVC1__bindgen_ty_7__bindgen_ty_1() {
    assert_eq!(
        ::std::mem::size_of::<_VAPictureParameterBufferVC1__bindgen_ty_7__bindgen_ty_1>(),
        4usize,
        concat!(
            "Size of: ",
            stringify!(_VAPictureParameterBufferVC1__bindgen_ty_7__bindgen_ty_1)
        )
    );
    assert_eq!(
        ::std::mem::align_of::<_VAPictureParameterBufferVC1__bindgen_ty_7__bindgen_ty_1>(),
        4usize,
        concat!(
            "Alignment of ",
            stringify!(_VAPictureParameterBufferVC1__bindgen_ty_7__bindgen_ty_1)
        )
    );
}
impl _VAPictureParameterBufferVC1__bindgen_ty_7__bindgen_ty_1 {
    #[inline]
    pub fn reference_distance_flag(&self) -> u32 {
        unsafe { ::std::mem::transmute(self._bitfield_1.get(0usize, 1u8) as u32) }
    }
    #[inline]
    pub fn set_reference_distance_flag(&mut self, val: u32) {
        unsafe {
            let val: u32 = ::std::mem::transmute(val);
            self._bitfield_1.set(0usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub fn reference_distance(&self) -> u32 {
        unsafe { ::std::mem::transmute(self._bitfield_1.get(1usize, 5u8) as u32) }
    }
    #[inline]
    pub fn set_reference_distance(&mut self, val: u32) {
        unsafe {
            let val: u32 = ::std::mem::transmute(val);
            self._bitfield_1.set(1usize, 5u8, val as u64)
        }
    }
    #[inline]
    pub fn num_reference_pictures(&self) -> u32 {
        unsafe { ::std::mem::transmute(self._bitfield_1.get(6usize, 1u8) as u32) }
    }
    #[inline]
    pub fn set_num_reference_pictures(&mut self, val: u32) {
        unsafe {
            let val: u32 = ::std::mem::transmute(val);
            self._bitfield_1.set(6usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub fn reference_field_pic_indicator(&self) -> u32 {
        unsafe { ::std::mem::transmute(self._bitfield_1.get(7usize, 1u8) as u32) }
    }
    #[inline]
    pub fn set_reference_field_pic_indicator(&mut self, val: u32) {
        unsafe {
            let val: u32 = ::std::mem::transmute(val);
            self._bitfield_1.set(7usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub fn new_bitfield_1(
        reference_distance_flag: u32,
        reference_distance: u32,
        num_reference_pictures: u32,
        reference_field_pic_indicator: u32,
    ) -> __BindgenBitfieldUnit<[u8; 1usize]> {
        let mut __bindgen_bitfield_unit: __BindgenBitfieldUnit<[u8; 1usize]> = Default::default();
        __bindgen_bitfield_unit.set(0usize, 1u8, {
            let reference_distance_flag: u32 =
                unsafe { ::std::mem::transmute(reference_distance_flag) };
            reference_distance_flag as u64
        });
        __bindgen_bitfield_unit.set(1usize, 5u8, {
            let reference_distance: u32 = unsafe { ::std::mem::transmute(reference_distance) };
            reference_distance as u64
        });
        __bindgen_bitfield_unit.set(6usize, 1u8, {
            let num_reference_pictures: u32 =
                unsafe { ::std::mem::transmute(num_reference_pictures) };
            num_reference_pictures as u64
        });
        __bindgen_bitfield_unit.set(7usize, 1u8, {
            let reference_field_pic_indicator: u32 =
                unsafe { ::std::mem::transmute(reference_field_pic_indicator) };
            reference_field_pic_indicator as u64
        });
        __bindgen_bitfield_unit
    }
}
#[test]
fn bindgen_test_layout__VAPictureParameterBufferVC1__bindgen_ty_7() {
    assert_eq!(
        ::std::mem::size_of::<_VAPictureParameterBufferVC1__bindgen_ty_7>(),
        4usize,
        concat!(
            "Size of: ",
            stringify!(_VAPictureParameterBufferVC1__bindgen_ty_7)
        )
    );
    assert_eq!(
        ::std::mem::align_of::<_VAPictureParameterBufferVC1__bindgen_ty_7>(),
        4usize,
        concat!(
            "Alignment of ",
            stringify!(_VAPictureParameterBufferVC1__bindgen_ty_7)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<_VAPictureParameterBufferVC1__bindgen_ty_7>())).bits as *const _
                as usize
        },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(_VAPictureParameterBufferVC1__bindgen_ty_7),
            "::",
            stringify!(bits)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<_VAPictureParameterBufferVC1__bindgen_ty_7>())).value as *const _
                as usize
        },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(_VAPictureParameterBufferVC1__bindgen_ty_7),
            "::",
            stringify!(value)
        )
    );
}
#[repr(C)]
#[derive(Copy, Clone)]
pub union _VAPictureParameterBufferVC1__bindgen_ty_8 {
    pub bits: _VAPictureParameterBufferVC1__bindgen_ty_8__bindgen_ty_1,
    pub value: u32,
}
#[repr(C)]
#[repr(align(4))]
#[derive(Debug, Copy, Clone)]
pub struct _VAPictureParameterBufferVC1__bindgen_ty_8__bindgen_ty_1 {
    pub _bitfield_align_1: [u8; 0],
    pub _bitfield_1: __BindgenBitfieldUnit<[u8; 3usize]>,
    pub __bindgen_padding_0: u8,
}
#[test]
fn bindgen_test_layout__VAPictureParameterBufferVC1__bindgen_ty_8__bindgen_ty_1() {
    assert_eq!(
        ::std::mem::size_of::<_VAPictureParameterBufferVC1__bindgen_ty_8__bindgen_ty_1>(),
        4usize,
        concat!(
            "Size of: ",
            stringify!(_VAPictureParameterBufferVC1__bindgen_ty_8__bindgen_ty_1)
        )
    );
    assert_eq!(
        ::std::mem::align_of::<_VAPictureParameterBufferVC1__bindgen_ty_8__bindgen_ty_1>(),
        4usize,
        concat!(
            "Alignment of ",
            stringify!(_VAPictureParameterBufferVC1__bindgen_ty_8__bindgen_ty_1)
        )
    );
}
impl _VAPictureParameterBufferVC1__bindgen_ty_8__bindgen_ty_1 {
    #[inline]
    pub fn mv_mode(&self) -> u32 {
        unsafe { ::std::mem::transmute(self._bitfield_1.get(0usize, 3u8) as u32) }
    }
    #[inline]
    pub fn set_mv_mode(&mut self, val: u32) {
        unsafe {
            let val: u32 = ::std::mem::transmute(val);
            self._bitfield_1.set(0usize, 3u8, val as u64)
        }
    }
    #[inline]
    pub fn mv_mode2(&self) -> u32 {
        unsafe { ::std::mem::transmute(self._bitfield_1.get(3usize, 3u8) as u32) }
    }
    #[inline]
    pub fn set_mv_mode2(&mut self, val: u32) {
        unsafe {
            let val: u32 = ::std::mem::transmute(val);
            self._bitfield_1.set(3usize, 3u8, val as u64)
        }
    }
    #[inline]
    pub fn mv_table(&self) -> u32 {
        unsafe { ::std::mem::transmute(self._bitfield_1.get(6usize, 3u8) as u32) }
    }
    #[inline]
    pub fn set_mv_table(&mut self, val: u32) {
        unsafe {
            let val: u32 = ::std::mem::transmute(val);
            self._bitfield_1.set(6usize, 3u8, val as u64)
        }
    }
    #[inline]
    pub fn two_mv_block_pattern_table(&self) -> u32 {
        unsafe { ::std::mem::transmute(self._bitfield_1.get(9usize, 2u8) as u32) }
    }
    #[inline]
    pub fn set_two_mv_block_pattern_table(&mut self, val: u32) {
        unsafe {
            let val: u32 = ::std::mem::transmute(val);
            self._bitfield_1.set(9usize, 2u8, val as u64)
        }
    }
    #[inline]
    pub fn four_mv_switch(&self) -> u32 {
        unsafe { ::std::mem::transmute(self._bitfield_1.get(11usize, 1u8) as u32) }
    }
    #[inline]
    pub fn set_four_mv_switch(&mut self, val: u32) {
        unsafe {
            let val: u32 = ::std::mem::transmute(val);
            self._bitfield_1.set(11usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub fn four_mv_block_pattern_table(&self) -> u32 {
        unsafe { ::std::mem::transmute(self._bitfield_1.get(12usize, 2u8) as u32) }
    }
    #[inline]
    pub fn set_four_mv_block_pattern_table(&mut self, val: u32) {
        unsafe {
            let val: u32 = ::std::mem::transmute(val);
            self._bitfield_1.set(12usize, 2u8, val as u64)
        }
    }
    #[inline]
    pub fn extended_mv_flag(&self) -> u32 {
        unsafe { ::std::mem::transmute(self._bitfield_1.get(14usize, 1u8) as u32) }
    }
    #[inline]
    pub fn set_extended_mv_flag(&mut self, val: u32) {
        unsafe {
            let val: u32 = ::std::mem::transmute(val);
            self._bitfield_1.set(14usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub fn extended_mv_range(&self) -> u32 {
        unsafe { ::std::mem::transmute(self._bitfield_1.get(15usize, 2u8) as u32) }
    }
    #[inline]
    pub fn set_extended_mv_range(&mut self, val: u32) {
        unsafe {
            let val: u32 = ::std::mem::transmute(val);
            self._bitfield_1.set(15usize, 2u8, val as u64)
        }
    }
    #[inline]
    pub fn extended_dmv_flag(&self) -> u32 {
        unsafe { ::std::mem::transmute(self._bitfield_1.get(17usize, 1u8) as u32) }
    }
    #[inline]
    pub fn set_extended_dmv_flag(&mut self, val: u32) {
        unsafe {
            let val: u32 = ::std::mem::transmute(val);
            self._bitfield_1.set(17usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub fn extended_dmv_range(&self) -> u32 {
        unsafe { ::std::mem::transmute(self._bitfield_1.get(18usize, 2u8) as u32) }
    }
    #[inline]
    pub fn set_extended_dmv_range(&mut self, val: u32) {
        unsafe {
            let val: u32 = ::std::mem::transmute(val);
            self._bitfield_1.set(18usize, 2u8, val as u64)
        }
    }
    #[inline]
    pub fn new_bitfield_1(
        mv_mode: u32,
        mv_mode2: u32,
        mv_table: u32,
        two_mv_block_pattern_table: u32,
        four_mv_switch: u32,
        four_mv_block_pattern_table: u32,
        extended_mv_flag: u32,
        extended_mv_range: u32,
        extended_dmv_flag: u32,
        extended_dmv_range: u32,
    ) -> __BindgenBitfieldUnit<[u8; 3usize]> {
        let mut __bindgen_bitfield_unit: __BindgenBitfieldUnit<[u8; 3usize]> = Default::default();
        __bindgen_bitfield_unit.set(0usize, 3u8, {
            let mv_mode: u32 = unsafe { ::std::mem::transmute(mv_mode) };
            mv_mode as u64
        });
        __bindgen_bitfield_unit.set(3usize, 3u8, {
            let mv_mode2: u32 = unsafe { ::std::mem::transmute(mv_mode2) };
            mv_mode2 as u64
        });
        __bindgen_bitfield_unit.set(6usize, 3u8, {
            let mv_table: u32 = unsafe { ::std::mem::transmute(mv_table) };
            mv_table as u64
        });
        __bindgen_bitfield_unit.set(9usize, 2u8, {
            let two_mv_block_pattern_table: u32 =
                unsafe { ::std::mem::transmute(two_mv_block_pattern_table) };
            two_mv_block_pattern_table as u64
        });
        __bindgen_bitfield_unit.set(11usize, 1u8, {
            let four_mv_switch: u32 = unsafe { ::std::mem::transmute(four_mv_switch) };
            four_mv_switch as u64
        });
        __bindgen_bitfield_unit.set(12usize, 2u8, {
            let four_mv_block_pattern_table: u32 =
                unsafe { ::std::mem::transmute(four_mv_block_pattern_table) };
            four_mv_block_pattern_table as u64
        });
        __bindgen_bitfield_unit.set(14usize, 1u8, {
            let extended_mv_flag: u32 = unsafe { ::std::mem::transmute(extended_mv_flag) };
            extended_mv_flag as u64
        });
        __bindgen_bitfield_unit.set(15usize, 2u8, {
            let extended_mv_range: u32 = unsafe { ::std::mem::transmute(extended_mv_range) };
            extended_mv_range as u64
        });
        __bindgen_bitfield_unit.set(17usize, 1u8, {
            let extended_dmv_flag: u32 = unsafe { ::std::mem::transmute(extended_dmv_flag) };
            extended_dmv_flag as u64
        });
        __bindgen_bitfield_unit.set(18usize, 2u8, {
            let extended_dmv_range: u32 = unsafe { ::std::mem::transmute(extended_dmv_range) };
            extended_dmv_range as u64
        });
        __bindgen_bitfield_unit
    }
}
#[test]
fn bindgen_test_layout__VAPictureParameterBufferVC1__bindgen_ty_8() {
    assert_eq!(
        ::std::mem::size_of::<_VAPictureParameterBufferVC1__bindgen_ty_8>(),
        4usize,
        concat!(
            "Size of: ",
            stringify!(_VAPictureParameterBufferVC1__bindgen_ty_8)
        )
    );
    assert_eq!(
        ::std::mem::align_of::<_VAPictureParameterBufferVC1__bindgen_ty_8>(),
        4usize,
        concat!(
            "Alignment of ",
            stringify!(_VAPictureParameterBufferVC1__bindgen_ty_8)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<_VAPictureParameterBufferVC1__bindgen_ty_8>())).bits as *const _
                as usize
        },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(_VAPictureParameterBufferVC1__bindgen_ty_8),
            "::",
            stringify!(bits)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<_VAPictureParameterBufferVC1__bindgen_ty_8>())).value as *const _
                as usize
        },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(_VAPictureParameterBufferVC1__bindgen_ty_8),
            "::",
            stringify!(value)
        )
    );
}
#[repr(C)]
#[derive(Copy, Clone)]
pub union _VAPictureParameterBufferVC1__bindgen_ty_9 {
    pub bits: _VAPictureParameterBufferVC1__bindgen_ty_9__bindgen_ty_1,
    pub value: u32,
}
#[repr(C)]
#[repr(align(4))]
#[derive(Debug, Copy, Clone)]
pub struct _VAPictureParameterBufferVC1__bindgen_ty_9__bindgen_ty_1 {
    pub _bitfield_align_1: [u8; 0],
    pub _bitfield_1: __BindgenBitfieldUnit<[u8; 3usize]>,
    pub __bindgen_padding_0: u8,
}
#[test]
fn bindgen_test_layout__VAPictureParameterBufferVC1__bindgen_ty_9__bindgen_ty_1() {
    assert_eq!(
        ::std::mem::size_of::<_VAPictureParameterBufferVC1__bindgen_ty_9__bindgen_ty_1>(),
        4usize,
        concat!(
            "Size of: ",
            stringify!(_VAPictureParameterBufferVC1__bindgen_ty_9__bindgen_ty_1)
        )
    );
    assert_eq!(
        ::std::mem::align_of::<_VAPictureParameterBufferVC1__bindgen_ty_9__bindgen_ty_1>(),
        4usize,
        concat!(
            "Alignment of ",
            stringify!(_VAPictureParameterBufferVC1__bindgen_ty_9__bindgen_ty_1)
        )
    );
}
impl _VAPictureParameterBufferVC1__bindgen_ty_9__bindgen_ty_1 {
    #[inline]
    pub fn dquant(&self) -> u32 {
        unsafe { ::std::mem::transmute(self._bitfield_1.get(0usize, 2u8) as u32) }
    }
    #[inline]
    pub fn set_dquant(&mut self, val: u32) {
        unsafe {
            let val: u32 = ::std::mem::transmute(val);
            self._bitfield_1.set(0usize, 2u8, val as u64)
        }
    }
    #[inline]
    pub fn quantizer(&self) -> u32 {
        unsafe { ::std::mem::transmute(self._bitfield_1.get(2usize, 2u8) as u32) }
    }
    #[inline]
    pub fn set_quantizer(&mut self, val: u32) {
        unsafe {
            let val: u32 = ::std::mem::transmute(val);
            self._bitfield_1.set(2usize, 2u8, val as u64)
        }
    }
    #[inline]
    pub fn half_qp(&self) -> u32 {
        unsafe { ::std::mem::transmute(self._bitfield_1.get(4usize, 1u8) as u32) }
    }
    #[inline]
    pub fn set_half_qp(&mut self, val: u32) {
        unsafe {
            let val: u32 = ::std::mem::transmute(val);
            self._bitfield_1.set(4usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub fn pic_quantizer_scale(&self) -> u32 {
        unsafe { ::std::mem::transmute(self._bitfield_1.get(5usize, 5u8) as u32) }
    }
    #[inline]
    pub fn set_pic_quantizer_scale(&mut self, val: u32) {
        unsafe {
            let val: u32 = ::std::mem::transmute(val);
            self._bitfield_1.set(5usize, 5u8, val as u64)
        }
    }
    #[inline]
    pub fn pic_quantizer_type(&self) -> u32 {
        unsafe { ::std::mem::transmute(self._bitfield_1.get(10usize, 1u8) as u32) }
    }
    #[inline]
    pub fn set_pic_quantizer_type(&mut self, val: u32) {
        unsafe {
            let val: u32 = ::std::mem::transmute(val);
            self._bitfield_1.set(10usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub fn dq_frame(&self) -> u32 {
        unsafe { ::std::mem::transmute(self._bitfield_1.get(11usize, 1u8) as u32) }
    }
    #[inline]
    pub fn set_dq_frame(&mut self, val: u32) {
        unsafe {
            let val: u32 = ::std::mem::transmute(val);
            self._bitfield_1.set(11usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub fn dq_profile(&self) -> u32 {
        unsafe { ::std::mem::transmute(self._bitfield_1.get(12usize, 2u8) as u32) }
    }
    #[inline]
    pub fn set_dq_profile(&mut self, val: u32) {
        unsafe {
            let val: u32 = ::std::mem::transmute(val);
            self._bitfield_1.set(12usize, 2u8, val as u64)
        }
    }
    #[inline]
    pub fn dq_sb_edge(&self) -> u32 {
        unsafe { ::std::mem::transmute(self._bitfield_1.get(14usize, 2u8) as u32) }
    }
    #[inline]
    pub fn set_dq_sb_edge(&mut self, val: u32) {
        unsafe {
            let val: u32 = ::std::mem::transmute(val);
            self._bitfield_1.set(14usize, 2u8, val as u64)
        }
    }
    #[inline]
    pub fn dq_db_edge(&self) -> u32 {
        unsafe { ::std::mem::transmute(self._bitfield_1.get(16usize, 2u8) as u32) }
    }
    #[inline]
    pub fn set_dq_db_edge(&mut self, val: u32) {
        unsafe {
            let val: u32 = ::std::mem::transmute(val);
            self._bitfield_1.set(16usize, 2u8, val as u64)
        }
    }
    #[inline]
    pub fn dq_binary_level(&self) -> u32 {
        unsafe { ::std::mem::transmute(self._bitfield_1.get(18usize, 1u8) as u32) }
    }
    #[inline]
    pub fn set_dq_binary_level(&mut self, val: u32) {
        unsafe {
            let val: u32 = ::std::mem::transmute(val);
            self._bitfield_1.set(18usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub fn alt_pic_quantizer(&self) -> u32 {
        unsafe { ::std::mem::transmute(self._bitfield_1.get(19usize, 5u8) as u32) }
    }
    #[inline]
    pub fn set_alt_pic_quantizer(&mut self, val: u32) {
        unsafe {
            let val: u32 = ::std::mem::transmute(val);
            self._bitfield_1.set(19usize, 5u8, val as u64)
        }
    }
    #[inline]
    pub fn new_bitfield_1(
        dquant: u32,
        quantizer: u32,
        half_qp: u32,
        pic_quantizer_scale: u32,
        pic_quantizer_type: u32,
        dq_frame: u32,
        dq_profile: u32,
        dq_sb_edge: u32,
        dq_db_edge: u32,
        dq_binary_level: u32,
        alt_pic_quantizer: u32,
    ) -> __BindgenBitfieldUnit<[u8; 3usize]> {
        let mut __bindgen_bitfield_unit: __BindgenBitfieldUnit<[u8; 3usize]> = Default::default();
        __bindgen_bitfield_unit.set(0usize, 2u8, {
            let dquant: u32 = unsafe { ::std::mem::transmute(dquant) };
            dquant as u64
        });
        __bindgen_bitfield_unit.set(2usize, 2u8, {
            let quantizer: u32 = unsafe { ::std::mem::transmute(quantizer) };
